[
  {
    "title": "Would the Patriots’ dynasty have ever happened without new Hall of Famer Adam Vinatieri?",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/07/adam-vinatieri-patriots-hall-of-fame/",
    "author": "Chad Finn",
    "section": "Sports",
    "published": "2026-02-07T15:50:34.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/3P6CI76PEPABTFOOQWUPYBVSFY-69870f94d44b3-768x432.jpg",
    "bullets": [
      "Adam Vinatieri, former Patriots and Colts kicker, was named to the Pro Football Hall of Fame 2026 class.",
      "Vinatieri, known for clutch performances, helped secure three Super Bowl wins for the Patriots with decisive field goals.",
      "With 2,673 points, Vinatieri holds the NFL record and was pivotal in Patriots' early 2000s success."
    ]
  },
  {
    "title": "Mike Vrabel throws a wrinkle in Patriots&#8217; final practice ahead of Super Bowl LX",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/07/mike-vrabel-patriots-super-bowl-halftime-show/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2026-02-07T15:50:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/OMF2TRVMDVB4PABQNST2RBESME-69875b125ed53-768x432.jpg",
    "bullets": [
      "Mike Vrabel simulated a longer halftime at the Patriots' final practice to prepare for Super Bowl LX.",
      "Rapper Cardi B, linked to player Stefon Diggs, is rumored as a possible guest for the Super Bowl halftime show.",
      "Patriots players Harold Landry III and Robert Spillane were limited in practice with injuries ahead of the Super Bowl."
    ]
  },
  {
    "title": "Patriots-Seahawks Super Bowl will likely come down to which quarterback makes the fewest mistakes",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/07/patriots-seahawks-super-bowl-lx-preview/",
    "author": "Chad Finn",
    "section": "Sports",
    "published": "2026-02-07T15:45:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/TRFXLZ3XLFQOVOOEHU72P7KUBA-69875d637a236-768x432.jpg",
    "bullets": [
      "The Patriots face the Seahawks in Super Bowl LX with quarterbacks Drake Maye and Sam Darnold as key players.",
      "Both teams are well-matched, with the Patriots scoring 28.8 points per game and Seahawks conceding 17.2 points per game.",
      "Jaxon Smith-Njigba and Stefon Diggs are notable wide receivers to watch in a game likely hinging on quarterbacks' performance."
    ]
  },
  {
    "title": "Mass. company pleads guilty to OSHA violation that led to employee&#8217;s death",
    "url": "https://www.boston.com/news/local-news/2026/02/07/mass-company-pleads-guilty-to-osha-violation-that-led-to-employees-death/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2026-02-07T15:16:46.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "John Oliveira & Sons Stamp Concrete, Inc. pleaded guilty to violating OSHA standards in a 2023 incident that killed Josué Tiquiram.",
      "The company failed to install a safety device on a malfunctioning soil screener, resulting in fatal head injuries to the worker.",
      "The company faces up to five years of probation, a $500,000 fine, and restitution to the victim's estate; sentencing is May 4."
    ]
  },
  {
    "title": "Here&#8217;s what Healey put up in her Super Bowl bet with Washington state governor",
    "url": "https://www.boston.com/news/local-news/2026/02/07/heres-what-healey-put-up-in-her-super-bowl-bet-with-washington-state-governor/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2026-02-07T14:43:03.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Mass. Gov. Maura Healey wagered clam chowder, lobster rolls, and Dunkin' coffee on the Patriots winning the Super Bowl.",
      "Washington Gov. Bob Ferguson bet Seattle's shellfish and coffee if the Seahawks lose to the Patriots in Super Bowl LX.",
      "Gov. Healey declared this weekend New England Patriots Appreciation Weekend, encouraging statewide participation in Super Bowl observance."
    ]
  },
  {
    "title": "Woman convicted of fraud after living under a stolen identity for more than 20 years",
    "url": "https://www.boston.com/news/local-news/2026/02/07/woman-convicted-of-fraud-after-living-under-a-stolen-identity-for-more-than-20-years/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2026-02-07T13:34:32.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Lina Maria Orovio-Hernandez convicted in Boston for identity theft and fraud, collecting $400,000 in stolen benefits.",
      "Orovio-Hernandez, using a stolen identity, obtained nine state IDs and voted fraudulently in the 2024 presidential election.",
      "She faces up to 10 years in prison, with possible deportation after serving her sentence, and fines up to $250,000."
    ]
  },
  {
    "title": "Celtics rally from 22 down in Vucevic’s debut to beat Heat: 6 takeaways",
    "url": "https://www.boston.com/sports/boston-celtics/2026/02/07/celtics-heat-nikola-vucevics-debut-takeaways/",
    "author": "Tom Westerholm",
    "section": "Sports",
    "published": "2026-02-07T12:43:23.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/PQ52IA2HDOQE4CG7FVIIAWB2GM-69870ff67038b-768x432.jpg",
    "bullets": [
      "Nikola Vucevic debuted with the Celtics, recording 11 points and 12 rebounds in a comeback win against the Heat.",
      "Celtics overcame a 21-point deficit at halftime, ultimately defeating the Heat 98-96 at TD Garden.",
      "Payton Pritchard and Derrick White played pivotal roles in the Celtics' second-half resurgence to secure victory."
    ]
  },
  {
    "title": "Tom Brady shows support for Patriots ahead of Super Bowl LX after saying he ‘doesn’t have a dog in the fight’",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/06/tom-brady-patriots-super-bowl-lx-comments/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2026-02-07T03:19:59.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/KSOCAZWQNGEQBRQA2LAVZDRFSA-6986a9467eaae-768x432.jpg",
    "bullets": [
      "Tom Brady initially declared neutrality for Super Bowl LX, stating he wasn't rooting for former team Patriots against the Seahawks.",
      "Brady later expressed support for Patriots owner Robert Kraft on Instagram, encouraging the team to win their 7th ring.",
      "Brady's comments caused backlash from former teammate Vince Wilfork and current player Robert Spillane for lacking public support."
    ]
  },
  {
    "title": "Former Colts Pro Bowl center thinks Drake Maye should have won NFL MVP over Matthew Stafford",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/06/drake-maye-matthew-stafford-nfl-mvp/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2026-02-07T01:48:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/HOCIJC3JTZHVTP27N5J7S5DDF4-69868bde24db5-768x432.jpg",
    "bullets": [
      "Debate surrounds Drake Maye and Matthew Stafford in NFL MVP voting; Stafford won by six points.",
      "Former Colts center Jeff Saturday believes Maye deserved the MVP over Stafford due to his dual-threat capability.",
      "ESPN analyst Mina Kimes supported Maye, citing dominance in key stats and efficiency over Stafford."
    ]
  },
  {
    "title": "5 X-factors for Patriots, Seahawks in Super Bowl LX",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/06/patriots-seahawks-super-bowl-x-factors-matchups-lx-new-england-seattle/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2026-02-07T01:30:03.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Texans_Patriots_Football_91043-69868c580b16f-768x432.jpg",
    "bullets": [
      "Sam Darnold's ability to handle New England's blitz-heavy defense could be crucial in Super Bowl LX.",
      "Patriots' Robert Spillane is questionable due to an ankle injury, impacting their run defense strategy.",
      "Seattle's defensive line aims to pressure Patriots' rookie offensive linemen, challenging quarterback Drake Maye."
    ]
  }
]