[
  {
    "title": "Patriots injury report: Christian Gonzalez, Keion White ruled out vs. Dolphins",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/09/12/patriots-dolphins-week-2-injury-report-christian-gonzalez/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-09-12T21:50:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/C4ARJE66NY5TUUBZKHBFMG63CU-68c48cda2d046-768x432.jpg",
    "bullets": [
      "Patriots' Christian Gonzalez and Keion White ruled out for Sunday's game against the Miami Dolphins.",
      "Gonzalez, suffering from a hamstring injury, has not practiced since July 28 and missed Week 1.",
      "Keion White, dealing with an illness, played 46% of defensive snaps in the Week 1 loss to the Raiders."
    ]
  },
  {
    "title": "With DC Terrell Williams out, who will be calling defensive plays for Patriots vs. Dolphins?",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/09/12/patriots-terrell-williams-defensive-coordinator-zak-kuhr-mike-vrabel/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-09-12T20:38:13.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/PHOHO4F3K3RDXUMUQK3WAVWFSI-68c481b4a17d0-768x432.jpg",
    "bullets": [
      "Patriots' Zak Kuhr will call defensive plays against Dolphins due to Terrell Williams's health absence.",
      "Kuhr, in his first season as Patriots inside linebackers coach, previously filled in during offseason practices.",
      "Coach Mike Vrabel expressed confidence in Kuhr's preparation and play-calling ability for the upcoming game."
    ]
  },
  {
    "title": "Boston activist Monica Cannon-Grant to plead guilty in federal fraud case",
    "url": "https://www.boston.com/news/crime/2025/09/12/boston-activist-monica-cannon-grant-plead-guilty-federal-fraud-case/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T20:09:09.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/LEPFJNJYVHVKB67HBTD3F4R6T4-68c453d67d0d8-768x432.jpg",
    "bullets": [
      "Monica Cannon-Grant plans to plead guilty to charges in a federal fraud case just weeks before her trial.",
      "Cannon-Grant and her late husband indicted for fraudulently using nonprofit funds and other financial misconduct in 2022.",
      "She faces a 27-count indictment including conspiracy, wire fraud, and tax violations, potentially resulting in severe penalties."
    ]
  },
  {
    "title": "Here&#8217;s what we know about Tyler Robinson, Charlie Kirk&#8217;s alleged assassin",
    "url": "https://www.boston.com/news/national-news/2025/09/12/tyler-robinson/",
    "author": "The Associated Press",
    "section": "News",
    "published": "2025-09-12T19:42:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Charlie_Kirk_Shot_40179-68c476a6d1732-768x432.jpg",
    "bullets": [
      "Tyler Robinson, 22, of Washington, Utah, was arrested for allegedly shooting Charlie Kirk at Utah Valley University.",
      "Robinson, a third-year student at Dixie Technical College, became politically active recently and viewed Kirk as spreading hate.",
      "Robinson's family reported his involvement in the shooting, leading to his arrest; he has no prior criminal record."
    ]
  },
  {
    "title": "7 things to know about a pivotal Red Sox-Yankees series",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/12/red-sox-yankees-preview-playoff-picture/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-09-12T19:24:06.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/S73WDOFBQNDYXFYFO2PJXNU5UU-68c46e7f58326-768x432.webp",
    "bullets": [
      "Red Sox and Yankees are neck-and-neck in AL wild card standings, with Yankees holding a half-game advantage.",
      "Boston leads the season series against New York 8-2, dominating with strong performances from pitchers like Brayan Bello.",
      "The Red Sox placed Brennan Bernardino on the injured list, calling up Chris Murphy ahead of the pivotal series."
    ]
  },
  {
    "title": "Winthrop loses $1.2M in climate grants over MBTA Communities Act noncompliance",
    "url": "https://www.boston.com/news/local-news/2025/09/12/winthrop-loses-million-climate-grants/",
    "author": "Annie Jonas",
    "section": "News",
    "published": "2025-09-12T19:08:58.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2018_03_02_BostonGlobe.com_Metro_Images_Boghosian_03storm12_MET-68c465e3a1c0f-768x432.jpg",
    "bullets": [
      "Winthrop lost $1.2 million in state grants for flood mitigation due to noncompliance with the MBTA Communities Act.",
      "The Executive Office of Energy and Environmental Affairs cited the town's refusal to adopt zoning for multi-family housing.",
      "The funding loss affects flood-prone areas like Morton Street and Fisherman's Bend, heightening taxpayer costs and flood risks."
    ]
  },
  {
    "title": "Healey orders flags at state buildings flown at half-staff to honor Charlie Kirk",
    "url": "https://www.boston.com/news/politics/2025/09/12/flags-massachusetts-buildings-half-staff-charlie-kirk/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T18:43:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Kirk-68c1fc020d806-768x432.jpg",
    "bullets": [
      "Gov. Maura Healey ordered Massachusetts flags at half-staff to honor Charlie Kirk, following President Trump's proclamation.",
      "Charlie Kirk, a conservative activist, was assassinated at a Utah Valley University event while answering a question on gun violence.",
      "Authorities arrested 22-year-old Tyler Robinson in connection with the killing; the motive remains unclear."
    ]
  },
  {
    "title": "A family-friendly guide to apple picking in New England",
    "url": "https://www.boston.com/travel/travel/2025/09/12/a-family-friendly-guide-to-apple-picking-in-new-england/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-09-12T17:57:11.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/09/hpho1-66e47e71d65a3-768x432.jpg",
    "bullets": [
      "Honey Pot Hill Orchards in Stow features over 30 apple varieties, farm animals, and three mazes for children.",
      "Cider Hill Farm in Amesbury offers over 60 apple varieties, a trike yard, and a hard cider bar for visitors.",
      "Applecrest Farm Orchards in Hampton Falls includes a petting zoo, corn maze, and themed harvest festivals."
    ]
  },
  {
    "title": "Judge tosses ordinance limiting tear gas, rubber bullet use by Boston police",
    "url": "https://www.boston.com/news/local-news/2025/09/12/judge-tosses-ordinance-limiting-tear-gas-rubber-bullet-use-boston-police/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T17:28:18.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/12/MRUPU6WH3N32DSOI4TYI2V4BFU-676050d893196-768x432.jpg",
    "bullets": [
      "Judge Jackie Cowin invalidated Boston's ordinance limiting tear gas and rubber bullet use, citing city council overreach.",
      "The 2021 ordinance required police supervisors to witness violence before authorizing crowd control methods.",
      "Boston hasn't enforced the ordinance, and the authority over weapon deployment is reserved for the Police Commissioner."
    ]
  },
  {
    "title": "Did a Brooklyn couple kill a neighbor’s trees for a better view in Maine?",
    "url": "https://www.boston.com/news/local-news/2025/09/12/did-a-brooklyn-couple-kill-a-neighbors-trees-for-a-better-view-in-maine/",
    "author": "New York Times Service",
    "section": "News",
    "published": "2025-09-12T17:14:33.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___nytapi.wieck_.com_feed-photos_6mT6A07m-68c45114896fe-768x432.jpg",
    "bullets": [
      "Stephen Antonson and Kathleen Hackett are accused of poisoning trees to improve harbor views from their Rockport, Maine home.",
      "Ruth Graham, a 95-year-old neighbor, reported the damage after noticing her trees dying and herbicidal poison was found in tree bore holes.",
      "Maine's Board of Pesticides Control is investigating; Antonson and Hackett have denied the accusations and have not commented further."
    ]
  }
]