[
  {
    "title": "Magic pull away, beat Celtics despite another big Jaylen Brown game: 8 takeaways",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/07/celtics-magic-jaylen-brown-takeaways/",
    "author": "Tom Westerholm",
    "section": "Sports",
    "published": "2025-11-08T04:02:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/7MCXKLIZXPQQ6FMHON33UAQCVQ-690ebe91a7209-768x432.jpg",
    "bullets": [
      "The Boston Celtics lost 123-110 to the Orlando Magic, despite Jaylen Brown scoring 32 points on 15-for-28 shooting.",
      "The Magic excelled from three-point range, hitting 17 of 36 attempts, while the Celtics struggled with long-range shooting.",
      "Celtics' defense and center performance were lacking, with weak contributions after Neemias Queta left the court."
    ]
  },
  {
    "title": "Public reprimand recommended for judge accused of helping immigrant escape ICE",
    "url": "https://www.boston.com/news/local-news/2025/11/07/public-reprimand-recommended-for-judge-accused-of-helping-immigrant-escape-ice/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-08T02:54:29.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Judge Shelley Joseph recommended for public reprimand for creating an 'appearance of impropriety' in a 2018 ICE-related incident.",
      "A report found Joseph did not know or authorize the plan to help a defendant evade ICE but unintentionally violated rules.",
      "Federal obstruction charges against Joseph were dropped in 2022, and she referred herself for a state misconduct investigation."
    ]
  },
  {
    "title": "Alex Cora still high on Red Sox’ future a month after being eliminated by Yankees",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/alex-cora-red-sox-future/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-08T02:40:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/GI4FEZRTXITRY6KNABMHPYJWWI-690ea1593e6d5-768x432.jpg",
    "bullets": [
      "The Boston Red Sox were eliminated by the Yankees in the American League Wild Card Series, losing two out of three games.",
      "Key player updates include shortstop Trevor Story opting into his contract, while third baseman Alex Bregman chose to opt out.",
      "Manager Alex Cora expressed optimism for the team's future, highlighting progress and postseason experience gained despite roster changes."
    ]
  },
  {
    "title": "Giant blade breaks off Mass. wind turbine",
    "url": "https://www.boston.com/uncategorized/local-news/2025/11/07/giant-blade-breaks-off-mass-wind-turbine/",
    "author": "Morgan Rousseau",
    "section": "Uncategorized",
    "published": "2025-11-08T01:26:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "A 75 to 100-foot blade detached from a 300-foot wind turbine in Plymouth, Massachusetts, landing in a cranberry bog.",
      "No injuries occurred, and the turbine automatically shut down into 'fail-safe mode' after the blade broke off.",
      "Officials, including police and maintenance crews, secured and cleaned the site; the incident is under investigation by MassDEP and Inspectional Services."
    ]
  },
  {
    "title": "5 must-watch movies &#038; TV shows streaming right now",
    "url": "https://www.boston.com/culture/streaming/2025/11/07/5-must-watch-movies-tv-shows-streaming-right-now-november-7-2025/",
    "author": "Kevin Slane",
    "section": "Culture",
    "published": "2025-11-08T01:01:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/06/materialists-review-684c76aeb5c14-768x432.jpg",
    "bullets": [
      "'The Fantastic Four: First Steps' on Disney+ is a new adaptation of Marvel's superhero story.",
      "Guillermo del Toro's 'Frankenstein' offers a unique take on the classic novel, now streaming on Netflix.",
      "'Squid Game: The Challenge' Season 2 features 456 contestants competing for $4 million on Netflix."
    ]
  },
  {
    "title": "Stefon Diggs reveals what he’s trying to improve about himself after 11 years in the NFL",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/07/stefon-diggs-patriots-attitude/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-07T23:56:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/P5M3VBXS54IFLKKYQNH27GTVNA-690e77f421be6-768x432.jpg",
    "bullets": [
      "Stefon Diggs aims to improve his attitude in his 11th NFL season, seeking more patience and realistic expectations.",
      "Diggs leads Patriots receivers in multiple categories, including 508 receiving yards and 45 receptions through nine games.",
      "Diggs praises Patriots coaches for their direct communication and fostering a supportive environment for player development."
    ]
  },
  {
    "title": "Commuter train plows through car on tracks in Acton",
    "url": "https://www.boston.com/news/local-news/2025/11/07/commuter-train-plows-through-car-on-tracks-in-acton/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-07T23:16:56.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/KJDIQ5UUZ5FE7MJNIODAKALTYI-690d6322ea85e-768x432.jpg",
    "bullets": [
      "An MBTA commuter train collided with an empty car on the tracks in Acton, causing 300 feet displacement but no injuries.",
      "The Acton crash occurred at the Central Street crossing; the car bypassed closed gates before the collision.",
      "The incident delayed Fitchburg line services, affecting Train 1427, and a citation was issued to the unidentified driver."
    ]
  },
  {
    "title": "What to know about possible Red Sox free agent target Munetaka Murakami after posting",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/munetaka-murakami-red-sox-mlb-free-agency-rumors/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-11-07T21:40:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/DVDHDUJ633XTHRJXKVRJR2N2UY-690e632d77a32-768x432.jpg",
    "bullets": [
      "Munetaka Murakami has been posted by the Tokyo Yakult Swallows and has until December 22 to sign with an MLB team.",
      "Murakami, known as the \"Japanese Babe Ruth,\" hit 56 home runs in 2022 and has consistently showcased power hitting.",
      "The Red Sox are among potential MLB teams interested in Murakami, who could play third base, first base, or designated hitter."
    ]
  },
  {
    "title": "Airlines are waiving fees, offering refunds due to reduced flight schedules",
    "url": "https://www.boston.com/travel/flights/2025/11/07/airlines-are-waiving-fees-offerings-refunds-due-to-reduced-flight-schedules/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-11-07T21:10:31.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/01/DPYQ67JGZN7634F3EEUM2AOS3M-679b06305f72a-768x432.jpg",
    "bullets": [
      "Airlines are waiving fees and offering refunds after FAA reduced flights by 10% at 40 airports due to a government shutdown.",
      "Passengers at Logan Airport face delays and cancellations; Massport advises checking flight status before heading to the airport.",
      "JetBlue, Southwest, United, American, Delta, and Spirit offer rebooking and refunds for affected travelers on specific travel dates."
    ]
  },
  {
    "title": "After Cape Cod crash, readers say Mass. should tighten e-bike regulations",
    "url": "https://www.boston.com/community/readers-say/2025/11/07/massachusetts-should-tighten-ebike-regulations/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-07T20:50:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/6L3T6GPLTKEVUWZ5WJKMGRBWY4-690e57abc1ccd-768x432.jpg",
    "bullets": [
      "A crash on Cape Cod involving an e-bike has sparked debate over tightening electric bicycle regulations in Massachusetts.",
      "Lynne Forester, injured in the crash, advocates for stricter e-bike rules to protect pedestrians on shared trails.",
      "Among 580 respondents, 78% favor stronger e-bike regulations, while 20% oppose, citing the need for better infrastructure."
    ]
  }
]