[
  {
    "title": "A family-friendly guide to apple picking in New England",
    "url": "https://www.boston.com/travel/travel/2025/09/12/a-family-friendly-guide-to-apple-picking-in-new-england/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-09-12T17:57:11.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/09/hpho1-66e47e71d65a3-768x432.jpg",
    "bullets": [
      "Honey Pot Hill Orchards in Stow, MA, offers apple picking, mazes, and a petting zoo, praised for its cider doughnuts.",
      "Cider Hill Farm in Amesbury, MA, features over 60 apple varieties, family activities, and a hard cider bar for adults.",
      "Applecrest Farm Orchards in Hampton Falls, NH, has live music, petting zoo, hayrides, and themed events during fall festivals."
    ]
  },
  {
    "title": "Judge tosses ordinance limiting tear gas, rubber bullet use by Boston police",
    "url": "https://www.boston.com/news/local-news/2025/09/12/judge-tosses-ordinance-limiting-tear-gas-rubber-bullet-use-boston-police/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T17:28:18.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/12/MRUPU6WH3N32DSOI4TYI2V4BFU-676050d893196-768x432.jpg",
    "bullets": [
      "Judge Jackie Cowin ruled Boston City Council exceeded its authority with a 2021 ordinance limiting police weapon use.",
      "The invalidated ordinance required stringent conditions before using tear gas and rubber bullets in crowd control situations.",
      "Boston police unions challenged the ordinance; Cowin determined it conflicted with powers granted to the Police Commissioner."
    ]
  },
  {
    "title": "Did a Brooklyn couple kill a neighbor’s trees for a better view in Maine?",
    "url": "https://www.boston.com/news/local-news/2025/09/12/did-a-brooklyn-couple-kill-a-neighbors-trees-for-a-better-view-in-maine/",
    "author": "New York Times Service",
    "section": "News",
    "published": "2025-09-12T17:14:33.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___nytapi.wieck_.com_feed-photos_6mT6A07m-68c45114896fe-768x432.jpg",
    "bullets": [
      "Stephen Antonson and Kathleen Hackett are accused of poisoning a neighbor's trees in Rockport, Maine, for a harbor view.",
      "The couple denies involvement, though tests found herbicidal poison in trees directly aligned with their property.",
      "Ruth Graham, the 95-year-old neighbor, previously declined the couple's request to clear the land for better views."
    ]
  },
  {
    "title": "Pharma giant with large Mass. footprint to slash 9,000 jobs globally",
    "url": "https://www.boston.com/news/business/2025/09/12/pharma-giant-with-large-mass-footprint-to-slash-9000-jobs-globally/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-12T17:12:46.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___news-service.s3.amazonaws.com_novo-bg-L6PHAEZU2ZGDBAVRRQYPBUCCPA-68c44e63339b5-768x432.jpg",
    "bullets": [
      "Novo Nordisk announced it will cut 9,000 global jobs by the end of 2026, citing organizational complexity.",
      "Boston operations remain uncertain, but Novo Nordisk's Massachusetts sites, with 450 employees, could be affected differently.",
      "The company aims for annual savings of $1.25 billion, focusing on diabetes and obesity market growth opportunities."
    ]
  },
  {
    "title": "Police officer, suspect shot in Roxbury during chase",
    "url": "https://www.boston.com/news/crime/2025/09/12/police-officer-suspect-shot-in-roxbury-during-chase/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T16:41:29.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2024/09/Police_Staffing_Shortages_64169-66e3a9b64a9f4.jpg",
    "bullets": [
      "A Boston police officer and a suspect were shot in Roxbury during a foot chase early Friday morning.",
      "The suspect allegedly fired at officers, injuring one, before police returned fire, striking the suspect multiple times.",
      "Both the officer and suspect were hospitalized with non-life-threatening injuries, and a high-capacity firearm was recovered."
    ]
  },
  {
    "title": "The last person to question Charlie Kirk",
    "url": "https://www.boston.com/news/national-news/2025/09/12/the-last-person-to-question-charlie-kirk/",
    "author": "Jack Healy and Reid J. Epstein, The New York Times",
    "section": "News",
    "published": "2025-09-12T16:27:48.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/APTOPIX_Charlie_Kirk_Shot_56517-68c2be20b3151-768x432.jpg",
    "bullets": [
      "Charlie Kirk was assassinated at a rally in Utah; the last to question him was TikToker Hunter Kozak.",
      "Hunter Kozak, a liberal TikToker, discussed free speech and mass shootings with Kirk before the shooting occurred.",
      "Kozak expresses concerns for his safety as conspiracies emerge online after the deadly incident at Utah Valley University."
    ]
  },
  {
    "title": "North Andover officer shot by colleague back in jail just days after release",
    "url": "https://www.boston.com/news/local-news/2025/09/12/north-andover-officer-shot-by-colleague-back-in-jail-just-days-after-release/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2025-09-12T15:48:16.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/NIU67MEQK6ZWMG4TB54N4JL4NY-68c43c4671a6a-768x432.jpg",
    "bullets": [
      "North Andover officer Kelsey Fitzsimmons was ordered back to jail, held without bail, for non-compliance with court conditions.",
      "The judge revoked Fitzsimmons's release due to her inability to complete required alcohol testing after sustaining serious injuries.",
      "Fitzsimmons, facing assault charges, and her lawyers suggest using alternative testing methods like urine samples instead."
    ]
  },
  {
    "title": "The owners of the orange dinosaur are suing Saugus. Here’s why.",
    "url": "https://www.boston.com/news/business/2025/09/12/the-owners-of-the-orange-dinosaur-are-suing-saugus-heres-why/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-12T15:41:43.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2017_07_11_BostonGlobe.com_Lifestyle_Images_ryan_dino1_met-68c07feaca532-768x432.jpg",
    "bullets": [
      "TB Holdings LLC is suing Saugus, claiming Town Manager Scott Crabtree pressured them to pay a $200,000 donation.",
      "The lawsuit alleges Crabtree demanded the donation to advance Essex Landing development, claiming arbitrary and discriminatory treatment.",
      "TB Holdings seeks damages, citing $18 million invested and ongoing project delays despite paying the donation."
    ]
  },
  {
    "title": "Heidi Watney happily returns to Fenway with Apple TV+ for Yankees-Red Sox: ‘It’s like coming home’",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/12/heidi-watney-red-sox-yankees-apple-tv/",
    "author": "Chad Finn",
    "section": "Sports",
    "published": "2025-09-12T15:12:44.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/ZIDNMOVWSVA4BIO7YAATZ3HFKQ-68c40e2793200-768x432.jpg",
    "bullets": [
      "Heidi Watney returns to Fenway Park with Apple TV+ for Red Sox-Yankees series, calling it a homecoming.",
      "Watney, a former NESN Red Sox reporter, worked with MLB Network for nine years before joining Apple TV+.",
      "She left NESN in 2011 to be closer to family, now balancing career and family life with Apple TV+."
    ]
  },
  {
    "title": "Brian Walshe reportedly stabbed in jail while awaiting murder trial",
    "url": "https://www.boston.com/news/crime/2025/09/12/brian-walshe-reportedly-stabbed-jail-awaiting-murder-trial/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T14:58:32.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/11/FZYRMNEV354L43OKK2BZHK7MWM-672d02e0081ee-768x432.jpg",
    "bullets": [
      "Brian Walshe was stabbed in Norfolk County Jail while awaiting trial for allegedly murdering his wife in 2023.",
      "The incident occurred Thursday night; Walshe was treated for non-life-threatening injuries and returned to jail.",
      "The Norfolk County Sheriff's Office is investigating; a makeshift weapon was recovered and another inmate subdued."
    ]
  }
]