[
  {
    "title": "Magic pull away, beat Celtics despite another big Jaylen Brown game: 8 takeaways",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/07/celtics-magic-jaylen-brown-takeaways/",
    "author": "Tom Westerholm",
    "section": "Sports",
    "published": "2025-11-08T04:02:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/7MCXKLIZXPQQ6FMHON33UAQCVQ-690ebe91a7209-768x432.jpg",
    "bullets": [
      "The Boston Celtics fell to the Orlando Magic 123-110 in the NBA Cup despite Jaylen Brown scoring 32 points.",
      "Celtics struggled defensively, conceding 38 points in the first and fourth quarters, with Franz Wagner scoring 27 for the Magic.",
      "Jordan Walsh delivered a solid defensive performance for the Celtics, contributing six rebounds and causing turnovers."
    ]
  },
  {
    "title": "Public reprimand recommended for judge accused of helping immigrant escape ICE",
    "url": "https://www.boston.com/news/local-news/2025/11/07/public-reprimand-recommended-for-judge-accused-of-helping-immigrant-escape-ice/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-08T02:54:29.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Judge Shelley Joseph faces a public reprimand for creating an 'appearance of impropriety' in a 2018 ICE incident.",
      "State hearing officer found insufficient evidence that Joseph authorized a migrant's escape but recommended public reprimand.",
      "Federal charges were dropped in 2022, and Joseph agreed to a state agency investigation for possible misconduct."
    ]
  },
  {
    "title": "Alex Cora still high on Red Sox’ future a month after being eliminated by Yankees",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/alex-cora-red-sox-future/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-08T02:40:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/GI4FEZRTXITRY6KNABMHPYJWWI-690ea1593e6d5-768x432.jpg",
    "bullets": [
      "The Red Sox were eliminated by the Yankees in the AL Wild Card Series, ending their 2025 season.",
      "Manager Alex Cora is optimistic about the team's future despite recent roster changes and a disappointing playoffs exit.",
      "Trevor Story opted to stay with Boston, while Alex Bregman chose to leave, and Lucas Giolito didn't receive a qualifying offer."
    ]
  },
  {
    "title": "Giant blade breaks off Mass. wind turbine",
    "url": "https://www.boston.com/uncategorized/local-news/2025/11/07/giant-blade-breaks-off-mass-wind-turbine/",
    "author": "Morgan Rousseau",
    "section": "Uncategorized",
    "published": "2025-11-08T01:26:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "A 75-100 foot blade detached from a 300-foot wind turbine in Plymouth, Massachusetts, landing in a cranberry bog.",
      "No injuries were reported, and the turbine activated its fail-safe mode after the blade detached, shutting down safely.",
      "Authorities are investigating with MassDEP and Inspectional Services to ensure safety and proper cleanup of the affected area."
    ]
  },
  {
    "title": "5 must-watch movies &#038; TV shows streaming right now",
    "url": "https://www.boston.com/culture/streaming/2025/11/07/5-must-watch-movies-tv-shows-streaming-right-now-november-7-2025/",
    "author": "Kevin Slane",
    "section": "Culture",
    "published": "2025-11-08T01:01:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/06/materialists-review-684c76aeb5c14-768x432.jpg",
    "bullets": [
      "'The Fantastic Four: First Steps' is streaming on Disney+, featuring Reed Richards and the team in a joyful, action-packed story.",
      "'Frankenstein', directed by Guillermo del Toro, offers a unique take on Mary Shelley's novel and is available on Netflix.",
      "'Death by Lightning', a Netflix limited series, explores the life and assassination of President James A. Garfield."
    ]
  },
  {
    "title": "Stefon Diggs reveals what he’s trying to improve about himself after 11 years in the NFL",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/07/stefon-diggs-patriots-attitude/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-07T23:56:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/P5M3VBXS54IFLKKYQNH27GTVNA-690e77f421be6-768x432.jpg",
    "bullets": [
      "Stefon Diggs aims to improve his attitude, acknowledging his tendency to strive for perfection and get mad at imperfections.",
      "Diggs, leading Patriots in key receiving stats, signed a three-year, $69 million contract before his 11th NFL season.",
      "Diggs praised Patriots' coaches Josh McDaniels and Todd Downing for fostering a growth-oriented and supportive team environment."
    ]
  },
  {
    "title": "Commuter train plows through car on tracks in Acton",
    "url": "https://www.boston.com/news/local-news/2025/11/07/commuter-train-plows-through-car-on-tracks-in-acton/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-07T23:16:56.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/KJDIQ5UUZ5FE7MJNIODAKALTYI-690d6322ea85e-768x432.jpg",
    "bullets": [
      "An MBTA commuter train collided with an empty car on Central Street, Acton, at a railway crossing.",
      "The car's driver exited before impact after reportedly driving around the crossing gate, resulting in no injuries.",
      "Fitchburg line commuters experienced delays; Train 1427 was terminated at South Acton after the incident."
    ]
  },
  {
    "title": "What to know about possible Red Sox free agent target Munetaka Murakami after posting",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/munetaka-murakami-red-sox-mlb-free-agency-rumors/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-11-07T21:40:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/DVDHDUJ633XTHRJXKVRJR2N2UY-690e632d77a32-768x432.jpg",
    "bullets": [
      "Japanese star Munetaka Murakami, known as the 'Japanese Babe Ruth,' has been posted by the Tokyo Yakult Swallows.",
      "Murakami, a top free-agent hitter, primarily plays third base but may fit at first base or as a designated hitter.",
      "The Red Sox are among several MLB teams expected to pursue Murakami, with predictions of a potential eight-year, $180 million deal."
    ]
  },
  {
    "title": "Airlines are waiving fees, offering refunds due to reduced flight schedules",
    "url": "https://www.boston.com/travel/flights/2025/11/07/airlines-are-waiving-fees-offerings-refunds-due-to-reduced-flight-schedules/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-11-07T21:10:31.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/01/DPYQ67JGZN7634F3EEUM2AOS3M-679b06305f72a-768x432.jpg",
    "bullets": [
      "Airlines are waiving fees and offering refunds after the FAA reduced flights by 10% at 40 airports, including Logan.",
      "JetBlue and Southwest offer rebooking or full refunds for affected travelers flying between Nov. 6-19 upon request.",
      "American and Delta provide similar options, requiring rebooking by specific dates; some fare differences may apply for later travel."
    ]
  },
  {
    "title": "After Cape Cod crash, readers say Mass. should tighten e-bike regulations",
    "url": "https://www.boston.com/community/readers-say/2025/11/07/massachusetts-should-tighten-ebike-regulations/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-07T20:50:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/6L3T6GPLTKEVUWZ5WJKMGRBWY4-690e57abc1ccd-768x432.jpg",
    "bullets": [
      "Lynne Forester's e-bike crash on Cape Cod sparks debate on tighter regulations in Massachusetts.",
      "A Boston.com survey shows 78% of readers support stricter e-bike rules, while 20% oppose further regulation.",
      "Current Massachusetts law treats Class 1 and 2 e-bikes like bicycles, with no license or registration required."
    ]
  }
]