[
  {
    "title": "Mass. RMV lottery opens for 250th anniversary license plates. Here’s how to apply.",
    "url": "https://www.boston.com/news/local-news/2026/02/17/mass-rmv-lottery-opens-for-250th-anniversary-license-plates-heres-how-to-apply/",
    "author": "Autumn Sloboda",
    "section": "News",
    "published": "2026-02-17T21:46:15.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/AJCMJPNXVBC6DEM3UIILHORRSU-6994cfbc72807-768x432.webp",
    "bullets": [
      "The Mass. RMV has opened a lottery for 1,000 commemorative low-number MA250 license plates for the state's 250th anniversary.",
      "The application period runs from Feb. 16 to April 17, 2026, with no fee to enter and winners pay a $100 total fee.",
      "Winners will be selected via an electronic random number generator and announced within five business days post-lottery in early May."
    ]
  },
  {
    "title": "Massachusetts becomes first state to use ChatGPT in the executive branch, drawing criticism",
    "url": "https://www.boston.com/news/local-news/2026/02/17/healey-ai-tool-implementation/",
    "author": "Annie Jonas",
    "section": "News",
    "published": "2026-02-17T21:25:01.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/ChatGPT_Vulnerable_Teens_27483-6994c2772584e-768x432.jpg",
    "bullets": [
      "Massachusetts is first in the nation to implement OpenAI's ChatGPT for nearly 40,000 executive branch state employees.",
      "Governor Healey claims the AI tool will improve government efficiency, with secure data practices in place to protect state information.",
      "The National Association of Government Employees criticizes the rapid deployment, fearing AI may replace significant job duties."
    ]
  },
  {
    "title": "Close to 100 jobs lost as 2 Massachusetts packaging plants shut down",
    "url": "https://www.boston.com/news/business/2026/02/17/close-to-100-jobs-lost-as-2-massachusetts-packaging-plants-shut-down/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-17T20:44:13.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/02/Screenshot-2026-02-17-at-2.43.35-PM-6994d30f0e39a.jpg",
    "bullets": [
      "Garlock Flexibles is closing two packaging facilities in Gardner, Massachusetts, affecting 91 workers, according to a state WARN notice.",
      "The Gardner closures are set for September, with few administrative roles staying; the company is part of Astara Capital Partners.",
      "Garlock Flexibles, rebranded in 2023, was acquired by Astara Capital Partners in 2021, focusing on flexible film packaging operations."
    ]
  },
  {
    "title": "Assailant in Pawtucket hockey rink shooting killed ex-wife and son, family says",
    "url": "https://www.boston.com/news/local-news/2026/02/17/assailant-in-pawtucket-hockey-rink-shooting-killed-ex-wife-and-son-family-says/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-17T19:48:59.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/XC7GI6M735SFO5W5FQD35X2RQA-6994c20f03db2-768x432.jpg",
    "bullets": [
      "Robert Dorgan fatally shot his ex-wife Rhonda and son Aidan during a high school hockey game in Pawtucket.",
      "Dorgan's maternal grandparents and a family friend were critically injured and remain hospitalized following the shooting.",
      "The shooting was described by police as a 'targeted family dispute'; Dorgan died from a self-inflicted gunshot."
    ]
  },
  {
    "title": "Boston’s Vietnamese community celebrates Tết with culture and tradition",
    "url": "https://www.boston.com/news/community/2026/02/17/bostons-vietnamese-community-celebrates-tet-with-culture-and-tradition/",
    "author": "Samantha Genzer",
    "section": "News",
    "published": "2026-02-17T19:29:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Untitled-design-13-6994b0944339d-768x432.png",
    "bullets": [
      "Boston's Vietnamese community celebrated Tết at the Menino Convention & Exhibition Center, marking the largest Lunar New Year festival in the region.",
      "The event was organized by the Vietnamese American Community of Massachusetts and featured traditional Vietnamese arts and activities.",
      "This year's Tết in Boston allowed attendees to experience Vietnamese culture and fostered connections among different generations and ethnicities."
    ]
  },
  {
    "title": "How a New Jersey runner is turning the 2026 Boston Marathon into a personal mission",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/17/kevin-brutus-tedys-team/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-17T19:05:12.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-6-698df0cc771b0-768x432.png",
    "bullets": [
      "Kevin Brutus, 30, from Guttenberg, NJ, will run the 2026 Boston Marathon in memory of his father who passed away from strokes.",
      "Brutus decided to run after previously delaying due to the race's competitive standards and fundraising requirements for charity entries.",
      "He will participate with Tedy's Team to support heart disease and stroke research, aligning with his family's experiences."
    ]
  },
  {
    "title": "His future wife survived a medical emergency thanks to Boston MedFlight",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/17/sean-largay-boston-medflight/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-17T18:36:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-4-698deac92ebee-768x432.png",
    "bullets": [
      "Sean Largay, 30, will run the 2026 Boston Marathon to fundraise for Boston MedFlight.",
      "Largay's future wife, Maggie Bea, survived a 2024 emergency thanks to Boston MedFlight's medical care.",
      "The nonprofit Boston MedFlight depends on donations to support their life-saving missions."
    ]
  },
  {
    "title": "He&#8217;s running the Boston Marathon to support young athletes",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/17/ahmed-mansour-boston-athletic-academy/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-17T18:26:38.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-5-698dee0fd2a24-768x432.png",
    "bullets": [
      "Ahmed Mansour, 45, from Houston is running the 2026 Boston Marathon for the Boston Athletic Academy charity.",
      "Mansour aims to support underprivileged youth with mentorship, education, and athletics through his marathon fundraising.",
      "He plans to complete the World Marathon Majors with Boston being his sixth race, followed by Sydney in August."
    ]
  },
  {
    "title": "American Eagle Outfitters to close Devens distribution facility, cutting 103 jobs",
    "url": "https://www.boston.com/news/business/2026/02/17/american-eagle-outfitters-to-close-devens-distribution-facility-cutting-103-jobs/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-17T18:17:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2019_04_03_BostonGlobe.com_Regional_Images_kreiter_wharehouse1_biz-6994a70ec3743-768x432.jpg",
    "bullets": [
      "American Eagle Outfitters to close its distribution facility in Devens, Massachusetts, affecting 103 employees, starting April 12.",
      "The facility, originally part of Quiet Logistics, was purchased by American Eagle for $360 million in 2021 to enhance supply chain speed.",
      "Closure is part of American Eagle's logistics restructuring to prioritize growth and focus on core lifestyle brand portfolio."
    ]
  },
  {
    "title": "Mass. lowers flags to half-staff in honor of fallen soldier Robert Arnold",
    "url": "https://www.boston.com/news/local-news/2026/02/17/mass-lowers-flags-to-half-staff-in-honor-of-fallen-soldier-robert-arnold/",
    "author": "Samantha Genzer",
    "section": "News",
    "published": "2026-02-17T18:09:59.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Untitled-design-11-699477ad51f03-768x432.png",
    "bullets": [
      "Flags in Massachusetts were lowered to half-staff to honor U.S. Army Staff Sgt. Robert R. Arnold who died at 27.",
      "Arnold, a Roslindale native, served in both the U.S. Army and Marine Corps and was a Boston Latin School graduate.",
      "State Rep. Steve Xiarhos, a Gold Star father, shared condolences, emphasizing Arnold's sacrifice and dedication to service."
    ]
  }
]