[
  {
    "title": "Massachusetts becomes first state to use ChatGPT in the executive branch, drawing criticism",
    "url": "https://www.boston.com/news/local-news/2026/02/17/healey-ai-tool-implementation/",
    "author": "Annie Jonas",
    "section": "News",
    "published": "2026-02-17T21:25:01.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/ChatGPT_Vulnerable_Teens_27483-6994c2772584e-768x432.jpg",
    "bullets": [
      "Massachusetts becomes the first state to implement ChatGPT for executive branch workers, starting with 40,000 employees.",
      "The AI tool aims to improve efficiency and effectiveness, with phased implementation across government agencies.",
      "Some state workers and the National Association of Government Employees express concerns over job security and data privacy."
    ]
  },
  {
    "title": "Close to 100 jobs lost as 2 Massachusetts packaging plants shut down",
    "url": "https://www.boston.com/news/business/2026/02/17/close-to-100-jobs-lost-as-2-massachusetts-packaging-plants-shut-down/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-17T20:44:13.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/02/Screenshot-2026-02-17-at-2.43.35-PM-6994d30f0e39a.jpg",
    "bullets": [
      "Garlock Flexibles is closing two Gardner plants, resulting in 91 layoffs, according to a state WARN notice.",
      "The Gardner facilities at 164 Fredette St. and 77 Industrial Rowe will shut down by the end of September.",
      "Astara Capital Partners acquired the packaging operations in 2021 and rebranded them as Garlock Flexibles in 2023."
    ]
  },
  {
    "title": "Assailant in Pawtucket hockey rink shooting killed ex-wife and son, family says",
    "url": "https://www.boston.com/news/local-news/2026/02/17/assailant-in-pawtucket-hockey-rink-shooting-killed-ex-wife-and-son-family-says/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-17T19:48:59.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/XC7GI6M735SFO5W5FQD35X2RQA-6994c20f03db2-768x432.jpg",
    "bullets": [
      "Robert Dorgan killed ex-wife Rhonda and son Aidan in Pawtucket hockey rink shooting before dying of self-inflicted gunshot.",
      "Dorgan's parents and a family friend were injured and remain hospitalized in critical condition after the incident.",
      "The shooting is described as a targeted family dispute; a GoFundMe was created to support surviving children Ava and brother."
    ]
  },
  {
    "title": "Boston’s Vietnamese community celebrates Tết with culture and tradition",
    "url": "https://www.boston.com/news/community/2026/02/17/bostons-vietnamese-community-celebrates-tet-with-culture-and-tradition/",
    "author": "Samantha Genzer",
    "section": "News",
    "published": "2026-02-17T19:29:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Untitled-design-13-6994b0944339d-768x432.png",
    "bullets": [
      "Boston's Vietnamese community celebrated Tết at the Menino Convention Center, marking the region's largest Lunar New Year festival.",
      "Event planning started in summer, and the new venue allowed a one-day format to accommodate more attendees.",
      "The festival featured Vietnamese arts and culture, including calligraphy and traditional dress, to connect generations and communities."
    ]
  },
  {
    "title": "How a New Jersey runner is turning the 2026 Boston Marathon into a personal mission",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/17/kevin-brutus-tedys-team/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-17T19:05:12.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-6-698df0cc771b0-768x432.png",
    "bullets": [
      "Kevin Brutus from Guttenberg, NJ, will run the 2026 Boston Marathon in memory of his late father.",
      "Brutus is participating with Tedy's Team, highlighting heart disease and stroke, which have affected his family.",
      "The race marks Brutus's 10th marathon and represents a personal mission beyond previous marathons he has run."
    ]
  },
  {
    "title": "His future wife survived a medical emergency thanks to Boston MedFlight",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/17/sean-largay-boston-medflight/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-17T18:36:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-4-698deac92ebee-768x432.png",
    "bullets": [
      "Sean Largay will run the 2026 Boston Marathon to fundraise for Boston MedFlight after it saved his fiancée's life.",
      "Largay, 30, of Boston, aims to support the non-profit that provides emergency medical flights entirely through donations.",
      "His fiancée, Maggie Bea, experienced a medical emergency in 2024 and received life-saving care from Boston MedFlight."
    ]
  },
  {
    "title": "He&#8217;s running the Boston Marathon to support young athletes",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/17/ahmed-mansour-boston-athletic-academy/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-17T18:26:38.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-5-698dee0fd2a24-768x432.png",
    "bullets": [
      "Ahmed Mansour to run 2026 Boston Marathon for Boston Athletic Academy, supporting underprivileged youth with mentorship and athletics.",
      "Mansour, 45, from Houston, views running as transformative and aims to complete the World Marathon Majors '7-star' journey.",
      "His participation supports young athletes, promoting confidence and hope through Boston Athletic Academy's programs."
    ]
  },
  {
    "title": "American Eagle Outfitters to close Devens distribution facility, cutting 103 jobs",
    "url": "https://www.boston.com/news/business/2026/02/17/american-eagle-outfitters-to-close-devens-distribution-facility-cutting-103-jobs/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-17T18:17:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2019_04_03_BostonGlobe.com_Regional_Images_kreiter_wharehouse1_biz-6994a70ec3743-768x432.jpg",
    "bullets": [
      "American Eagle Outfitters to close its Devens distribution facility, resulting in 103 job cuts.",
      "The Devens facility, part of Quiet Logistics acquired for $360M in 2021, will shut down on April 12.",
      "Closure aims to restructure logistics and focus on American Eagle's lifestyle brand portfolio growth."
    ]
  },
  {
    "title": "Mass. lowers flags to half-staff in honor of fallen soldier Robert Arnold",
    "url": "https://www.boston.com/news/local-news/2026/02/17/mass-lowers-flags-to-half-staff-in-honor-of-fallen-soldier-robert-arnold/",
    "author": "Samantha Genzer",
    "section": "News",
    "published": "2026-02-17T18:09:59.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Untitled-design-11-699477ad51f03-768x432.png",
    "bullets": [
      "Massachusetts flags were lowered to half-staff to honor U.S. Army Staff Sgt. Robert R. Arnold who died on February 1.",
      "Arnold, a 27-year-old Roslindale native, served in both the U.S. Army and Marine Corps and was a Boston Latin School graduate.",
      "State Rep. Steve Xiarhos expressed condolences, highlighting Arnold's dedication to service and the personal impact of his loss."
    ]
  },
  {
    "title": "Healey, Ayotte spar over proposed ICE facility in N.H.",
    "url": "https://www.boston.com/news/local-news/2026/02/17/healey-ayotte-spar-over-proposed-ice-facility-in-n-h/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-17T17:51:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/nhmr-ice-warehouse-merrimack-6994a54645d77-768x432.png",
    "bullets": [
      "ICE plans to convert a Merrimack, NH warehouse into a 600-bed detention center, costing $158 million to retrofit.",
      "Massachusetts Gov. Maura Healey and New Hampshire Gov. Kelly Ayotte disagree on the proposed ICE facility in New Hampshire.",
      "Ayotte demands resignation from an official for not informing her about ICE plans; Healey criticizes ICE's immigration enforcement policies."
    ]
  }
]