[
  {
    "title": "DA: Malden man arrested, two others charged in connection to fatal Dedham shooting",
    "url": "https://www.boston.com/news/crime/2025/09/30/da-malden-man-arrested-two-others-charged-in-connection-to-fatal-dedham-shooting/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-10-01T03:54:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Crime James Brown, 23, is scheduled to be arraigned Oct.",
      "1 on charges including murder and carrying a firearm without a license.",
      "Three people are now facing charges, including one man charged with murder, in connection with a fatal June shooting in the parking lot of a Dedham BJ’s, prosecutors announced Tuesday."
    ]
  },
  {
    "title": "How did your town do on the MCAS this year? Search scores here.",
    "url": "https://www.boston.com/news/local-news/2025/09/30/how-did-your-town-do-on-the-mcas-this-year-search-scores-here/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-10-01T03:27:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_ryanmcas2met-68dc9bff1791b-768x432.jpg",
    "bullets": [
      "StateELA51 StateMATH45 StateSCI46 Abby Kelley Foster Charter Public (District)ELA78 Abby Kelley Foster Charter Public (District)MATH64 Abby Kelley Foster Charter Public (District)SCI72 AbingtonELA43 AbingtonMATH40 AbingtonSCI47 Academy Of the Pacific Rim Charter Public (District)ELA29 Academy Of the Pacific Rim Charter Public (District)MATH17 Academy Of the Pacific Rim Charter Public (District)SCI5 Acton-BoxboroughELA83 Acton-BoxboroughMATH82 Acton-BoxboroughSCI79 Advanced Math and Science Academy CharterELA73 Advanced Math and Science Academy CharterMATH90 Advanced Math and Science Academy CharterSCI74 AgawamELA46 AgawamMATH40 AgawamSCI49 AmesburyELA51 AmesburyMATH43 AmesburySCI53 Amherst-PelhamELA70 Amherst-PelhamMATH60 Amherst-PelhamSCI66 AndoverELA74 AndoverMATH77 AndoverSCI72 Argosy Collegiate Charter School (District)ELA32 Argosy Collegiate Charter School (District)MATH31 Argosy Collegiate Charter School (District)SCI34 ArlingtonELA80 ArlingtonMATH81 ArlingtonSCI83 Ashburnham-WestminsterELA58 Ashburnham-WestminsterMATH47 Ashburnham-WestminsterSCI55 AshlandELA71 AshlandMATH70 AshlandSCI65 Assabet Valley Regional Vocational TechnicalELA46 Assabet Valley Regional Vocational TechnicalMATH33 Assabet Valley Regional Vocational TechnicalSCI31 Athol-RoyalstonELA23 Athol-RoyalstonMATH18 Athol-RoyalstonSCI20 Atlantis Charter (District)ELA37 Atlantis Charter (District)MATH22 Atlantis Charter (District)SCI14 AttleboroELA50 AttleboroMATH37 AttleboroSCI35 AuburnELA42 AuburnMATH44 AuburnSCI45 AvonELA32 AvonMATH26 AvonSCI18 Ayer Shirley School DistrictELA57 Ayer Shirley School DistrictMATH38 Ayer Shirley School DistrictSCI57 BarnstableELA38 BarnstableMATH29 BarnstableSCI29 Baystate Academy Charter Public School (District)ELA15 Baystate Academy Charter Public School (District)MATH6 Baystate Academy Charter Public School (District)SCI10 BedfordELA79 BedfordMATH70 BedfordSCI72 BelchertownELA66 BelchertownMATH56 BelchertownSCI67 BellinghamELA48 BellinghamMATH40 BellinghamSCI48 BelmontELA81 BelmontMATH81 BelmontSCI85 Berkshire Arts and Technology Charter Public (District)ELA50 Berkshire Arts and Technology Charter Public (District)MATH26 Berkshire Arts and Technology Charter Public (District)SCI34 Berkshire HillsELA40 Berkshire HillsMATH33 Berkshire HillsSCI61 Berlin-BoylstonELA83 Berlin-BoylstonMATH77 Berlin-BoylstonSCI67 BeverlyELA45 BeverlyMATH39 BeverlySCI49 BillericaELA51 BillericaMATH44 BillericaSCI66 Blackstone Valley Regional Vocational TechnicalELA65 Blackstone Valley Regional Vocational TechnicalMATH55 Blackstone Valley Regional Vocational TechnicalSCI56 Blackstone-MillvilleELA31 Blackstone-MillvilleMATH28 Blackstone-MillvilleSCI34 Blue Hills Regional Vocational TechnicalELA51 Blue Hills Regional Vocational TechnicalMATH37 Blue Hills Regional Vocational TechnicalSCI36 BostonELA40 BostonMATH38 BostonSCI33 Boston Collegiate Charter (District)ELA39 Boston Collegiate Charter (District)MATH49 Boston Collegiate Charter (District)SCI18 Boston Day and Evening Academy Charter (District)ELA8 Boston Day and Evening Academy Charter (District)MATH0 Boston Green Academy Horace Mann Charter School (District)ELA23 Boston Green Academy Horace Mann Charter School (District)MATH11 Boston Green Academy Horace Mann Charter School (District)SCI6 Boston Preparatory Charter Public (District)ELA29 Boston Preparatory Charter Public (District)MATH27 Boston Preparatory Charter Public (District)SCI9 BourneELA53 BourneMATH36 BourneSCI31 BraintreeELA61 BraintreeMATH64 BraintreeSCI67 Bridgewater-RaynhamELA43 Bridgewater-RaynhamMATH43 Bridgewater-RaynhamSCI63 Bristol County AgriculturalELA53 Bristol County AgriculturalMATH44 Bristol County AgriculturalSCI62 Bristol-Plymouth Regional Vocational TechnicalELA48 Bristol-Plymouth Regional Vocational TechnicalMATH45 Bristol-Plymouth Regional Vocational TechnicalSCI42 BrocktonELA29 BrocktonMATH18 BrocktonSCI19 Brooke Charter School (District)ELA77 Brooke Charter School (District)MATH68 Brooke Charter School (District)SCI80 BrooklineELA83 BrooklineMATH84 BrooklineSCI86 BurlingtonELA59 BurlingtonMATH53 BurlingtonSCI58 CambridgeELA56 CambridgeMATH57 CambridgeSCI53 CantonELA60 CantonMATH59 CantonSCI71 Cape Cod Regional Vocational TechnicalELA57 Cape Cod Regional Vocational TechnicalMATH52 Cape Cod Regional Vocational TechnicalSCI58 CarverELA48 CarverMATH29 CarverSCI38 Central BerkshireELA51 Central BerkshireMATH50 Central BerkshireSCI58 ChelmsfordELA73 ChelmsfordMATH61 ChelmsfordSCI52 ChelseaELA20 ChelseaMATH18 ChelseaSCI18 ChicopeeELA33 ChicopeeMATH19 ChicopeeSCI24 ClintonELA33 ClintonMATH27 ClintonSCI26 Codman Academy Charter Public (District)ELA10 Codman Academy Charter Public (District)MATH25 Codman Academy Charter Public (District)SCI11 CohassetELA86 CohassetMATH76 CohassetSCI78 Collegiate Charter School of Lowell (District)ELA43 Collegiate Charter School of Lowell (District)MATH15 Collegiate Charter School of Lowell (District)SCI14 Community Charter School of Cambridge (District)ELA62 Community Charter School of Cambridge (District)MATH61 Community Charter School of Cambridge (District)SCI57 Concord-CarlisleELA84 Concord-CarlisleMATH81 Concord-CarlisleSCI80 DanversELA45 DanversMATH31 DanversSCI48 DartmouthELA61 DartmouthMATH52 DartmouthSCI45 DedhamELA39 DedhamMATH54 DedhamSCI47 Dennis-YarmouthELA40 Dennis-YarmouthMATH27 Dennis-YarmouthSCI30 Dighton-RehobothELA53 Dighton-RehobothMATH45 Dighton-RehobothSCI62 DouglasELA49 DouglasMATH33 DouglasSCI37 Dover-SherbornELA91 Dover-SherbornMATH87 Dover-SherbornSCI86 DracutELA37 DracutMATH37 DracutSCI38 Dudley-Charlton RegELA37 Dudley-Charlton RegMATH36 Dudley-Charlton RegSCI42 DuxburyELA85 DuxburyMATH90 DuxburySCI77 East BridgewaterELA45 East BridgewaterMATH38 East BridgewaterSCI56 East LongmeadowELA49 East LongmeadowMATH47 East LongmeadowSCI62 EasthamptonELA39 EasthamptonMATH35 EasthamptonSCI36 EastonELA69 EastonMATH71 EastonSCI61 Edward M.",
      "Kennedy Academy for Health Careers: A Horace Mann Charter Public School (District)ELA25 Edward M.",
      "Kennedy Academy for Health Careers: A Horace Mann Charter Public School (District)MATH13 Edward M."
    ]
  },
  {
    "title": "Services planned for Haverhill police officer, 32, who died &#8216;unexpectedly&#8217;",
    "url": "https://www.boston.com/news/local-news/2025/09/30/services-planned-for-haverhill-officer-32-who-died-unexpectedly/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-10-01T02:22:28.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Local News Katelyn Tully, a decorated army veteran who served in Afghanistan for six months, will be buried with military honors.",
      "The funeral for a Haverhill police officer who died “unexpectedly” Sept.",
      "26 will be held Friday, according to her obituary."
    ]
  },
  {
    "title": "Garrett Crochet dominates and other takeaways from Red Sox’s Game 1 win over Yankees",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/30/garrett-crochet-boston-red-sox-yankees-game-1-wild-card-mlb-baseball-yoshida/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-10-01T01:46:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Red_Sox_Yankees_Baseball_58181-68dc8161227a5-768x432.jpg",
    "bullets": [
      "Boston Red Sox A two-run single from Masataka Yoshida in the seventh gave Boston the lead for good at Yankee Stadium.",
      "Garrett Crochet pitched into the eighth inning of Tuesday's win.",
      "AP Photo/Frank Franklin II By Conor Ryan September 30, 2025 5 minutes to read ShareSend this article to your social connections."
    ]
  },
  {
    "title": "Is this repair necessary on a 10-year-old car?",
    "url": "https://www.boston.com/cars/how-to/2025/09/30/car-doctor-is-this-repair-necessary-on-a-10-year-old-car/",
    "author": "John Paul",
    "section": "Cars",
    "published": "2025-10-01T01:31:48.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/car-doctor-68dc82cecd468-768x432.jpg",
    "bullets": [
      "How To John Paul, AAA Northeast's Car Doctor, answers a question from a reader considering replacing wheel bearings on a 2015 car.",
      "The Car Doctor answers a question from a reader considering replacing wheel bearings on a 2015 car.",
      "Toyota By John Paul September 30, 2025 3 minutes to read Q."
    ]
  },
  {
    "title": "Worcester mother detained by ICE in high-profile arrest granted asylum",
    "url": "https://www.boston.com/news/local-news/2025/09/30/worcester-mother-detained-by-ice-in-high-profile-arrest-granted-asylum/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-10-01T00:36:28.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/7VX62QTJ6ETQQGJNYZ7XUOKL6Y-1-68dc6a1e995b1-768x432.jpg",
    "bullets": [
      "Local News Rosane Ferreira De Oliveira has been in custody since May.",
      "DHS has 30 days to appeal the judge's decision, during which she will remain in custody in New Hampshire.",
      "A Worcester resident joined a rally outside city hall May 13, 2025 after Rosane Ferreira De Oliveira was detained and two others arrested by local police."
    ]
  },
  {
    "title": "&#8216;That is what second-rate franchises do&#8217;: Yankees&#8217; ticket policy draws criticism",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/30/that-is-what-second-rate-franchises-do-yankees-ticket-policy-draws-criticism/",
    "author": "Hayden Bird",
    "section": "Sports",
    "published": "2025-10-01T00:02:43.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Yankees-Ticket-Policy-2-Red_Sox_Yankees_Baseball_42178-68dc63bddb7c1-768x432.jpg",
    "bullets": [
      "Boston Red Sox Despite the furor, a Yankees spokesperson pointed out that the policy has been in place since 2018.",
      "Romy Gonzalez can't beat the throw to first base for the out during the first inning of Game 1 of the Red Sox-Yankees wild-card series.",
      "AP Photo/Frank Franklin II Red Sox fans hoping for a chance to travel to New York to watch the latest postseason chapter in the rivalry with the Yankees were greeted to a discouraging “Important Event Policy” on Ticketmaster."
    ]
  },
  {
    "title": "Ty Law: Patriots have their ‘successor to Tom Brady’ in Drake Maye",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/09/30/ty-law-drake-maye-tom-brady-nfl-football-new-england-patriots-weei/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-09-30T23:02:05.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/VPBPILAUME7GRAVUEDFYRTJWTQ-68dc5b7a8f693-768x432.jpg",
    "bullets": [
      "New England Patriots \"He is ‘the guy,’ he's proven himself.",
      "\" Drake Maye is starting to settle into a groove in his second NFL season.",
      "Danielle Parhizkaran/The Boston Globe By Conor Ryan September 30, 2025 | 7:02 PM 2 minutes to read Count Pro Football Hall of Famer Ty Law among those who have been impressed with what they’ve seen from Patriots QB Drake Maye so far this season."
    ]
  },
  {
    "title": "Fall River man sentenced for raping 14-year-old girl who was hitchhiking",
    "url": "https://www.boston.com/news/local-news/2025/09/30/fall-river-man-sentenced-for-raping-14-year-old-girl-who-was-hitchhiking/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-09-30T22:29:20.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Local News Trevon Hector, 38, previously pleaded guilty to raping and abusing a child and possessing child pornography By Sana Muneer September 30, 2025 | 6:29 PM 1 minute to read A Fall River man will serve five to seven years in state prison for raping a 14-year-old girl who was hitchhiking, prosecutors announced Tuesday.",
      "Trevon Hector, 38, will also serve a concurrent sentence of four and half to five years for child porn possession, Bristol County District Attorney Thomas Quinn said in a release.",
      "Hector previously pleaded guilty to counts of raping and abusing a child and possessing child pornography, prosecutors said."
    ]
  },
  {
    "title": "Alex Cora says &#8216;it doesn&#8217;t seem like&#8217; Lucas Giolito will be able to pitch in October",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/30/alex-cora-lucas-giolito-injury-comments-red-sox-yankees/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-09-30T20:51:50.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Lucas-Giolito-Injury-Athletics_Red_Sox_Baseball_72305-68dc407ac8505-768x432.jpg",
    "bullets": [
      "Boston Red Sox \"Hopefully it’s just rest.",
      "But obviously it doesn’t seem like he’s going to be able to pitch in October.",
      "” Lucas Giolito exits a Red Sox start against the Athletics on Sept."
    ]
  }
]