[
  {
    "title": "&#8216;Kill the liberals&#8217;: Watertown resident reports flyers with violent message",
    "url": "https://www.boston.com/news/local-news/2025/09/29/kill-the-liberals-watertown-resident-reports-flyers-with-violent-message/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-09-30T00:33:47.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/No_Kings_Protests_Atlanta_31355-68db1e8116b94-768x432.jpg",
    "bullets": [
      "Local News The Watertown resident, who had a political sign in their yard, told police they found a handwritten page in sharpie that said “Save America, kill the liberals.",
      "” A demonstrator holds a sign during a \"No Kings\" protest, Saturday, June 14, 2025, in Atlanta.",
      "AP Photo/Mike Stewart Officials are investigating after a Watertown resident found flyers near their home earlier this month calling to “kill the liberals,” police said."
    ]
  },
  {
    "title": "8 takeaways from Celtics Media Day",
    "url": "https://www.boston.com/sports/boston-celtics/2025/09/29/boston-celtics-media-day-takeaways-joe-mazzulla-brad-stevens-jayson-tatum/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-09-30T00:27:33.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/N2PY4MH4A7R3WZ27URXNW7VRIU-68db1b2c44bc8-768x432.jpg",
    "bullets": [
      "Boston Celtics \"If I ever get to the point where I start basing my motivations on the expectations of others and people I've never met before, I'll retire and quit.",
      "\" Joe Mazzulla and the rest of the Celtics addressed the media on Monday at the Auerbach Center.",
      "Danielle Parhizkaran/The Boston Globe By Conor Ryan September 29, 2025 8 minutes to read After a transformative summer, the 2025-26 Celtics are set to begin a new season."
    ]
  },
  {
    "title": "Bill Nye drops by the Auerbach Center and asks Jaylen Brown a question at Celtics Media Day",
    "url": "https://www.boston.com/sports/boston-celtics/2025/09/29/bill-nye-jaylen-brown-celtics-media-day-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-09-29T22:12:09.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/JBNGQTLFAPOPBANUIPU3AYXN3U-68dafefb07a96-768x432.jpeg",
    "bullets": [
      "Boston Celtics \"I feel like it's Celtic history being able to have Bill Nye in the Auerbach center.",
      "That's pretty cool.",
      "\" Bill Nye Danielle Parhizkaran/The Boston Globe Bill Nye, the Emmy-winning science educator who received the Presidential Medal of Freedom and a star on the Hollywood Walk of Fame this year, came to Brighton to pay Celtics star Jaylen Brown a visit on Monday."
    ]
  },
  {
    "title": "Police release images of 8 people sought in alleged attack on gay couple in Mattapan",
    "url": "https://www.boston.com/news/local-news/2025/09/29/police-release-images-of-men-connected-to-alleged-attack-on-gay-couple-mattapan/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-09-29T21:32:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/mattapan-68daf66b197b7-768x432.png",
    "bullets": [
      "Local News The gay couple was allegedly targeted with homophobic language before a fight on River Street in Mattapan, police said earlier this month.",
      "Boston Police Department By Molly Farrar September 29, 2025 | 5:32 PM 1 minute to read Boston police are asking for the public’s help identifying a group of men associated with an attack on a gay couple in Mattapan earlier this month.",
      "The gay couple was allegedly targeted with homophobic language before a fight on River Street where one of the men from the couple was hit in the back of the head with a baseball bat during a fight, police previously said."
    ]
  },
  {
    "title": "Joe Mazzulla wants to nip this Payton Pritchard narrative in the bud &#8216;immediately&#8217;",
    "url": "https://www.boston.com/sports/boston-celtics/2025/09/29/joe-mazzulla-payton-pritchard-anfernee-simons-defense-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-09-29T21:23:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/BLE5CP4DZRYQDJAUUVTU7FZY5Q-68daf4cba3bb7-768x432.webp",
    "bullets": [
      "Boston Celtics \"I see what you did there, trying to build that correlation between Payton and Anfernee, which I'm sure you'll try to do the whole season.",
      "\" Payton Pritchard attempts to drive past Anfernee Simons.",
      "Erin Clark/The Boston Globe Within the same breath, a reporter asked Celtics coach Joe Mazzulla on Monday what his expectations are for Payton Pritchard this season and how well he had gotten to know newcomer Anfernee Simons."
    ]
  },
  {
    "title": "Watch Charlie Day play &#8216;Dayman&#8217; at Boston piano bar",
    "url": "https://www.boston.com/food/restaurants/2025/09/29/watch-charlie-day-play-dayman-boston/",
    "author": "Katelyn Umholtz",
    "section": "Food",
    "published": "2025-09-29T20:53:23.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/IMG_5837-2-68dabe5637079-768x432.jpg",
    "bullets": [
      "Restaurants The \"It's Always Sunny in Philadelphia\" actor spent several days in Boston promoting Four Walls Whiskey.",
      "Charlie Day played piano at the 88 Club, one of his stops in Boston to promote Four Walls Whiskey.",
      "Courtesy of 88 Club It’s no Paddy’s Pub, but for 20 minutes on Saturday night, the patrons of The 88 Club piano bar in Back Bay cheered on the whiskey-pouring and piano-playing skills of actor Charlie Day, famously from longtime FX show It’s Always Sunny in Philadelphia."
    ]
  },
  {
    "title": "Red Sox pitcher Lucas Giolito ruled out of Wild Card series due to elbow injury",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/29/lucas-giolito-injury-red-sox-yankees-new-york-elbow-alex-cora/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-09-29T20:44:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Athletics_Red_Sox_Baseball_71118-68daeb9fe4717-768x432.jpg",
    "bullets": [
      "Boston Red Sox \"Hopefully, it’s nothing major, but he won’t be ready for this one.",
      "” Lucas Giolito was the favorite to pitch Game 3 against New York.",
      "AP Photo/Robert F."
    ]
  },
  {
    "title": "Brad Stevens explained why the Celtics traded Mass. native Georges Niang",
    "url": "https://www.boston.com/sports/boston-celtics/2025/09/29/brad-stevens-explained-why-the-celtics-traded-mass-native-georges-niang/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-09-29T20:31:57.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/ZG7UB2BX6TBJCRAY3CQTY42L5U-68dae01e66476-768x432.jpg",
    "bullets": [
      "Boston Celtics \"That was a hard conversation to have because he's a Boston kid and I think he would have loved to play for the Celtics.",
      "\" Georges Niang AP Photo/Brynn Anderson Georges Niang, a Massachusetts native, was on the Celtics’ roster for a little more than a month.",
      "Boston acquired him in the Kristaps Porzinigs trade in July."
    ]
  },
  {
    "title": "Recalled sprinkler heads were found at four Fall River sites following Gabriel House fire. Officials say there could be more.",
    "url": "https://www.boston.com/news/local-news/2025/09/29/recalled-sprinkler-heads-were-found-at-four-fall-river-sites-following-gabriel-house-fire-officials-say-there-could-be-more/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-29T19:54:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/07/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_Fall-River-Asst-Living-Fire-0354A-6874f5177c0fd-768x432.jpg",
    "bullets": [
      "Local News Survivors of July’s Gabriel House fire have alleged the assisted living facility’s sprinklers weren’t working the night of the deadly blaze, prompting additional scrutiny.",
      "A firefighter at the charred entrance of the Gabriel House on Oliver Street in Fall River.",
      "Mark Stockwell for The Boston Globe, File By Abby Patkin September 29, 2025 | 3:54 PM 3 minutes to read Recalled fire sprinklers may still exist at properties in Fall River and beyond, the city’s fire department warned Monday, just months after the deadly Gabriel House assisted living facility fire."
    ]
  },
  {
    "title": "A Boston law firm is suing Newsmax. Here’s why.",
    "url": "https://www.boston.com/news/local-news/2025/09/29/a-boston-law-firm-is-suing-newsmax-heres-why/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-29T19:15:59.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Dominion_Newsmax_Defamation_Case_17501-68d6ee7c51077-768x432.jpg",
    "bullets": [
      "Local News Todd & Weld says the network left more than $400,000 in legal bills unpaid.",
      "A display shows a Newsmax logo on the day of their IPO on the floor at the New York Stock Exchange in New York, March 31, 2025.",
      "Seth Wenig / AP, File The law firm Todd & Weld is suing the conservative media outlet Newsmax over alleged unpaid legal bills totaling more than $400,000."
    ]
  }
]