[
  {
    "title": "7 things to do this Valentine&#8217;s Day weekend",
    "url": "https://www.boston.com/things-to-do/things-to-do/2026/02/11/valentines-day-date-free-ideas-2026/",
    "author": "Kelly Chan",
    "section": "Things To Do",
    "published": "2026-02-11T20:42:38.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/KCC05129-698cdbe94cc2a-768x432.jpg",
    "bullets": [
      "Boston Frostival at Copley Square offers winter-themed food, drinks, and events like pizza-making and live jazz this weekend.",
      "Newly opened Asian restaurants in Boston include Novo Lantern, Boxfish, and K-Bok, coinciding with Lunar New Year celebrations.",
      "Free ice skating events are at Canal District Kendall on Feb. 14 and Boston Common Frog Pond on Feb. 15."
    ]
  },
  {
    "title": "City’s police oversight agency is finally starting to subpoena Boston cops",
    "url": "https://www.boston.com/news/local-news/2026/02/11/police-oversight-agency-subpoena-boston-cops/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-11T20:19:54.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_18policereform-04f-698ce0efa908a-768x432.jpg",
    "bullets": [
      "Boston's Office of Police Accountability and Transparency (OPAT) issued subpoenas to nine police officers, a first since its establishment in 2021.",
      "Tensions between OPAT and the Boston Police Department have risen due to officers' reluctance to participate in oversight investigations.",
      "If subpoenaed officers don't appear, OPAT may seek court intervention; discussions will occur in an executive session on February 12."
    ]
  },
  {
    "title": "Third wheels are the best wheels",
    "url": "https://www.boston.com/love-letters/love-letters/2026/02/11/experts-on-third-wheeling/",
    "author": "Meredith Goldstein",
    "section": "Love Letters",
    "published": "2026-02-11T19:50:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/TICILSTHQZFVNJMLJZS5IGZXHQ-698cd6b074d49-768x432.webp",
    "bullets": [
      "Third wheeling is often misunderstood but can provide positive social experiences, according to Love Letters readers and experts.",
      "Research by Elaine Hoan suggests couples often cocoon, avoiding interaction with single friends despite potential benefits.",
      "Jaimie Arona Krems notes perception gaps may lead couples to assume singles don't want to join, impacting social invitations."
    ]
  },
  {
    "title": "How losing their parents led two brothers to the Boston Marathon",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/11/connor-nally-dana-farber/",
    "author": "Autumn Sloboda",
    "section": "Community",
    "published": "2026-02-11T19:33:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Screenshot-2026-02-11-at-1.48.02-PM-698cceeeba308-768x432.png",
    "bullets": [
      "Connor and Collin Nally are running the 2026 Boston Marathon to support Dana-Farber Cancer Institute with a $27,000 fundraising goal.",
      "The Nally brothers were inspired to run after losing both parents and the fiancée's mother to cancer, seeking to honor their memory.",
      "This marks Collin's second marathon and Connor's first, with the brothers aiming to finish together in remembrance and renewal."
    ]
  },
  {
    "title": "After stage 3 blood cancer, Lynnfield woman will return for 7th Boston Marathon",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/11/allison-milford-boston-athletic-association/",
    "author": "Autumn Sloboda",
    "section": "Community",
    "published": "2026-02-11T19:24:33.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Screenshot-2026-02-11-at-1.23.54-PM-698cc947c812a-768x432.png",
    "bullets": [
      "Allison Milford, 39, from Lynnfield, will participate in the 2026 Boston Marathon for the seventh time.",
      "Milford, a stage three blood cancer survivor, first ran the Boston Marathon in 2011 after finishing treatment.",
      "She is raising funds for the Boston Athletic Association, supporting community programs and promoting a healthy lifestyle for children."
    ]
  },
  {
    "title": "DHS criticizes city councilor after chaotic ICE arrest in Roslindale",
    "url": "https://www.boston.com/news/local-news/2026/02/11/dhs-criticizes-city-councilor-after-chaotic-ice-arrest-in-roslindale/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-11T19:22:22.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_2025-11-06_06carwashvigil_abs_003-698cd200291d2-768x432.jpg",
    "bullets": [
      "DHS criticized Boston City Councilor Enrique Pepén after he condemned an ICE arrest in Roslindale, calling it abduction.",
      "Councilor Pepén argued ICE's operations caused community fear and violated local trust, while DHS defended the arrest of Jose Perez-Antonio.",
      "The Boston Trust Act limits police cooperation with ICE, which received 57 detainer requests in 2025, all ignored due to the Act."
    ]
  },
  {
    "title": "Nice weather kicks off the holiday weekend, but will the next storm system be a hit or miss?",
    "url": "https://www.boston.com/weather/weather/2026/02/11/nice-weather-kicks-off-the-holiday-weekend-but-will-the-next-storm-system-be-a-hit-or-miss/",
    "author": "David Epstein",
    "section": "Weather",
    "published": "2026-02-11T19:08:20.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_WALKER_020526_standalone_02452x-698cd369c2f4f-768x432.jpg",
    "bullets": [
      "The holiday weekend in New England starts with sunny skies and temperatures in the mid-30s to 40s.",
      "Saturday and Sunday will be pleasant with mostly sunny skies, light winds, and temperatures in the upper 30s.",
      "A coastal storm on President's Day could impact Southern New England, but odds currently favor no significant effect."
    ]
  },
  {
    "title": "What K&#8217;Lavon Chaisson and Jaylinn Hawkins said about upcoming free agency",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/11/patriots-klavon-chaisson-jaylinn-hawkins-free-agency-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2026-02-11T18:11:07.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/N6LKH6PV45ICQS5CP6UR46SCRI-698cbd48d1de3-768x432.jpg",
    "bullets": [
      "K'Lavon Chaisson and Jaylinn Hawkins will enter free agency next month, both expressed interest in returning to the Patriots.",
      "Chaisson, a former first-round pick, had a breakout season with 7.5 sacks and tied for team-leading tackles for loss.",
      "Hawkins, noted for his close bond with teammates, posted four interceptions and emphasized the special team dynamic this season."
    ]
  },
  {
    "title": "A Mass. middle school basketball coach collapsed during a game. The opposing coach sprang into action.",
    "url": "https://www.boston.com/news/local-news/2026/02/11/belmont-waltham-mass-middle-school-coach-heart-attack-rescue/",
    "author": "Samantha Genzer",
    "section": "News",
    "published": "2026-02-11T17:54:16.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/coach-698cbd56e8f69-768x432.png",
    "bullets": [
      "Belmont Middle School coach Ian Haffer saved Waltham coach Ronnie Poirier after a heart attack during a game.",
      "Haffer, a medical doctor, used an automated external defibrillator and chest compressions to revive Poirier.",
      "Poirier, now in ICU, is communicating as extensive testing continues; Haffer praises teamwork in the rescue effort."
    ]
  },
  {
    "title": "Another movie theater is shutting down in Massachusetts",
    "url": "https://www.boston.com/news/business/2026/02/11/another-movie-theater-is-shutting-down-in-massachusetts/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-11T17:40:54.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_tlumackistarwars1520-698cb7b164bd0-768x432.jpg",
    "bullets": [
      "Showcase Cinema de Lux in Randolph, Massachusetts will close on March 1 after serving the community since 1997.",
      "National Amusements, owner of the Randolph theater, was purchased by Paramount Skydance in 2025 for $2.4 billion.",
      "The Randolph closure follows the recent shutdown of the Showcase Cinema at Patriot Place, leaving only seven Massachusetts locations."
    ]
  }
]