[
  {
    "title": "AG Campbell skeptical of proposed law to ban ICE agents from wearing masks",
    "url": "https://www.boston.com/news/local-news/2025/11/04/ag-campbell-skeptical-of-proposed-law-to-ban-ice-agents-from-wearing-masks/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2025-11-04T19:44:34.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_greenhouse05NCSL3-690a506735dc9-768x432.jpg",
    "bullets": [
      "AG Andrea Campbell doubts efficacy of Massachusetts law banning ICE mask usage as state control over federal agents is limited.",
      "State Rep. Jim Hawkins sponsors bill to stop law enforcement, including ICE, from masking identities during community interactions.",
      "Campbell argues accountability should fall on federal authorities, particularly criticizing U.S. Attorney Leah Foley's response to ICE actions."
    ]
  },
  {
    "title": "Birds of Paradise, Brighton’s travel-themed cocktail bar, closes at the Speedway",
    "url": "https://www.boston.com/food/food-news/2025/11/04/birds-of-paradise-brighton-closed/",
    "author": "Frances Klemm",
    "section": "Food",
    "published": "2025-11-04T19:36:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/ATPIJ2I4KISKQRXOP7JRR6RA7A-68d272427fe80-768x432.jpg",
    "bullets": [
      "Birds of Paradise, a cocktail bar at Charles River Speedway in Brighton, closed on October 31, 2025.",
      "The bar opened in 2022 by Ran Duan, offering globally-inspired cocktails with a travel theme.",
      "An investigation into a woman's death at Duan's home has resulted in Duan transferring bar oversight."
    ]
  },
  {
    "title": "Child struck by school bus, driver arrested in Medway",
    "url": "https://www.boston.com/news/local-news/2025/11/04/child-struck-by-school-bus-driver-arrested-in-medway/",
    "author": "Madison Lucchesi",
    "section": "News",
    "published": "2025-11-04T19:09:54.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2018_09_11_BostonGlobe.com_Metro_Images_ryan_backschool8xx_met-690a4b422ea57-768x432.jpg",
    "bullets": [
      "A child on a bike was struck by a school bus near Francis J. Burke Memorial Elementary in Medway.",
      "Bus driver Kenneth Benjamin, 69, was arrested for disorderly conduct after the incident, not for the collision itself.",
      "Benjamin was cited for failing to stop at a crosswalk and arraigned in Wrentham District Court."
    ]
  },
  {
    "title": "TD Bank plans to shutter 6 Mass. branches amid nationwide closures",
    "url": "https://www.boston.com/news/business/2025/11/04/td-bank-plans-to-shutter-6-mass-branches-amid-nationwide-closures/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-11-04T18:49:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/02/td_6WZFOQKMZJGNRMKDQHED6BQ6Z4-67c0a22aa8967-768x432.jpg",
    "bullets": [
      "TD Bank plans to close six branches and one drive-thru in Massachusetts as part of closing 51 locations nationally.",
      "Closures are part of TD Bank's strategy to enhance its retail presence through improvements and digital banking services.",
      "TD Bank's recent $1.8 billion settlement for compliance failures is unrelated to the closures, as stated by the bank."
    ]
  },
  {
    "title": "Longtime 7News anchor Kim Khazei is signing off",
    "url": "https://www.boston.com/news/media/2025/11/04/longtime-7news-anchor-kim-khazei-is-signing-off/",
    "author": "John Waller",
    "section": "News",
    "published": "2025-11-04T18:41:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/Screenshot-2025-11-04-at-12.16.30-PM-690a430c39e12-768x432.jpg",
    "bullets": [
      "Kim Khazei, a 7News anchor since 1994, will leave the station at the end of the year.",
      "Khazei has covered major events including Patriots' Super Bowl wins and two royal weddings during her tenure.",
      "She is relocating to be closer to family, having taken a six-year break previously to raise her children."
    ]
  },
  {
    "title": "Payton Pritchard addresses his shooting woes as Celtics struggle as a whole",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/04/payton-pritchard-addresses-his-shooting-woes-as-celtics-struggle-as-a-whole/",
    "author": "Aidan Buchanan",
    "section": "Sports",
    "published": "2025-11-04T18:19:40.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/WTLWL7UPDUKW4KPAJ3F6DQXRIA-690a0bde2a756-768x432.jpg",
    "bullets": [
      "The Celtics lead the NBA in three-pointers attempted but have the second-worst three-point shooting percentage at 31.2%.",
      "Payton Pritchard is confident in improving his shooting despite a slow start, citing his previous shooting successes.",
      "Coach Joe Mazzulla attributes poor shooting to a new play style requiring more defensive effort and rebounding."
    ]
  },
  {
    "title": "How Mass. native Georges Niang reacted to Celtics&#8217; decision to trade him",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/04/georges-niang-celtics-jazz-trade-comments-quotes/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-11-04T17:50:07.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/V44RQQQWIA6EQPEXGROULS6QTY-1-690a3723aeb57-768x432.jpeg",
    "bullets": [
      "Georges Niang was briefly with the Celtics after being acquired in a trade but was soon sent to Utah.",
      "Niang, a Methuen native, expressed no hard feelings about the trade, understanding it as part of NBA business.",
      "Despite his short stint, Niang appreciated transparent communication with Celtics' Brad Stevens before moving to Utah."
    ]
  },
  {
    "title": "Two Mass. men arrested in Harvard Medical School explosion",
    "url": "https://www.boston.com/news/crime/2025/11/04/harvard-medical-school-explosion-arrests/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-11-04T17:34:32.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/X7JCZXP7D7HR7I3AHS3JEVHMZA-690a2feaad132-768x432.jpg",
    "bullets": [
      "Logan David Patterson, 18, and Dominick Frank Cardoza, 20, arrested for Harvard Medical School explosion on November 1, 2025.",
      "The explosion involved a large commercial firework, causing smoke and debris in a research lab; no injuries reported.",
      "Surveillance footage and public tips led to the quick identification and arrest of the suspects by federal authorities."
    ]
  },
  {
    "title": "‘This has nothing to do with us,’ BPD commissioner says amid Karen Read attorney’s calls for disciplinary review",
    "url": "https://www.boston.com/news/local-news/2025/11/04/bpd-commissioner-replies-to-karen-read-attorneys-calls-for-review/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-11-04T17:30:17.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/08/LRNYYLEUT4H3G2KSS7XYNECR5I-689f82712471d-768x432.jpg",
    "bullets": [
      "Boston Police Commissioner Michael Cox denied involvement in Karen Read's trial, refuting claims by Read's attorney Alan Jackson.",
      "Attorney Alan Jackson accused Cox of lying about his knowledge of testimony by former officer Kelly Dever in Read's case.",
      "Cox emphasized the Read case doesn't pertain to the Boston Police, citing his condolences to fallen officer John O'Keefe's family."
    ]
  },
  {
    "title": "Missing Worcester woman found dead in car",
    "url": "https://www.boston.com/news/local-news/2025/11/04/missing-worcester-woman-found-dead-in-car/",
    "author": "Madison Lucchesi",
    "section": "News",
    "published": "2025-11-04T17:21:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/Screenshot-2025-11-03-at-8.58.41-AM-6908c342bf665-768x432.jpg",
    "bullets": [
      "Joanna Brown, missing since Friday, was found dead in her car on Mount Vernon St., Worcester, Monday afternoon.",
      "Worcester police discovered Brown inside her 2025 gray Mitsubishi Outlander; the cause of death is yet to be determined.",
      "Worcester County District Attorney's Office and police are investigating Brown's death; public asked for information assistance."
    ]
  }
]