[
  {
    "title": "What Steve Kerr, Al Horford said about adding Kristaps Porzingis to the Warriors",
    "url": "https://www.boston.com/sports/boston-celtics/2026/02/18/kristaps-porzingis-trade-warriors-hawks-al-horford-steve-kerr-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2026-02-18T22:41:42.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/3AKSPQEXBZUYXRIKC4GKNRSXFI-69963531d0768-768x432.jpeg",
    "bullets": [
      "Golden State Warriors acquired Kristaps Porzingis from Hawks; he hasn't played yet due to health issues since Jan. 7.",
      "Coach Steve Kerr says Porzingis practiced and anticipates him fitting well with Warriors' gameplay, especially with his post-up skills.",
      "Al Horford emphasizes the importance of a healthy roster, including Stephen Curry and Kristaps Porzingis, for Warriors' success."
    ]
  },
  {
    "title": "A Malibu Barbie Café pop-up is coming to Boston",
    "url": "https://www.boston.com/food/food-news/2026/02/18/a-malibu-barbie-cafe-pop-up-is-coming-to-boston/",
    "author": "Autumn Sloboda",
    "section": "Food",
    "published": "2026-02-18T22:17:37.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Malibu-Barbie-Cafe-Vegas-DSC09650-1-699633288e3d5-768x432.jpg",
    "bullets": [
      "The Malibu Barbie Café pop-up will open on April 17 at 101 S. Market St., near Faneuil Hall, Boston.",
      "The pop-up, by Bucket Listers and Mattel, offers a 1970s Malibu-themed dining experience with a menu by Chef Becky Brown.",
      "Tickets cost $25 and include food and merchandise credit, available exclusively through Bucket Listers with a current waitlist."
    ]
  },
  {
    "title": "Baystate Health will no longer prescribe hormones to trans youth",
    "url": "https://www.boston.com/news/local-news/2026/02/18/baystate-health-will-no-longer-prescribe-hormones-to-trans-youth/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-18T21:30:23.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/OZ6XMBVJCIBERXS6MGPVN3X3WE-6996128b64709-768x432.jpg",
    "bullets": [
      "Baystate Health in Springfield will stop prescribing hormone treatments to transgender youth under 18, citing Medicaid and Medicare funding threats.",
      "The health care system will continue offering mental health counseling and transfer patients to providers like Transhealth for hormone prescriptions.",
      "Baystate's decision follows a regional trend of halting gender-affirming care, as facilities adjust to federal and state funding restrictions."
    ]
  },
  {
    "title": "Gloucester struggles for answers as search for sunken fishing boat continues",
    "url": "https://www.boston.com/news/local-news/2026/02/18/gloucester-lily-jean-search-ongoing/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-18T21:01:12.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Missing_Fishing_Boat_63204-69812fc539f25-768x432.jpg",
    "bullets": [
      "The search for the sunken Gloucester fishing boat Lily Jean, which sank Jan. 30 with seven aboard, has intensified.",
      "Authorities, including Massachusetts Environmental Police, are using sonar and other tech to locate the vessel on the ocean floor.",
      "Gov. Maura Healey praised search efforts and expressed condolences to families of the crew, still presumed lost at sea."
    ]
  },
  {
    "title": "A new hotel has been approved in Boston&#8217;s Seaport",
    "url": "https://www.boston.com/travel/travel/2026/02/18/a-new-hotel-has-been-approved-in-bostons-seaport/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2026-02-18T20:58:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Exterior-Facade-699617d928a56-768x432.jpg",
    "bullets": [
      "Boston Zoning Commission approved a 15-story hotel on Anchor Street adjacent to the Thomas M. Menino Convention Center.",
      "The development by DGH Hotel Partners will include 438 guest rooms, rooftop space, and a landscaped entry plaza.",
      "The hotel project will meet LEED Gold Certification and is part of a campus with Aloft and Element hotels."
    ]
  },
  {
    "title": "$22m Beacon Hill townhome sale sets Boston’s single-family home sale record",
    "url": "https://www.boston.com/real-estate/real-estate-news/2026/02/18/beacon-hill-townhome-46-chestnut-boston-sale-record/",
    "author": "Beth Treffeisen",
    "section": "Real Estate",
    "published": "2026-02-18T20:44:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/View-2-Living-Room-D06-6996210f7ed3d-768x432.jpg",
    "bullets": [
      "Beacon Hill townhome at 46 Chestnut St. sold for $22 million, setting a Boston single-family home sale record.",
      "The 9,000-square-foot Greek Revival residence underwent a two-year renovation by Crest City Capital and Dalfior Development.",
      "The remodeled home features modern systems, custom interiors, and three terraced roof decks with views of the Charles River."
    ]
  },
  {
    "title": "Dave Epstein on the possibilities of more snow Friday, a coastal storm Sunday-Monday",
    "url": "https://www.boston.com/weather/weather/2026/02/18/dave-epstein-on-the-possibilities-of-more-snow-friday-a-coastal-storm-sunday-monday/",
    "author": "David Epstein",
    "section": "Weather",
    "published": "2026-02-18T20:37:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/M7M5CUIN2OBM2CVLRN6QFMK7YE-699622f2da3de-768x432.jpg",
    "bullets": [
      "Friday may bring 2 to 4 inches of snow to Boston, with heavier snowfall in Northern New England.",
      "A coastal storm Sunday into Monday could bring significant snow if it tracks closer to New England.",
      "High tides early next week may cause minor coastal flooding and beach erosion, depending on storm development."
    ]
  },
  {
    "title": "Why a Virginia mom is running the 2026 Boston Marathon: &#8216;Stories can save lives&#8217;",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/18/elizabeth-ayres-american-foundation-for-suicide-prevention/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-18T20:28:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Annie-main-image-Why-Im-Running-9-698df6448f714-768x432.png",
    "bullets": [
      "Elizabeth Ayres, 45, runs the 2026 Boston Marathon to honor her late mother and support suicide prevention.",
      "Ayres discovered running as a therapeutic outlet after her mother's suicide, transforming short walks into marathon runs.",
      "She supports the American Foundation for Suicide Prevention to raise awareness about mental health and encourage seeking help."
    ]
  },
  {
    "title": "Report: Bill Russell&#8217;s widow sues his daughter over breach of contract",
    "url": "https://www.boston.com/sports/boston-celtics/2026/02/18/bill-russell-jeannine-russell-karen-russell-lawsuit/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2026-02-18T20:20:34.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/BUPCEBJ5YVJADOEBWXHJI2PBTY-6996169b1487a-768x432.jpg",
    "bullets": [
      "Jeannine Russell, widow of Bill Russell, sues his daughter Karen over allegedly tarnishing his legacy through a breach of contract.",
      "Karen Russell discussed her father's cognitive issues in a Boston Globe column, violating a confidentiality agreement, claims the lawsuit.",
      "The 2015 court case between Jeannine and Karen Russell over Bill's mental competency was previously settled outside of court."
    ]
  },
  {
    "title": "Pavel Zacha’s Olympic dream turned into a nightmare due to ill-timed injury",
    "url": "https://www.boston.com/sports/boston-bruins/2026/02/18/boston-bruins-pavel-zacha-injury-olympics-hockey-czechia-czech-pastrnak/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2026-02-18T20:03:57.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_tlumackibruins589-69961428491dd-768x432.jpg",
    "bullets": [
      "Pavel Zacha missed the 2026 Winter Olympics due to an upper-body injury sustained on January 29 against the Flyers.",
      "The Boston Bruins and Czech National Team mutually decided Zacha wouldn't participate in the Olympics due to his slow recovery.",
      "Zacha has resumed practicing with the Bruins and is expected to return for their next game on February 27 against Columbus."
    ]
  }
]