[
  {
    "title": "Lowell police seeking public’s help with details about fatal hit-and-run",
    "url": "https://www.boston.com/news/crime/2025/11/04/lowell-police-seeking-publics-help-for-details-about-fatal-hit-and-run/",
    "author": "Darin Zullo",
    "section": "News",
    "published": "2025-11-05T03:45:16.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2025/11/lowellhitandrun-690ac3c25521f-scaled.jpg",
    "bullets": [
      "Lowell police are seeking information about a fatal hit-and-run on Oct. 30 on the 700 block of Chelmsford Street.",
      "A woman was struck by a vehicle just before midnight and later pronounced dead at a local hospital.",
      "Police have identified the vehicle but request public assistance with details; contact Lowell police at 978-937-3200."
    ]
  },
  {
    "title": "&#8216;This is just the beginning’: Nonbinding Israel divestment ballot question passes in Somerville ",
    "url": "https://www.boston.com/news/local-news/2025/11/04/this-is-just-the-beginning-nonbinding-israel-divestment-ballot-question-passes-in-somerville/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-11-05T03:37:38.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/featured-image-sana-1-690aadaf50463-768x432.png",
    "bullets": [
      "Somerville voters passed a nonbinding measure urging officials to divest from firms supporting Israel's actions in Palestine.",
      "The ballot question passed with 55.7% support, driven by grassroots group Somerville for Palestine.",
      "Opposition included a lawsuit by Somerville United Against Discrimination, which was rejected by the court."
    ]
  },
  {
    "title": "Tom Brady just revealed that his dog Junie is a clone of Lua, his deceased furry friend",
    "url": "https://www.boston.com/news/sports/2025/11/04/tom-brady-just-revealed-that-his-dog-junie-is-a-clone-of-lua-his-deceased-furry-friend/",
    "author": "Darin Zullo",
    "section": "News",
    "published": "2025-11-05T02:34:01.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/tombradydog-690ab0d4591aa-768x432.jpg",
    "bullets": [
      "Tom Brady cloned his deceased dog Lua into a new dog, Junie, using a blood sample before her death.",
      "Brady partnered with Colossal Biosciences, a biotech company he's invested in, to facilitate the cloning process.",
      "Colossal Biosciences recently acquired Viagen, a leading animal cloning company, to enhance their species preservation efforts."
    ]
  },
  {
    "title": "Running unopposed, Michelle Wu secures second term as her national profile grows",
    "url": "https://www.boston.com/news/local-news/2025/11/04/running-unopposed-michelle-wu-secures-second-term-as-her-national-profile-grows/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-11-05T02:21:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_kreiter11042025wovote6-690aaebe92d7c-768x432.jpg",
    "bullets": [
      "Michelle Wu secured a second term as Boston mayor, running unopposed after defeating opponent Josh Kraft in September.",
      "Wu received over 30,000 votes, about 91.10% of the total, with 44% of the vote counted by 11 p.m.",
      "She continues to gain national attention, recently featured by New York Magazine as a prominent young Democrat."
    ]
  },
  {
    "title": "Tell us: What should Mayor Wu focus on in her second term?",
    "url": "https://www.boston.com/community/tell-us/2025/11/04/mayor-wu-second-term-priorities/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-05T02:09:38.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_kreiter11042025wovote3-690aaf0c58932-768x432.jpg",
    "bullets": [
      "Mayor Michelle Wu is set for a second term after running unopposed in Boston's 2025 general election.",
      "Wu's first term focused on housing affordability, climate goals, and maintaining Boston as a sanctuary city amid federal challenges.",
      "Public invited to share priorities for Wu's second term, with potential focuses on housing, climate, public safety, and transit."
    ]
  },
  {
    "title": "‘This is kidnapping — plain and simple’: ICE arrests 9 employees at Allston car wash",
    "url": "https://www.boston.com/news/local-news/2025/11/04/this-is-kidnapping-plain-and-simple-ice-arrests-9-employees-in-raid-at-allston-car-wash/",
    "author": "Darin Zullo",
    "section": "News",
    "published": "2025-11-05T00:25:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/allstoncarwash-690a948a50d91-768x432.jpg",
    "bullets": [
      "ICE agents detained 9 employees at Allston Car Wash in a raid, all had valid work permits, according to manager.",
      "Federal agents arrived with subpoenas and detained employees before they could retrieve documents due to a language barrier.",
      "Boston City Councilor Liz Breadon condemned the raid, calling it 'kidnapping' and urged impacted individuals to seek support."
    ]
  },
  {
    "title": "Patriots opt to stand pat at trade deadline",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/04/new-england-patriots-trade-rumors-nfl-deadline-mike-vrabel-eliot-wolf/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-11-04T22:25:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/SG5K6OJ6MYLVBM76MXB2BERQVI-690a766b74539-768x432.jpg",
    "bullets": [
      "The New England Patriots retained their roster at the NFL trade deadline, maintaining a 7-2 record this season.",
      "New England traded away Keion White and Kyle Dugger but made no significant acquisitions before the trade deadline.",
      "Patriots faced roster depth concerns, especially in running back and pass-rushing positions, yet chose not to trade for reinforcements."
    ]
  },
  {
    "title": "Amid SNAP benefit cuts, these Greater Boston food businesses are here to help",
    "url": "https://www.boston.com/food/food-news/2025/11/04/greater-boston-restaurants-help-snap-cuts/",
    "author": "Katelyn Umholtz",
    "section": "Food",
    "published": "2025-11-04T22:00:16.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/Government_Shutdown_63690-690a408037749-768x432.jpg",
    "bullets": [
      "Greater Boston food businesses offer assistance amid SNAP benefit cuts due to federal government shutdown.",
      "Participating businesses include Allandale Farm, Iggy's Bread, and American Flatbread offering free or discounted meals.",
      "Businesses collaborate with nonprofits and community groups to provide resources like community fridges and free food tables."
    ]
  },
  {
    "title": "Karen Read shuffles defense attorney lineup in wrongful death suit",
    "url": "https://www.boston.com/news/crime/2025/11/04/karen-read-adds-drops-defense-attorneys-wrongful-death-suit/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-11-04T21:57:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/QZQZ5PBH3WOUMRG7G4RFDE7LJM-690a688e2f4d6-scaled-e1762289840163-768x432.jpg",
    "bullets": [
      "Karen Read changes defense team, Melick & Porter attorneys withdraw from wrongful death case without explanation.",
      "New defense team from Tang & Maravelis joins Read's civil case, including lawyers Michael Bell and Thomas Tang.",
      "Read plans legal action against witnesses and state police, alleging conspiracy and civil rights violations."
    ]
  },
  {
    "title": "FuGaKyu in Brookline closes after 27 years in business",
    "url": "https://www.boston.com/food/food-news/2025/11/04/fugakyu-brookline-closes/",
    "author": "Katelyn Umholtz",
    "section": "Food",
    "published": "2025-11-04T20:59:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "FuGaKyu, a Japanese restaurant in Brookline, is closing on November 5, 2025, after 27 years of operation.",
      "The closure was announced on Facebook by the owner, citing personal reasons for ceasing operations.",
      "FuGaKyu had prior locations in Lynnfield and Sudbury; patrons have shared memories and support online following the closure announcement."
    ]
  }
]