[
  {
    "title": "Magic pull away, beat Celtics despite another big Jaylen Brown game: 8 takeaways",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/07/celtics-magic-jaylen-brown-takeaways/",
    "author": "Tom Westerholm",
    "section": "Sports",
    "published": "2025-11-08T04:02:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/7MCXKLIZXPQQ6FMHON33UAQCVQ-690ebe91a7209-768x432.jpg",
    "bullets": [
      "The Boston Celtics lost to the Orlando Magic 123-110, with the Magic sinking 17 three-pointers at 47.2% accuracy.",
      "Jaylen Brown led the Celtics with 32 points, but struggled from beyond the arc, hitting just 1 of 6 attempts.",
      "Celtics' Nemias Queta had a +7 plus/minus, but bench players struggled, with Luka Garza at -16 in 13 minutes."
    ]
  },
  {
    "title": "Public reprimand recommended for judge accused of helping immigrant escape ICE",
    "url": "https://www.boston.com/news/local-news/2025/11/07/public-reprimand-recommended-for-judge-accused-of-helping-immigrant-escape-ice/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-08T02:54:29.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Judge Shelley Joseph cleared of misconduct in helping migrant evade ICE, recommended for public reprimand for appearance of impropriety.",
      "Hearing officer Denis McInerney found insufficient evidence Judge Joseph authorized the 2018 escape plan.",
      "Joseph and a court officer were initially federally charged in 2019; charges dropped in 2022 after state investigation agreement."
    ]
  },
  {
    "title": "Alex Cora still high on Red Sox’ future a month after being eliminated by Yankees",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/alex-cora-red-sox-future/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-08T02:40:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/GI4FEZRTXITRY6KNABMHPYJWWI-690ea1593e6d5-768x432.jpg",
    "bullets": [
      "Red Sox manager Alex Cora remains optimistic about the team's future despite their Wild Card Series loss to the Yankees.",
      "Shortstop Trevor Story has opted into his contract, while third baseman Alex Bregman has opted out, impacting the Red Sox's roster plans.",
      "The Red Sox's offseason challenges include possible trades in the outfield and exploring free agency following a third-place finish in their division."
    ]
  },
  {
    "title": "Giant blade breaks off Mass. wind turbine",
    "url": "https://www.boston.com/uncategorized/local-news/2025/11/07/giant-blade-breaks-off-mass-wind-turbine/",
    "author": "Morgan Rousseau",
    "section": "Uncategorized",
    "published": "2025-11-08T01:26:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "A 75-100 foot wind turbine blade detached and fell into a cranberry bog in Plymouth, Massachusetts, on Friday.",
      "No injuries reported; the turbine, located off Head of the Bay Road, shut down automatically in 'fail-safe mode'.",
      "The incident is under investigation by police, MassDEP, and Inspectional Services; site cleanup and blade removal completed."
    ]
  },
  {
    "title": "5 must-watch movies &#038; TV shows streaming right now",
    "url": "https://www.boston.com/culture/streaming/2025/11/07/5-must-watch-movies-tv-shows-streaming-right-now-november-7-2025/",
    "author": "Kevin Slane",
    "section": "Culture",
    "published": "2025-11-08T01:01:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/06/materialists-review-684c76aeb5c14-768x432.jpg",
    "bullets": [
      "'The Fantastic Four: First Steps' is available for streaming on Disney+.",
      "'Frankenstein', a unique take by Guillermo del Toro, is streaming on Netflix.",
      "'Materialists', featuring Dakota Johnson and Pedro Pascal, is available on HBO Max."
    ]
  },
  {
    "title": "Stefon Diggs reveals what he’s trying to improve about himself after 11 years in the NFL",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/07/stefon-diggs-patriots-attitude/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-07T23:56:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/P5M3VBXS54IFLKKYQNH27GTVNA-690e77f421be6-768x432.jpg",
    "bullets": [
      "Stefon Diggs aims to improve his attitude, seeking to manage perfectionism and self-criticism after 11 years in the NFL.",
      "Diggs leads Patriots’ receivers with 508 yards, 56.4 yards per game, 53 targets, 45 receptions, and 25 first downs.",
      "Diggs credits coaches Josh McDaniels and Todd Downing for creating an encouraging and growth-focused team environment."
    ]
  },
  {
    "title": "Commuter train plows through car on tracks in Acton",
    "url": "https://www.boston.com/news/local-news/2025/11/07/commuter-train-plows-through-car-on-tracks-in-acton/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-07T23:16:56.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/KJDIQ5UUZ5FE7MJNIODAKALTYI-690d6322ea85e-768x432.jpg",
    "bullets": [
      "An MBTA train collided with an empty car on the tracks in Acton, pushing it 300 feet; no injuries were reported.",
      "The car's driver evaded a collision by exiting before impact, and will receive a citation from Transit Police.",
      "The incident caused commuter delays on the Fitchburg line, with Train 1427 terminated and passengers rerouted."
    ]
  },
  {
    "title": "What to know about possible Red Sox free agent target Munetaka Murakami after posting",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/munetaka-murakami-red-sox-mlb-free-agency-rumors/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-11-07T21:40:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/DVDHDUJ633XTHRJXKVRJR2N2UY-690e632d77a32-768x432.jpg",
    "bullets": [
      "Japanese star Munetaka Murakami was posted by Nippon Professional Baseball's Tokyo Yakult Swallows, with a December 22 deadline to sign with an MLB team.",
      "Murakami, a 25-year-old power hitter, hit 56 home runs in 2022 and is nicknamed the 'Japanese Babe Ruth'.",
      "The Red Sox, along with other MLB teams, are potential suitors for Murakami, who could play third or first base or be a designated hitter."
    ]
  },
  {
    "title": "Airlines are waiving fees, offering refunds due to reduced flight schedules",
    "url": "https://www.boston.com/travel/flights/2025/11/07/airlines-are-waiving-fees-offerings-refunds-due-to-reduced-flight-schedules/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-11-07T21:10:31.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/01/DPYQ67JGZN7634F3EEUM2AOS3M-679b06305f72a-768x432.jpg",
    "bullets": [
      "Airlines are waiving fees and offering refunds due to a 10% reduction in flights at 40 airports, including Logan.",
      "JetBlue, Southwest, United, American, and Delta are allowing customers to reschedule or get refunds for impacted flights.",
      "Travelers are encouraged to check with their airlines for updates and possible rebooking options due to delays and cancellations."
    ]
  },
  {
    "title": "After Cape Cod crash, readers say Mass. should tighten e-bike regulations",
    "url": "https://www.boston.com/community/readers-say/2025/11/07/massachusetts-should-tighten-ebike-regulations/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-07T20:50:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/6L3T6GPLTKEVUWZ5WJKMGRBWY4-690e57abc1ccd-768x432.jpg",
    "bullets": [
      "A crash on Cape Cod involving an e-bike has sparked debate on tightening Massachusetts' e-bike regulations.",
      "78% of over 580 surveyed readers support stricter e-bike rules, while 20% oppose, citing various safety concerns.",
      "Massachusetts currently classifies e-bikes into two classes, with no explicit regulations for class 3 bikes exceeding 20 mph."
    ]
  }
]