[
  {
    "title": "What a traveling nurse experienced on the hard-hit Cape after Monday&#8217;s blizzard",
    "url": "https://www.boston.com/news/local-news/2026/02/26/what-a-traveling-nurse-experienced-on-the-hard-hit-cape-after-mondays-blizzard/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-26T20:57:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_ryannicedaymet-69a099e0f08d0-768x432.jpg",
    "bullets": [
      "Traveling nurse Colleen Wright navigated unplowed roads and downed trees on Cape Cod to assist elderly clients post-blizzard.",
      "Over 50,000 people on Cape Cod were without power, prompting shelters to open for affected residents, mostly elderly.",
      "Authorities are working to restore power and conduct wellness checks; winter storm caused significant outages and blockages."
    ]
  },
  {
    "title": "City Council rejects effort to ask Wu administration for info on ICE detainer requests",
    "url": "https://www.boston.com/news/local-news/2026/02/26/city-council-rejects-effort-to-ask-wu-administration-for-info-on-ice-detainer-requests/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-26T20:29:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_Wiggs-_CityHall_11-697cd86b716f2-768x432.jpg",
    "bullets": [
      "Boston City Council rejected Councilor Ed Flynn's request for data on ICE detainer requests from the Wu administration.",
      "Flynn sought details on detainer requests handled by Boston Police, but the city council voted 9-3 against his request.",
      "The Trust Act prohibits Boston Police from holding individuals solely on ICE detainers, and all 57 requests in 2025 were ignored."
    ]
  },
  {
    "title": "Here’s why Boston streets seem clearer than after the last big storm",
    "url": "https://www.boston.com/news/local-news/2026/02/26/boston-snow-removal-blizzard/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-26T20:19:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Boston-plow-69a0a7bc6cd6c-768x432.jpg",
    "bullets": [
      "Mayor Michelle Wu extended Boston's parking ban to improve snow removal efficiency after a recent blizzard.",
      "Boston hauled away 200 truckloads of snow on Tuesday by conducting snow removal during daytime, not just overnight.",
      "Wu plans to charge fees to property owners if city workers clear sidewalks, focusing on priority areas like schools."
    ]
  },
  {
    "title": "This Mass. bride and groom skied Killington fresh off their vows and in wedding attire",
    "url": "https://www.boston.com/travel/new-england-travel/2026/02/26/mass-bride-and-groom-skied-killington-in-wedding-attire/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2026-02-26T19:53:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/annemientka_-6-69a08c909a258-768x432.jpg",
    "bullets": [
      "Evan and Kristyn Brophy Stark skied Killington, Vermont in wedding attire after their Feb. 7 wedding ceremony.",
      "The couple hurried to hit the slopes before the 4 p.m. lift closure, still dressed in gown and suit with added winter gear.",
      "Their wedding day at Killington Grand Hotel included a slopeside reception for over 100 guests after skiing the mountain."
    ]
  },
  {
    "title": "Report: Anfernee Simons played with wrist fracture during time with Celtics",
    "url": "https://www.boston.com/sports/boston-celtics/2026/02/26/anfernee-simons-celtics-bulls-wrist-injury-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2026-02-26T19:32:57.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/CSMPFIB3FP3VR2APHTPZXS4ZHU-69a09a43c0d11-768x432.webp",
    "bullets": [
      "Anfernee Simons played 49 games with Celtics despite a wrist fracture sustained during training camp.",
      "Simons was traded to the Bulls with a second-round pick for Nikola Vucevic and is now out indefinitely.",
      "Bulls coach Billy Donovan stated Simons' wrist fracture hasn't healed, causing him to miss three consecutive games."
    ]
  },
  {
    "title": "MBTA Commuter Rail experiences more delays due to snow cleanup and vehicle on track",
    "url": "https://www.boston.com/travel/transportation/2026/02/26/mbta-commuter-rail-experiences-more-delays-due-to-snow-cleanup-and-vehicle-on-track/",
    "author": "Samantha Genzer",
    "section": "Travel",
    "published": "2026-02-26T19:10:27.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/IMG_0968-69a08ed68b73c-768x432.jpeg",
    "bullets": [
      "MBTA Commuter Rail experienced delays due to nearly three feet of snow across multiple lines, including Worcester and Fitchburg.",
      "A motor vehicle on the Worcester line previously caused additional delays, but it has been cleared, Keolis Commuter Services reported.",
      "Despite ongoing snow cleanup, Boston-area commuters faced severe disruptions during a harsh winter, sparking criticism of MBTA services."
    ]
  },
  {
    "title": "All Mass. residents to get free access to Google AI training classes, Healey says",
    "url": "https://www.boston.com/news/local-news/2026/02/26/all-mass-residents-to-get-free-access-to-google-ai-training-classes-healey-says/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-26T18:38:15.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_Wiggs-_OGoogle_4-69a08cd26d2b9-768x432.jpg",
    "bullets": [
      "Gov. Maura Healey announces free AI training access for all Massachusetts residents through Google partnership.",
      "Courses cover AI, cybersecurity, digital marketing, and more, accessible via Google’s Grow with Google program.",
      "Offer aims to boost AI skills in Massachusetts, running until at least 2027, part of Healey's AI economic strategy."
    ]
  },
  {
    "title": "Charlie McAvoy apologizes for Team USA’s reaction to Trump joke about US women’s team",
    "url": "https://www.boston.com/sports/boston-bruins/2026/02/26/charlie-mcavoy-team-usa-mens-hockey-donald-trump-joke-olympics-us-womens-hockey-boston-bruins/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2026-02-26T18:35:50.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Milan_Cortina_Olympics_Ice_Hockey_84256-1-69a08d05df39a-768x432.jpg",
    "bullets": [
      "Charlie McAvoy apologized for Team USA men's reaction to Trump's joke about US women's hockey team.",
      "Team USA received Trump's call after winning Olympic gold, where he joked about inviting the women's team.",
      "US women's team declined the White House visit invite due to prior commitments, appreciated the acknowledgment."
    ]
  },
  {
    "title": "Mayor Jake Wilson plans to tackle Somerville&#8217;s housing crisis. Will it work?",
    "url": "https://www.boston.com/news/local-news/2026/02/26/mayor-jake-wilson-plans-to-tackle-somervilles-housing-crisis-will-it-work/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-26T17:57:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_kreiter08062025cityview1-69a07c7508143-768x432.jpg",
    "bullets": [
      "Mayor Jake Wilson proposes zoning changes and investments to address Somerville's housing crisis and increase affordable housing.",
      "Somerville's housing prices soared with single-family homes reaching $1.3 million in 2025, despite growth in new housing units.",
      "Wilson supports projects like 299 Broadway and a new overlay strategy to promote affordability around the Green Line Extension."
    ]
  },
  {
    "title": "Watch this wild (and inspirational) video out of New Bedford following the blizzard",
    "url": "https://www.boston.com/news/local-news/2026/02/26/video-pickup-truck-new-bedford-snow/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-26T17:39:44.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/02/Screenshot-2026-02-26-at-11.12.48-AM-69a07109299a6.png",
    "bullets": [
      "New Bedford resident Scott Vicente drove a pickup through snow-covered streets after a blizzard, captured on video by Allie Crane.",
      "Many side streets in New Bedford remain unplowed after the blizzard, causing difficult driving conditions for residents.",
      "Vicente advises caution for drivers without trucks during ongoing snow clearance, as smaller vehicles risk getting stuck."
    ]
  }
]