[
  {
    "title": "Car rammed by train in Abington after breaking down on tracks",
    "url": "https://www.boston.com/uncategorized/local-news/2026/02/02/car-rammed-by-train-in-abington-after-breaking-down-on-tracks/",
    "author": "Carson Lyle",
    "section": "Uncategorized",
    "published": "2026-02-03T02:48:50.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Screenshot-2026-02-02-at-9.29.46-PM-69815e67aa057-768x432.png",
    "bullets": [
      "A 2007 Honda was hit by an MBTA train near Plymouth St. in Abington around 8 p.m. Sunday.",
      "The car broke down on the tracks and was unoccupied when the train collided, according to Transit Police.",
      "No casualties or injuries were reported following the incident, Transit Police confirmed."
    ]
  },
  {
    "title": "Woman, 57, walking in road due to snow hit and killed by car on Route 28 in Wareham, DA says",
    "url": "https://www.boston.com/news/local-news/2026/02/02/woman-57-walking-in-road-due-to-snow-hit-and-killed-by-car-on-route-28-in-wareham-da-says/",
    "author": "Carson Lyle",
    "section": "News",
    "published": "2026-02-03T02:36:12.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/01/EYX5EI6ZNFADBVKXBC24Y3PWYU-6965a3dc3fce0-scaled.jpg",
    "bullets": [
      "A 57-year-old woman was fatally struck by a vehicle on Route 28 in Wareham while walking due to snow-covered sidewalks.",
      "The driver and passenger of the Volvo involved remained on the scene; they reported the accident to Wareham police.",
      "The woman was knocked toward the road after being grazed by a truck, resulting in the fatal collision with the Volvo."
    ]
  },
  {
    "title": "Former North Shore police officer gets prison time for child porn charge",
    "url": "https://www.boston.com/news/local-news/2026/02/02/former-north-shore-police-officer-gets-prison-time-for-child-porn-charge/",
    "author": "Carson Lyle",
    "section": "News",
    "published": "2026-02-03T00:00:49.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/02/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2019_06_04_BostonGlobe.com_Regional_Images_PlusNoConsent-698134fc15067-scaled.jpeg",
    "bullets": [
      "Alexander Aiello, former Gloucester police officer, sentenced to 4 years in prison for child pornography charge.",
      "Aiello pleaded guilty in October 2025 to receiving child pornography, with over 200 illegal files discovered.",
      "Aiello used a dark web browser to access child pornography, and devices were seized from his home in April 2025."
    ]
  },
  {
    "title": "‘The finest kind’: Gloucester mourns 7 lost in Lily Jean sinking as Coast Guard launches probe",
    "url": "https://www.boston.com/news/local-news/2026/02/02/gloucester-mourns-7-lost-lily-jean-fishing-boat-sinking/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-02T23:42:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Missing_Fishing_Boat_63204-69812fc539f25-768x432.jpg",
    "bullets": [
      "Seven people, including Captain Accursio Sanfilippo, are presumed dead after the Lily Jean fishing boat sank off Gloucester.",
      "The Coast Guard is investigating the sinking of Lily Jean with the National Transportation Safety Board, expected to take months.",
      "Gloucester community mourns; fishing vessel recovery deemed unlikely due to challenging conditions, officials warn of speculation."
    ]
  },
  {
    "title": "Why readers think Bill Belichick belonged in the Hall of Fame this year",
    "url": "https://www.boston.com/community/readers-say/2026/02/02/bill-belichick-hall-of-fame-snub/",
    "author": "Autumn Sloboda",
    "section": "Community",
    "published": "2026-02-02T22:18:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/Hall_of_Fame_Belichick_Football_99557-697d254fc549c-768x432.jpg",
    "bullets": [
      "Bill Belichick was not inducted into the Pro Football Hall of Fame's Class of 2026, lacking the required votes.",
      "Over 450 Boston.com readers voted, with 93% believing Belichick deserved Hall of Fame induction this year.",
      "Some readers cited Belichick's achievements, while others mentioned scandals and his coaching with Tom Brady as factors."
    ]
  },
  {
    "title": "Which Patriots Super Bowl will you never forget?",
    "url": "https://www.boston.com/community/tell-us/2026/02/02/favorite-patriots-super-bowl-memories/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-02T21:29:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/f9708efe-9eb0-11e4-a89d-8b893f51b3d0-69810151c882d-768x432.jpg",
    "bullets": [
      "New England Patriots are preparing for their 12th Super Bowl appearance, sparking memories of past iconic games.",
      "Fans recall Adam Vinatieri's 2002 game-winning field goal and Malcolm Butler's interception against the Seahawks.",
      "Boston.com invites readers to share personal Patriots Super Bowl memories, from iconic plays to family traditions."
    ]
  },
  {
    "title": "This runner is raising awareness about stroke and heart disease",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/02/liz-lang-tedys-team/",
    "author": "Kelly Chan",
    "section": "Community",
    "published": "2026-02-02T21:00:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/liz-lang-tease-6981100119108-768x432.jpg",
    "bullets": [
      "Liz Lang from Jackson, NJ, is running the 2026 Boston Marathon to raise awareness for stroke and heart disease.",
      "After overcoming heart arrhythmia and antiphospholipid syndrome, Lang emphasizes perseverance and self-advocacy in managing health.",
      "Lang is fundraising for Tedy's Team to support research and outreach efforts regarding heart conditions and stroke warning signs."
    ]
  },
  {
    "title": "Once a patient, now a runner: She’s running for Boston Children’s Hospital",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/02/molly-kokoski-boston-childrens-hospital/",
    "author": "Kelly Chan",
    "section": "Community",
    "published": "2026-02-02T20:49:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/IMG_8745-69792a9fba2b3-768x432.jpeg",
    "bullets": [
      "Molly Kokoski, a former patient, is running the Boston Marathon to raise funds for Boston Children's Hospital.",
      "Diagnosed with ulcerative colitis and living with an ostomy bag, Kokoski aims to inspire others through her run.",
      "Kokoski, a Boston resident, has long dreamed of participating in the marathon, inspired by its energy and her community."
    ]
  },
  {
    "title": "Saks OFF 5th to close Massachusetts stores",
    "url": "https://www.boston.com/news/business/2026/02/02/saks-off-5th-to-close-massachusetts-stores/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-02T20:42:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Saks_Fur_Free_13241-698107d05d5a5-768x432.jpg",
    "bullets": [
      "Saks OFF 5th stores in Somerville's Assembly Row and Wrentham will close as parent company Saks Global files for bankruptcy.",
      "Saks Global will keep only a dozen Saks OFF 5th stores open, shifting focus to luxury retail and full-price operations.",
      "The bankruptcy follows heavy debt from acquiring Neiman Marcus, with $1.75 billion financing secured for restructuring."
    ]
  },
  {
    "title": "Middleton loses $2 million state grant after failing to comply with MBTA Communities Act",
    "url": "https://www.boston.com/news/local-news/2026/02/02/middleton-loses-2-million-infrastructure-grant/",
    "author": "Annie Jonas",
    "section": "News",
    "published": "2026-02-02T19:34:42.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Image_20260202_111253-6980e08c8a629-768x432.jpeg",
    "bullets": [
      "Middleton loses $2 million state grant for safety upgrades due to noncompliance with the MBTA Communities Act.",
      "State funds were intended for reconstructing Middleton's Route 62 and Route 114 high-crash intersection, impacting about 25,000 vehicles daily.",
      "Middleton's housing project proceeds without safety improvements, risking increased traffic issues at a dangerous intersection."
    ]
  }
]