[
  {
    "title": "With NBA season approaching, Anfernee Simons is ready for new role",
    "url": "https://www.boston.com/sports/boston-celtics/2025/10/01/with-nba-season-approaching-anfernee-simons-is-ready-for-new-role/",
    "author": "Aidan Buchanan",
    "section": "Sports",
    "published": "2025-10-01T12:12:56.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/D4B2RCDGD2IRG5KOS626QAIRVU-68dbecabb391d-768x432.jpg",
    "bullets": [
      "Boston Celtics \"I want to contribute to winning at the highest level.",
      "And so whatever, how that looks, I'm fine with.",
      "\" Anfernee Simons at the Celtics Media Day (Danielle Parhizkaran/Globe Staff)."
    ]
  },
  {
    "title": "&#8216;Believers&#8217; co-directors Gotham Chopra and Lauren Fisher discuss new ESPN Red Sox series",
    "url": "https://www.boston.com/red-sox/boston-red-sox/2025/10/01/espn-red-sox-documentary-believers-gotha-chopra-lauren-fisher-interview/",
    "author": "Khari A. Thompson",
    "section": "Red Sox",
    "published": "2025-10-01T11:26:31.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/VW5ZUP2N45FFBPKOZ5MRQDAVDA-68dc2db605ff0-768x432.jpg",
    "bullets": [
      "Boston Red Sox Chopra and Fisher sat down with Boston.",
      "com for a wide-ranging interview about the three-part documentary.",
      "The Red Sox celebrate a long awaited win."
    ]
  },
  {
    "title": "Fall in New England has never looked this good",
    "url": "https://www.boston.com/travel/scenic-six/2025/10/01/fall-in-new-england-has-never-looked-this-good/",
    "author": "Boston.com Staff",
    "section": "Travel",
    "published": "2025-10-01T11:00:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Copy-of-Google-Discover-templates-6-68dbf4b9e12a2-768x432.png",
    "bullets": [
      "Scenic Six Get five days of New England travel tips with Fall Field Guide.",
      "If you ask us, New England is at its best in the fall.",
      "From vibrant foliage and scenic drives to cozy weekend getaways, apple orchards, and the region’s best cider doughnuts, the fall is nothing short of magical — and we’re here to help you experience it all."
    ]
  },
  {
    "title": "Red Sox’s late-inning rally was sparked by a group of unsung heroes",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/10/01/red-sox-rally-yankees-game-1-masataka-yoshida-sogard-nick-rafaela/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-10-01T10:26:12.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/10/YWRAPWPVBIWORXFK6DTWMGXTHQ-68dce2987ee5a-768x432.jpg",
    "bullets": [
      "Boston Red Sox \"Scrappy, man.",
      "We have different ways to win as an offense.",
      "\" Masataka Yoshida put Boston ahead in the seventh inning."
    ]
  },
  {
    "title": "In his first playoff start, Garrett Crochet pitched a masterpiece for Red Sox in Yankee Stadium",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/10/01/garrett-crochet-boston-red-sox-mlb-baseball-yankees-game-1-alex-cora/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-10-01T10:20:53.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/10/SUMZY3ULTPHAL5RDQVI37SKCYU-68dcc98527863-768x432.jpg",
    "bullets": [
      "Boston Red Sox \"Just a performance that big-time pitchers make.",
      "And that's who he is.",
      "” Garrett Crochet finished his outing on Tuesday with 117 pitches."
    ]
  },
  {
    "title": "5 new restaurants we’re excited to try in October",
    "url": "https://www.boston.com/food/restaurants/2025/10/01/new-restaurant-openings-october-2025/",
    "author": "Jillian Dara",
    "section": "Food",
    "published": "2025-10-01T09:00:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/89-Charles-2-68dc438dd43c9-768x432.jpg",
    "bullets": [
      "Restaurants Where to eat next: 5 new restaurants opening in Beacon Hill, the Wharf District, Seaport, and Jamaica Plain this October.",
      "89 Charles.",
      "Courtesy ShareSend this article to your social connections."
    ]
  },
  {
    "title": "Recent homes sales in Greater Boston (Oct. 1)",
    "url": "https://www.boston.com/real-estate/real-estate-news/2025/10/01/recent-homes-sales-in-greater-boston-oct-1/",
    "author": "The Boston Globe",
    "section": "Real Estate",
    "published": "2025-10-01T09:00:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/10/house-orange-6705b939840fc-768x432.jpg",
    "bullets": [
      "Real Estate News ShareSend this article to your social connections.",
      "ABINGTON 413 Linwood St.",
      "One-family raised ranch, built in 1970, 1,873 square feet, 7 rooms, 3 bedrooms, 2 baths, on 22,197-square-foot lot."
    ]
  },
  {
    "title": "DA: Malden man arrested, two others charged in connection to fatal Dedham shooting",
    "url": "https://www.boston.com/news/crime/2025/09/30/da-malden-man-arrested-two-others-charged-in-connection-to-fatal-dedham-shooting/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-10-01T03:54:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Crime James Brown, 23, is scheduled to be arraigned Oct.",
      "1 on charges including murder and carrying a firearm without a license.",
      "Three people are now facing charges, including one man charged with murder, in connection with a fatal June shooting in the parking lot of a Dedham BJ’s, prosecutors announced Tuesday."
    ]
  },
  {
    "title": "How did your town do on the MCAS this year? Search scores here.",
    "url": "https://www.boston.com/news/local-news/2025/09/30/how-did-your-town-do-on-the-mcas-this-year-search-scores-here/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-10-01T03:27:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_ryanmcas2met-68dc9bff1791b-768x432.jpg",
    "bullets": [
      "StateELA51 StateMATH45 StateSCI46 Abby Kelley Foster Charter Public (District)ELA78 Abby Kelley Foster Charter Public (District)MATH64 Abby Kelley Foster Charter Public (District)SCI72 AbingtonELA43 AbingtonMATH40 AbingtonSCI47 Academy Of the Pacific Rim Charter Public (District)ELA29 Academy Of the Pacific Rim Charter Public (District)MATH17 Academy Of the Pacific Rim Charter Public (District)SCI5 Acton-BoxboroughELA83 Acton-BoxboroughMATH82 Acton-BoxboroughSCI79 Advanced Math and Science Academy CharterELA73 Advanced Math and Science Academy CharterMATH90 Advanced Math and Science Academy CharterSCI74 AgawamELA46 AgawamMATH40 AgawamSCI49 AmesburyELA51 AmesburyMATH43 AmesburySCI53 Amherst-PelhamELA70 Amherst-PelhamMATH60 Amherst-PelhamSCI66 AndoverELA74 AndoverMATH77 AndoverSCI72 Argosy Collegiate Charter School (District)ELA32 Argosy Collegiate Charter School (District)MATH31 Argosy Collegiate Charter School (District)SCI34 ArlingtonELA80 ArlingtonMATH81 ArlingtonSCI83 Ashburnham-WestminsterELA58 Ashburnham-WestminsterMATH47 Ashburnham-WestminsterSCI55 AshlandELA71 AshlandMATH70 AshlandSCI65 Assabet Valley Regional Vocational TechnicalELA46 Assabet Valley Regional Vocational TechnicalMATH33 Assabet Valley Regional Vocational TechnicalSCI31 Athol-RoyalstonELA23 Athol-RoyalstonMATH18 Athol-RoyalstonSCI20 Atlantis Charter (District)ELA37 Atlantis Charter (District)MATH22 Atlantis Charter (District)SCI14 AttleboroELA50 AttleboroMATH37 AttleboroSCI35 AuburnELA42 AuburnMATH44 AuburnSCI45 AvonELA32 AvonMATH26 AvonSCI18 Ayer Shirley School DistrictELA57 Ayer Shirley School DistrictMATH38 Ayer Shirley School DistrictSCI57 BarnstableELA38 BarnstableMATH29 BarnstableSCI29 Baystate Academy Charter Public School (District)ELA15 Baystate Academy Charter Public School (District)MATH6 Baystate Academy Charter Public School (District)SCI10 BedfordELA79 BedfordMATH70 BedfordSCI72 BelchertownELA66 BelchertownMATH56 BelchertownSCI67 BellinghamELA48 BellinghamMATH40 BellinghamSCI48 BelmontELA81 BelmontMATH81 BelmontSCI85 Berkshire Arts and Technology Charter Public (District)ELA50 Berkshire Arts and Technology Charter Public (District)MATH26 Berkshire Arts and Technology Charter Public (District)SCI34 Berkshire HillsELA40 Berkshire HillsMATH33 Berkshire HillsSCI61 Berlin-BoylstonELA83 Berlin-BoylstonMATH77 Berlin-BoylstonSCI67 BeverlyELA45 BeverlyMATH39 BeverlySCI49 BillericaELA51 BillericaMATH44 BillericaSCI66 Blackstone Valley Regional Vocational TechnicalELA65 Blackstone Valley Regional Vocational TechnicalMATH55 Blackstone Valley Regional Vocational TechnicalSCI56 Blackstone-MillvilleELA31 Blackstone-MillvilleMATH28 Blackstone-MillvilleSCI34 Blue Hills Regional Vocational TechnicalELA51 Blue Hills Regional Vocational TechnicalMATH37 Blue Hills Regional Vocational TechnicalSCI36 BostonELA40 BostonMATH38 BostonSCI33 Boston Collegiate Charter (District)ELA39 Boston Collegiate Charter (District)MATH49 Boston Collegiate Charter (District)SCI18 Boston Day and Evening Academy Charter (District)ELA8 Boston Day and Evening Academy Charter (District)MATH0 Boston Green Academy Horace Mann Charter School (District)ELA23 Boston Green Academy Horace Mann Charter School (District)MATH11 Boston Green Academy Horace Mann Charter School (District)SCI6 Boston Preparatory Charter Public (District)ELA29 Boston Preparatory Charter Public (District)MATH27 Boston Preparatory Charter Public (District)SCI9 BourneELA53 BourneMATH36 BourneSCI31 BraintreeELA61 BraintreeMATH64 BraintreeSCI67 Bridgewater-RaynhamELA43 Bridgewater-RaynhamMATH43 Bridgewater-RaynhamSCI63 Bristol County AgriculturalELA53 Bristol County AgriculturalMATH44 Bristol County AgriculturalSCI62 Bristol-Plymouth Regional Vocational TechnicalELA48 Bristol-Plymouth Regional Vocational TechnicalMATH45 Bristol-Plymouth Regional Vocational TechnicalSCI42 BrocktonELA29 BrocktonMATH18 BrocktonSCI19 Brooke Charter School (District)ELA77 Brooke Charter School (District)MATH68 Brooke Charter School (District)SCI80 BrooklineELA83 BrooklineMATH84 BrooklineSCI86 BurlingtonELA59 BurlingtonMATH53 BurlingtonSCI58 CambridgeELA56 CambridgeMATH57 CambridgeSCI53 CantonELA60 CantonMATH59 CantonSCI71 Cape Cod Regional Vocational TechnicalELA57 Cape Cod Regional Vocational TechnicalMATH52 Cape Cod Regional Vocational TechnicalSCI58 CarverELA48 CarverMATH29 CarverSCI38 Central BerkshireELA51 Central BerkshireMATH50 Central BerkshireSCI58 ChelmsfordELA73 ChelmsfordMATH61 ChelmsfordSCI52 ChelseaELA20 ChelseaMATH18 ChelseaSCI18 ChicopeeELA33 ChicopeeMATH19 ChicopeeSCI24 ClintonELA33 ClintonMATH27 ClintonSCI26 Codman Academy Charter Public (District)ELA10 Codman Academy Charter Public (District)MATH25 Codman Academy Charter Public (District)SCI11 CohassetELA86 CohassetMATH76 CohassetSCI78 Collegiate Charter School of Lowell (District)ELA43 Collegiate Charter School of Lowell (District)MATH15 Collegiate Charter School of Lowell (District)SCI14 Community Charter School of Cambridge (District)ELA62 Community Charter School of Cambridge (District)MATH61 Community Charter School of Cambridge (District)SCI57 Concord-CarlisleELA84 Concord-CarlisleMATH81 Concord-CarlisleSCI80 DanversELA45 DanversMATH31 DanversSCI48 DartmouthELA61 DartmouthMATH52 DartmouthSCI45 DedhamELA39 DedhamMATH54 DedhamSCI47 Dennis-YarmouthELA40 Dennis-YarmouthMATH27 Dennis-YarmouthSCI30 Dighton-RehobothELA53 Dighton-RehobothMATH45 Dighton-RehobothSCI62 DouglasELA49 DouglasMATH33 DouglasSCI37 Dover-SherbornELA91 Dover-SherbornMATH87 Dover-SherbornSCI86 DracutELA37 DracutMATH37 DracutSCI38 Dudley-Charlton RegELA37 Dudley-Charlton RegMATH36 Dudley-Charlton RegSCI42 DuxburyELA85 DuxburyMATH90 DuxburySCI77 East BridgewaterELA45 East BridgewaterMATH38 East BridgewaterSCI56 East LongmeadowELA49 East LongmeadowMATH47 East LongmeadowSCI62 EasthamptonELA39 EasthamptonMATH35 EasthamptonSCI36 EastonELA69 EastonMATH71 EastonSCI61 Edward M.",
      "Kennedy Academy for Health Careers: A Horace Mann Charter Public School (District)ELA25 Edward M.",
      "Kennedy Academy for Health Careers: A Horace Mann Charter Public School (District)MATH13 Edward M."
    ]
  },
  {
    "title": "Services planned for Haverhill police officer, 32, who died &#8216;unexpectedly&#8217;",
    "url": "https://www.boston.com/news/local-news/2025/09/30/services-planned-for-haverhill-officer-32-who-died-unexpectedly/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-10-01T02:22:28.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Local News Katelyn Tully, a decorated army veteran who served in Afghanistan for six months, will be buried with military honors.",
      "The funeral for a Haverhill police officer who died “unexpectedly” Sept.",
      "26 will be held Friday, according to her obituary."
    ]
  }
]