[
  {
    "title": "Healey orders flags at state buildings flown at half-staff to honor Charlie Kirk",
    "url": "https://www.boston.com/news/politics/2025/09/12/flags-massachusetts-buildings-half-staff-charlie-kirk/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T18:43:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Kirk-68c1fc020d806-768x432.jpg",
    "bullets": [
      "Gov. Maura Healey orders flags at half-staff in Massachusetts until Sept. 14 to honor Charlie Kirk.",
      "Charlie Kirk was assassinated at Utah Valley University, prompting a proclamation by President Donald Trump.",
      "Tyler Robinson, 22, was arrested for Kirk's murder; motive remains unclear, but political involvement noted."
    ]
  },
  {
    "title": "A family-friendly guide to apple picking in New England",
    "url": "https://www.boston.com/travel/travel/2025/09/12/a-family-friendly-guide-to-apple-picking-in-new-england/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-09-12T17:57:11.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/09/hpho1-66e47e71d65a3-768x432.jpg",
    "bullets": [
      "Honey Pot Hill Orchards in Stow, Massachusetts offers 30 apple varieties, mazes, petting animals, and cider doughnuts recognized among New England's best.",
      "Cider Hill Farm in Amesbury, Massachusetts features over 60 apple varieties, pumpkin picking, a trike yard, and a farm store with homemade sandwiches.",
      "Applecrest Farm Orchards in Hampton Falls, New Hampshire hosts Harvest Festivals with hayrides, petting zoo, corn maze, and themed weekend events."
    ]
  },
  {
    "title": "Judge tosses ordinance limiting tear gas, rubber bullet use by Boston police",
    "url": "https://www.boston.com/news/local-news/2025/09/12/judge-tosses-ordinance-limiting-tear-gas-rubber-bullet-use-boston-police/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T17:28:18.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2024/12/MRUPU6WH3N32DSOI4TYI2V4BFU-676050d893196-768x432.jpg",
    "bullets": [
      "Judge Jackie Cowin ruled Boston City Council exceeded its authority with an ordinance limiting tear gas and rubber bullet use.",
      "The 2021 ordinance required supervisory approval, witness of violence, and warnings before using non-lethal measures on large crowds.",
      "The court found the ordinance interfered with police authority, as weapon deployment is under Police Commissioner control per City Charter."
    ]
  },
  {
    "title": "Did a Brooklyn couple kill a neighbor’s trees for a better view in Maine?",
    "url": "https://www.boston.com/news/local-news/2025/09/12/did-a-brooklyn-couple-kill-a-neighbors-trees-for-a-better-view-in-maine/",
    "author": "New York Times Service",
    "section": "News",
    "published": "2025-09-12T17:14:33.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___nytapi.wieck_.com_feed-photos_6mT6A07m-68c45114896fe-768x432.jpg",
    "bullets": [
      "Maine's Board of Pesticides Control accuses Stephen Antonson and Kathleen Hackett of poisoning neighbor's trees for harbor view.",
      "Stephen Antonson and Kathleen Hackett deny poisoning accusations from neighbor Ruth Graham's property in Rockport, Maine.",
      "Tests revealed herbicidal poison in trees aligned with the Antonson residence deck; investigations continue despite couple's denial."
    ]
  },
  {
    "title": "Pharma giant with large Mass. footprint to slash 9,000 jobs globally",
    "url": "https://www.boston.com/news/business/2025/09/12/pharma-giant-with-large-mass-footprint-to-slash-9000-jobs-globally/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-12T17:12:46.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___news-service.s3.amazonaws.com_novo-bg-L6PHAEZU2ZGDBAVRRQYPBUCCPA-68c44e63339b5-768x432.jpg",
    "bullets": [
      "Novo Nordisk will cut 9,000 jobs globally by 2026 to reduce complexity and costs, impacting local sites differently.",
      "Novo Nordisk employs 450 people in Massachusetts, but hasn't disclosed specific job cut numbers or affected sites.",
      "The company expects $1.25 billion in annualized savings, focusing on diabetes and obesity growth opportunities, despite a competitive market."
    ]
  },
  {
    "title": "Police officer, suspect shot in Roxbury during chase",
    "url": "https://www.boston.com/news/crime/2025/09/12/police-officer-suspect-shot-in-roxbury-during-chase/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-12T16:41:29.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2024/09/Police_Staffing_Shortages_64169-66e3a9b64a9f4.jpg",
    "bullets": [
      "A Boston police officer and suspect were injured in a shootout during a foot chase in Roxbury early Friday.",
      "The suspect fired at officers, hitting one in the arm; police returned fire, injuring the suspect's lower extremities.",
      "Both injured parties were hospitalized with non-life-threatening injuries; a high-capacity firearm was recovered at the scene."
    ]
  },
  {
    "title": "The last person to question Charlie Kirk",
    "url": "https://www.boston.com/news/national-news/2025/09/12/the-last-person-to-question-charlie-kirk/",
    "author": "Jack Healy and Reid J. Epstein, The New York Times",
    "section": "News",
    "published": "2025-09-12T16:27:48.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/APTOPIX_Charlie_Kirk_Shot_56517-68c2be20b3151-768x432.jpg",
    "bullets": [
      "Charlie Kirk was assassinated at Utah Valley University shortly after a brief exchange with liberal TikToker Hunter Kozak.",
      "Kozak, a math education student, expressed concern for his safety after the shooting, fearing backlash and conspiracy theories.",
      "Kozak questioned Kirk on mass shootings linked to transgender people, regretting the question amidst online conspiracies."
    ]
  },
  {
    "title": "North Andover officer shot by colleague back in jail just days after release",
    "url": "https://www.boston.com/news/local-news/2025/09/12/north-andover-officer-shot-by-colleague-back-in-jail-just-days-after-release/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2025-09-12T15:48:16.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/NIU67MEQK6ZWMG4TB54N4JL4NY-68c43c4671a6a-768x432.jpg",
    "bullets": [
      "Kelsey Fitzsimmons, a North Andover police officer, was ordered back to jail for failing to comply with alcohol testing.",
      "Fitzsimmons, shot by a fellow officer, faces an assault charge; she alleges it was a failed suicide attempt, not an attack.",
      "Her legal team argues that alternative alcohol testing methods should be allowed, citing health issues from her injuries."
    ]
  },
  {
    "title": "The owners of the orange dinosaur are suing Saugus. Here’s why.",
    "url": "https://www.boston.com/news/business/2025/09/12/the-owners-of-the-orange-dinosaur-are-suing-saugus-heres-why/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-12T15:41:43.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2017_07_11_BostonGlobe.com_Lifestyle_Images_ryan_dino1_met-68c07feaca532-768x432.jpg",
    "bullets": [
      "TB Holdings LLC is suing Saugus for allegedly coercing a $200,000 payment to continue their Essex Landing project.",
      "The lawsuit claims Town Manager Scott Crabtree demanded the donation to the parks department, slowing project progress otherwise.",
      "Despite legal action, TB Holdings plans to continue with development, including an assisted living facility and apartment building."
    ]
  },
  {
    "title": "Heidi Watney happily returns to Fenway with Apple TV+ for Yankees-Red Sox: ‘It’s like coming home’",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/09/12/heidi-watney-red-sox-yankees-apple-tv/",
    "author": "Chad Finn",
    "section": "Sports",
    "published": "2025-09-12T15:12:44.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/ZIDNMOVWSVA4BIO7YAATZ3HFKQ-68c40e2793200-768x432.jpg",
    "bullets": [
      "Heidi Watney returns to Fenway Park for Yankees-Red Sox series with Apple TV+.",
      "Watney worked with NESN's Red Sox coverage from 2008 to 2011.",
      "Post-NESN, Watney spent nine years with MLB Network and now reports for Apple TV+."
    ]
  }
]