[
  {
    "title": "6 things to watch for during Bruins training camp",
    "url": "https://www.boston.com/sports/boston-bruins/2025/09/16/boston-bruins-training-camp-preview-nhl-hockey-sturm-pastrnak-swayman/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-09-17T00:36:29.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_03bruins_CaptainsPractice_07-1-68c9cb62aaf71-768x432.jpg",
    "bullets": [
      "Boston Bruins Marco Sturm's system tweaks, lineup reshuffles, and the opportunity afforded to younger players will be things to watch over the next three weeks.",
      "David Pastrnak is expected to be one of the leaders on a revamped Bruins roster this season.",
      "Ken McGagh for The Boston Globe By Conor Ryan September 16, 2025 9 minutes to read ShareSend this article to your social connections."
    ]
  },
  {
    "title": "Why does the manufacturer say transmission fluid is good for the life of the vehicle?",
    "url": "https://www.boston.com/cars/how-to/2025/09/16/car-doctor-why-does-the-manufacturer-say-transmission-fluid-is-good-for-the-life-of-the-vehicle/",
    "author": "John Paul",
    "section": "Cars",
    "published": "2025-09-17T00:16:37.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/Car-Doctor-68c9fbbfe412a-768x432.jpg",
    "bullets": [
      "How To John Paul, AAA Northeast's Car Doctor, answers a question from a reader who was told they never had to change their vehicle’s transmission fluid.",
      "The Car Doctor answers a question from a reader who was told they never had to change their vehicle’s transmission fluid.",
      "Mitchell Hubble/Mazda North America via AP By John Paul September 16, 2025 4 minutes to read ShareSend this article to your social connections."
    ]
  },
  {
    "title": "MIT investigating messages of hate, violence found on campus over the past week",
    "url": "https://www.boston.com/news/local-news/2025/09/16/mit-investigating-messages-of-hate-violence-found-on-campus-over-the-past-week/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-09-17T00:11:19.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Local News President Sally Kornbluth said the incidents, which did not appear connected, include two hand-drawn swastikas, a sign wishing violence on a conservative non-profit, and an email list of “messages celebrating violence.",
      "\" MIT police are investigating numerous instances of hateful speech and images around campus, President Sally Kornbluth said in a letter to the MIT community Friday.",
      "Kornbluth said the incidents — two hand-drawn swastikas, a sign wishing violence on a conservative non-profit, and cases of graffiti and an email list of “messages celebrating violence” — do not seem to be connected."
    ]
  },
  {
    "title": "Brockton man arrested in connection with fatal Fitchburg stabbing",
    "url": "https://www.boston.com/news/crime/2025/09/16/brockton-man-arrested-in-connection-with-fatal-fitchburg-stabbing/",
    "author": "Audrey Cooney",
    "section": "News",
    "published": "2025-09-16T23:35:56.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2025/04/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2017_02_19_BostonGlobe.com_Metro_Images_BEDFORD_20170219_HOMICIDE_003-68113ba0b1df2-scaled.jpg",
    "bullets": [
      "Crime Fitchburg police arrived at Chester Street in response to a reported incident with a knife and found a man who had been stabbed, the DA said.",
      "A man was found fatally stabbed in Fitchburg Tuesday morning, and a man was later arrested in connection with his killing, prosecutors announced.",
      "At around 5:30 a."
    ]
  },
  {
    "title": "Somerville has a new cat mayor: Meet Minerva",
    "url": "https://www.boston.com/news/local-news/2025/09/16/somerville-has-a-new-cat-mayor-meet-minerva/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-09-16T23:13:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/5WF4HXN4XEDD62EX7IH7UVOU7I-68c84bde77960-768x432.jpg",
    "bullets": [
      "Local News Minerva, a black cat whose slogan was simply — and sinisterly — “CRIME,” was selected as mayor after an election process that captivated Somerville.",
      "Signs along the bike path in the race for \"bike path mayor.",
      "\" Suzanne Kreiter/The Boston Globe By Sana Muneer September 16, 2025 | 7:13 PM 1 minute to read A feisty feline was elected Somerville’s new “bike path mayor” Tuesday, reigning over more than a dozen cats and even two dogs."
    ]
  },
  {
    "title": "North Shore bar offering reward after someone broke in, ransacked it",
    "url": "https://www.boston.com/news/local-news/2025/09/16/north-shore-bar-offering-reward-after-someone-broke-in-ransacked-it/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-09-16T21:22:55.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Local News The Rhumb Line Bar & Restaurant in Gloucester was “trashed” and stolen from early Sunday morning, owner Frank Shrigley said.",
      "By Sana Muneer September 16, 2025 | 5:22 PM 1 minute to read A popular Gloucester bar was ransacked over the weekend, prompting an $1,000 reward offer for information leading to an arrest, according to the owner’s Facebook post Sunday.",
      "The Rhumb Line Bar & Restaurant was “trashed” and stolen from early Sunday morning between 2:30 a."
    ]
  },
  {
    "title": "Tom Brady, Rob Gronkowski set to play flag football tournament in Saudi Arabia",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/09/16/tom-brady-rob-gronkowski-flag-football-saudia-arabia-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-09-16T20:49:53.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/QARXLVZ4PWSISAE6H3ANLSHO54-68c9ca82123c7-768x432.jpeg",
    "bullets": [
      "New England Patriots Brady and Gronkowski are two big names among a list of current and former players set to compete.",
      "Tom Brady Barry Chin/The Boston Globe Tom Brady is ready to compete in another football game.",
      "The Patriots legend is set to join longtime teammate Rob Gronkowski and a host of current NFL stars in the Fanatics Flag Football Classic next year in Saudi Arabia."
    ]
  },
  {
    "title": "Block of Harvard Square will be permanently closed to traffic, European-style",
    "url": "https://www.boston.com/news/local-news/2025/09/16/block-of-harvard-square-will-be-permanently-closed-to-traffic-european-style-in-the-spring/",
    "author": "Madison Lucchesi",
    "section": "News",
    "published": "2025-09-16T20:14:17.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/VELSVKDFRP4T7HC3YY2OLYYUR4-6821b0ac83815-768x432.jpg",
    "bullets": [
      "Local News Lower Bow Street will be closed to traffic to create outdoor patio space for restaurants.",
      "Pedestrians walk along Massachusetts Avenue in Harvard Square.",
      "Suzanne Kreiter/Globe Staff The Cambridge City Council passed a motion to close a block in Harvard Square traffic to allow for outdoor dining spaces on Monday."
    ]
  },
  {
    "title": "N.H. police investigating crash that ‘launched’ box truck into cluster of trees",
    "url": "https://www.boston.com/news/local-news/2025/09/16/new-hampshire-police-investigating-crash-launched-box-truck-trees/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-16T19:57:18.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/547561565_1198975832273361_8661819311782697375_n-68c9bdb423f0a-768x432.jpg",
    "bullets": [
      "Local News The driver was heading north on I-93 Saturday “when, for reasons that remain under investigation, he failed to negotiate a curve in the roadway,” officials said.",
      "A Brockton man was injured Saturday morning when the truck he was driving crashed on Interstate 93 north in New Hampshire.",
      "New Hampshire State Police By Abby Patkin September 16, 2025 | 3:57 PM 1 minute to read A Brockton man was injured Saturday morning when the box truck he was driving veered off Interstate 93 in New Hampshire and “launched” into a cluster of trees, according to officials."
    ]
  },
  {
    "title": "Milford community reels after ICE temporarily detains local teen",
    "url": "https://www.boston.com/news/local-news/2025/09/16/milford-community-reels-after-ice-temporarily-detains-local-teen/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-16T19:52:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/4TO4DG7EMI643BOJBLQB26D5N4-68c9b7d11ee69-768x432.jpg",
    "bullets": [
      "Local News The teen’s family is still waiting for a decision on their asylum case.",
      "Protesters rally against ICE enforcement actions after a 16 year-old was detained on Friday in Milford.",
      "Jessica Rinaldi / The Boston Globe ShareSend this article to your social connections."
    ]
  }
]