[
  {
    "title": "North Shore bar offering reward after someone broke in, ransacked it",
    "url": "https://www.boston.com/news/local-news/2025/09/16/north-shore-bar-offering-reward-after-someone-broke-in-ransacked-it/",
    "author": "Sana Muneer",
    "section": "News",
    "published": "2025-09-16T21:22:55.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Local News The Rhumb Line Bar & Restaurant in Gloucester was “trashed” and stolen from early Sunday morning, owner Frank Shrigley said.",
      "By Sana Muneer September 16, 2025 | 5:22 PM 1 minute to read A popular Gloucester bar was ransacked over the weekend, prompting an $1,000 reward offer for information leading to an arrest, according to the owner’s Facebook post Sunday.",
      "The Rhumb Line Bar & Restaurant was “trashed” and stolen from early Sunday morning between 2:30 a."
    ]
  },
  {
    "title": "Tom Brady, Rob Gronkowski set to play flag football tournament in Saudi Arabia",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/09/16/tom-brady-rob-gronkowski-flag-football-saudia-arabia-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2025-09-16T20:49:53.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/QARXLVZ4PWSISAE6H3ANLSHO54-68c9ca82123c7-768x432.jpeg",
    "bullets": [
      "New England Patriots Brady and Gronkowski are two big names among a list of current and former players set to compete.",
      "Tom Brady Barry Chin/The Boston Globe Tom Brady is ready to compete in another football game.",
      "The Patriots legend is set to join longtime teammate Rob Gronkowski and a host of current NFL stars in the Fanatics Flag Football Classic next year in Saudi Arabia."
    ]
  },
  {
    "title": "Block of Harvard Square will be permanently closed to traffic, European-style",
    "url": "https://www.boston.com/news/local-news/2025/09/16/block-of-harvard-square-will-be-permanently-closed-to-traffic-european-style-in-the-spring/",
    "author": "Madison Lucchesi",
    "section": "News",
    "published": "2025-09-16T20:14:17.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/VELSVKDFRP4T7HC3YY2OLYYUR4-6821b0ac83815-768x432.jpg",
    "bullets": [
      "Local News Lower Bow Street will be closed to traffic to create outdoor patio space for restaurants.",
      "Pedestrians walk along Massachusetts Avenue in Harvard Square.",
      "Suzanne Kreiter/Globe Staff The Cambridge City Council passed a motion to close a block in Harvard Square traffic to allow for outdoor dining spaces on Monday."
    ]
  },
  {
    "title": "N.H. police investigating crash that ‘launched’ box truck into cluster of trees",
    "url": "https://www.boston.com/news/local-news/2025/09/16/new-hampshire-police-investigating-crash-launched-box-truck-trees/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-16T19:57:18.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/547561565_1198975832273361_8661819311782697375_n-68c9bdb423f0a-768x432.jpg",
    "bullets": [
      "Local News The driver was heading north on I-93 Saturday “when, for reasons that remain under investigation, he failed to negotiate a curve in the roadway,” officials said.",
      "A Brockton man was injured Saturday morning when the truck he was driving crashed on Interstate 93 north in New Hampshire.",
      "New Hampshire State Police By Abby Patkin September 16, 2025 | 3:57 PM 1 minute to read A Brockton man was injured Saturday morning when the box truck he was driving veered off Interstate 93 in New Hampshire and “launched” into a cluster of trees, according to officials."
    ]
  },
  {
    "title": "Milford community reels after ICE temporarily detains local teen",
    "url": "https://www.boston.com/news/local-news/2025/09/16/milford-community-reels-after-ice-temporarily-detains-local-teen/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2025-09-16T19:52:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/4TO4DG7EMI643BOJBLQB26D5N4-68c9b7d11ee69-768x432.jpg",
    "bullets": [
      "Local News The teen’s family is still waiting for a decision on their asylum case.",
      "Protesters rally against ICE enforcement actions after a 16 year-old was detained on Friday in Milford.",
      "Jessica Rinaldi / The Boston Globe ShareSend this article to your social connections."
    ]
  },
  {
    "title": "Hoping to join Wu on ballot, third-place mayoral candidate pursues recount",
    "url": "https://www.boston.com/news/politics/2025/09/16/hoping-to-join-wu-on-ballot-third-place-mayoral-candidate-pursues-recount/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2025-09-16T19:35:13.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_Boston-Mayoral-Forum-577A-68c9af715b3f9-768x432.jpg",
    "bullets": [
      "Politics Domingos DaRosa said he was hoping recounts would turn up enough votes to place him on the ballot in the wake of Josh Kraft's exit from the mayoral race.",
      "Domingos DaRosa during a mayoral forum in May.",
      "Mark Stockwell / The Boston Globe Domingos DaRosa, the community activist and Boston mayoral candidate who finished a distant third in last week’s preliminary election, is seeking a recount in order to have his name placed on the general election ballot in November."
    ]
  },
  {
    "title": "Norfolk County sheriff spent campaign cash on personal business ventures, state officials say",
    "url": "https://www.boston.com/news/politics/2025/09/16/norfolk-county-sheriff-misused-campaign-cash-state-officials-say/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2025-09-16T19:10:32.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/P6VRFE4R57P72UJK3M5FTPAKPE-68c88bbe30811-768x432.jpg",
    "bullets": [
      "Politics Sheriff Patrick McDermott has agreed to pay tens of thousands of dollars to resolve the allegations.",
      "Norfolk County Sheriff Patrick McDermott spent $31,705 out of his campaign to bolster his “personal business future,\" state campaign finance regulators said.",
      "Stuart Cahill/Boston Herald, Pool By Abby Patkin September 16, 2025 | 3:10 PM 2 minutes to read Norfolk County Sheriff Patrick McDermott has agreed to pay a hefty civil forfeiture after state regulators determined he unlawfully spent tens of thousands of dollars in campaign funds to further his “personal business future."
    ]
  },
  {
    "title": "Revolution sporting director Curt Onalfo explained the decision to fire Caleb Porter",
    "url": "https://www.boston.com/sports/new-england-revolution/2025/09/16/curt-onalfo-caleb-porter/",
    "author": "Hayden Bird",
    "section": "Sports",
    "published": "2025-09-16T18:48:57.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/07/Porter-Onalfo-Revs-1-688a602ca574b-768x432.jpg",
    "bullets": [
      "New England Revolution Onalfo also provided an answer when asked why he should keep his job following Porter's dismissal.",
      "Caleb Porter (left) and Curt Onalfo (right) at Porter's introductory press conference in Jan.",
      "2024."
    ]
  },
  {
    "title": "Rob Gronkowski talks new Boston playground, slowing the partying",
    "url": "https://www.boston.com/sports/celebs/2025/09/16/rob-gronkowski-new-york-mag/",
    "author": "Aidan Buchanan",
    "section": "Sports",
    "published": "2025-09-16T18:40:36.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_davisgronk3spts-68c9a94a9553f-768x432.jpg",
    "bullets": [
      "Celebs \"I’m a big kid at heart.",
      "I relate to kids, they relate to me.",
      "\" Gronkowski before a game against the Miami Dolphins in 2018 (Jim Davis) Rob Gronkowski is one of Boston’s most beloved athletes in recent times, following his three Super Bowl wins with the Patriots."
    ]
  },
  {
    "title": "These Boston restaurants should have been on NYT best of lists, according to readers",
    "url": "https://www.boston.com/food/readers-say/2025/09/16/boston-restaurants-nyt-best-lists/",
    "author": "Katelyn Umholtz",
    "section": "Food",
    "published": "2025-09-16T18:06:55.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/09/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_06WSH-02-68c98d68ddcc1-768x432.jpg",
    "bullets": [
      "Readers Say From neighborhood staples to hidden gems, here’s what readers thought The New York Times missed.",
      "Crispy duck wings with fresh fig, salt roasted beets, purple kraut, shaved fennel and harissa at Urban Hearth in Cambridge.",
      "Josh Reynolds for The Boston Globe ShareSend this article to your social connections."
    ]
  }
]