[
  {
    "title": "Magic pull away, beat Celtics despite another big Jaylen Brown game: 8 takeaways",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/07/celtics-magic-jaylen-brown-takeaways/",
    "author": "Tom Westerholm",
    "section": "Sports",
    "published": "2025-11-08T04:02:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/7MCXKLIZXPQQ6FMHON33UAQCVQ-690ebe91a7209-768x432.jpg",
    "bullets": [
      "The Boston Celtics lost to the Orlando Magic 123-110, marking their first NBA Cup defeat despite Jaylen Brown's 32-point performance.",
      "Jaylen Brown excelled with 32 points, but struggled from three-point range, contributing 1-for-6 in long-range shooting.",
      "The Celtics struggled defensively, conceding 38 and 39 points in the first and fourth quarters, respectively."
    ]
  },
  {
    "title": "Public reprimand recommended for judge accused of helping immigrant escape ICE",
    "url": "https://www.boston.com/news/local-news/2025/11/07/public-reprimand-recommended-for-judge-accused-of-helping-immigrant-escape-ice/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-08T02:54:29.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Judge Shelley Joseph faces a public reprimand for creating an 'appearance of impropriety' in a 2018 ICE incident.",
      "The Massachusetts Commission on Judicial Conduct found insufficient evidence that Joseph authorized a defendant's escape from ICE.",
      "Federal charges against Judge Joseph were dropped in 2022; she agreed to state agency investigation instead."
    ]
  },
  {
    "title": "Alex Cora still high on Red Sox’ future a month after being eliminated by Yankees",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/alex-cora-red-sox-future/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-08T02:40:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/GI4FEZRTXITRY6KNABMHPYJWWI-690ea1593e6d5-768x432.jpg",
    "bullets": [
      "Red Sox manager Alex Cora remains optimistic about the team's future despite playoff elimination by the Yankees.",
      "Trevor Story opted into his contract with Boston, while Alex Bregman chose to opt out.",
      "Injuries and trades impacted the Red Sox 2025 season, with rookie Roman Anthony showing promise before his injury."
    ]
  },
  {
    "title": "Giant blade breaks off Mass. wind turbine",
    "url": "https://www.boston.com/uncategorized/local-news/2025/11/07/giant-blade-breaks-off-mass-wind-turbine/",
    "author": "Morgan Rousseau",
    "section": "Uncategorized",
    "published": "2025-11-08T01:26:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "A wind turbine blade detached in Plymouth, Mass., and fell into a cranberry bog on Friday with no injuries reported.",
      "Firefighters found the 75-to-100-foot blade several hundred feet from the turbine near 810 Head of the Bay Road.",
      "The turbine entered 'fail-safe mode' upon the blade's detachment; the area was secured and remains under investigation."
    ]
  },
  {
    "title": "5 must-watch movies &#038; TV shows streaming right now",
    "url": "https://www.boston.com/culture/streaming/2025/11/07/5-must-watch-movies-tv-shows-streaming-right-now-november-7-2025/",
    "author": "Kevin Slane",
    "section": "Culture",
    "published": "2025-11-08T01:01:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/06/materialists-review-684c76aeb5c14-768x432.jpg",
    "bullets": [
      "'The Fantastic Four: First Steps' streams on Disney+, introducing a new film in the Marvel Cinematic Universe.",
      "'Frankenstein' by Guillermo del Toro, a reinterpretation of Mary Shelley's novel, is available on Netflix.",
      "'Materialists' featuring Dakota Johnson and Pedro Pascal, streams on HBO Max as a romcom satire."
    ]
  },
  {
    "title": "Stefon Diggs reveals what he’s trying to improve about himself after 11 years in the NFL",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/07/stefon-diggs-patriots-attitude/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-07T23:56:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/P5M3VBXS54IFLKKYQNH27GTVNA-690e77f421be6-768x432.jpg",
    "bullets": [
      "Stefon Diggs aims to improve his attitude towards perfectionism in his 11th NFL season with the Patriots.",
      "Diggs leads the Patriots in receiving with 508 yards, 45 receptions, and 25 first down catches through nine games.",
      "Diggs credits coaches Josh McDaniels and Todd Downing for creating a balanced, growth-oriented offensive environment."
    ]
  },
  {
    "title": "Commuter train plows through car on tracks in Acton",
    "url": "https://www.boston.com/news/local-news/2025/11/07/commuter-train-plows-through-car-on-tracks-in-acton/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-07T23:16:56.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/KJDIQ5UUZ5FE7MJNIODAKALTYI-690d6322ea85e-768x432.jpg",
    "bullets": [
      "An MBTA commuter train hit an empty car on tracks in Acton, pushing it 300 feet, no injuries reported.",
      "The car's driver reportedly bypassed closed crossing gates before exiting, and will receive a citation from authorities.",
      "The collision caused delays on the Fitchburg line, affecting commuter train operations in the area."
    ]
  },
  {
    "title": "What to know about possible Red Sox free agent target Munetaka Murakami after posting",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/munetaka-murakami-red-sox-mlb-free-agency-rumors/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-11-07T21:40:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/DVDHDUJ633XTHRJXKVRJR2N2UY-690e632d77a32-768x432.jpg",
    "bullets": [
      "Japanese baseball star Munetaka Murakami has been posted by the Tokyo Yakult Swallows, giving him until December 22 to sign with an MLB team.",
      "Murakami, known for his power hitting, broke Japan's single-season home run record in 2022 with 56 homers, earning comparisons to Babe Ruth.",
      "Potential MLB suitors for Murakami include the Red Sox, Giants, Dodgers, Yankees, Mets, Phillies, and Mariners, with a possible eight-year deal suggested."
    ]
  },
  {
    "title": "Airlines are waiving fees, offering refunds due to reduced flight schedules",
    "url": "https://www.boston.com/travel/flights/2025/11/07/airlines-are-waiving-fees-offerings-refunds-due-to-reduced-flight-schedules/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-11-07T21:10:31.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/01/DPYQ67JGZN7634F3EEUM2AOS3M-679b06305f72a-768x432.jpg",
    "bullets": [
      "Airlines are waiving fees and offering refunds after FAA reduced flights by 10% at 40 airports due to a government shutdown.",
      "JetBlue, Southwest, United, American, Delta, and Spirit are allowing travelers to rebook or cancel for refunds amid flight schedule reductions.",
      "Logan Airport travelers face delays; Massport advises checking with airlines for updated travel schedules and cancellations."
    ]
  },
  {
    "title": "After Cape Cod crash, readers say Mass. should tighten e-bike regulations",
    "url": "https://www.boston.com/community/readers-say/2025/11/07/massachusetts-should-tighten-ebike-regulations/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-07T20:50:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/6L3T6GPLTKEVUWZ5WJKMGRBWY4-690e57abc1ccd-768x432.jpg",
    "bullets": [
      "A Cape Cod crash has sparked debate on whether Massachusetts should tighten regulations on electric bicycles.",
      "After the crash, 78% of 580 surveyed readers support stricter e-bike regulations for improved safety on trails.",
      "Current Massachusetts law allows Class 1 and 2 e-bikes on most roads without requiring licenses or registrations."
    ]
  }
]