[
  {
    "title": "10 Patriots takeaways from Super Bowl Opening Night",
    "url": "https://www.boston.com/sports/new-england-patriots/2026/02/03/new-england-patriots-nfl-football-super-bowl-lx-opening-night-media-day/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2026-02-03T11:22:46.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Super_Bowl_Football_94155-6981a1b49c7f4-768x432.jpg",
    "bullets": [
      "Patriots' Drake Maye confirms recovery, plans normal practice; vows Super Bowl readiness despite shoulder injury concerns.",
      "Players credit Patriots head coach Mike Vrabel for team success, highlighting his influence and leadership in their Super Bowl journey.",
      "Patriots embrace underdog status against Seahawks, use outsider narrative as motivation for upcoming Super Bowl matchup."
    ]
  },
  {
    "title": "Newton woman facing assault, kidnapping, other charges around alleged unlicensed cosmetic surgery in Allston",
    "url": "https://www.boston.com/news/local-news/2026/02/02/newton-woman-facing-charges-around-alleged-unlicensed-cosmetic-surgery-in-allston/",
    "author": "Carson Lyle",
    "section": "News",
    "published": "2026-02-03T04:31:07.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Dingrui Wang, 34, is charged with assault, kidnapping, and unlicensed medical practice after performing cosmetic surgery in Allston.",
      "The victim allegedly endured permanent scarring and extreme pain from a botched surgery in Wang's apartment, prosecutors report.",
      "Wang is accused of fraudulent practices, including false doctor impersonation and misrepresenting licenses to obtain loans."
    ]
  },
  {
    "title": "Car rammed by train in Abington after breaking down on tracks",
    "url": "https://www.boston.com/uncategorized/local-news/2026/02/02/car-rammed-by-train-in-abington-after-breaking-down-on-tracks/",
    "author": "Carson Lyle",
    "section": "Uncategorized",
    "published": "2026-02-03T02:48:50.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Screenshot-2026-02-02-at-9.29.46-PM-69815e67aa057-768x432.png",
    "bullets": [
      "A 2007 Honda broke down on train tracks in Abington and was struck by an MBTA train.",
      "The incident occurred around 8 p.m. near Plymouth St., after the driver exited the car.",
      "No injuries or casualties were reported in the collision, according to Transit Police."
    ]
  },
  {
    "title": "Woman, 57, walking in road due to snow hit and killed by car on Route 28 in Wareham, DA says",
    "url": "https://www.boston.com/news/local-news/2026/02/02/woman-57-walking-in-road-due-to-snow-hit-and-killed-by-car-on-route-28-in-wareham-da-says/",
    "author": "Carson Lyle",
    "section": "News",
    "published": "2026-02-03T02:36:12.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/01/EYX5EI6ZNFADBVKXBC24Y3PWYU-6965a3dc3fce0-scaled.jpg",
    "bullets": [
      "A 57-year-old woman died after being hit by a Volvo while walking along Route 28 in Wareham.",
      "The woman and another pedestrian were walking in the road due to snow-covered sidewalks, according to the DA's office.",
      "The Volvo's driver remained at the scene and was not speeding or distracted, as stated by the district attorney."
    ]
  },
  {
    "title": "Former North Shore police officer gets prison time for child porn charge",
    "url": "https://www.boston.com/news/local-news/2026/02/02/former-north-shore-police-officer-gets-prison-time-for-child-porn-charge/",
    "author": "Carson Lyle",
    "section": "News",
    "published": "2026-02-03T00:00:49.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/02/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2019_06_04_BostonGlobe.com_Regional_Images_PlusNoConsent-698134fc15067-scaled.jpeg",
    "bullets": [
      "Former Gloucester police officer Alexander Aiello sentenced to 4 years in prison for child pornography charge.",
      "Aiello pled guilty in October 2025 after hundreds of illegal files were found on an encrypted thumb drive.",
      "Aiello was identified as a registered user of a website for accessing and distributing child pornography, prosecutors stated."
    ]
  },
  {
    "title": "‘The finest kind’: Gloucester mourns 7 lost in Lily Jean sinking as Coast Guard launches probe",
    "url": "https://www.boston.com/news/local-news/2026/02/02/gloucester-mourns-7-lost-lily-jean-fishing-boat-sinking/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-02T23:42:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Missing_Fishing_Boat_63204-69812fc539f25-768x432.jpg",
    "bullets": [
      "Seven people are presumed dead after the Gloucester-based fishing boat Lily Jean sank off Cape Ann.",
      "The U.S. Coast Guard will investigate the sinking with the National Transportation Safety Board, which may take months.",
      "State Sen. Bruce Tarr and Gloucester officials mourned the crew, who were commemorated as the 'finest kind.'"
    ]
  },
  {
    "title": "Why readers think Bill Belichick belonged in the Hall of Fame this year",
    "url": "https://www.boston.com/community/readers-say/2026/02/02/bill-belichick-hall-of-fame-snub/",
    "author": "Autumn Sloboda",
    "section": "Community",
    "published": "2026-02-02T22:18:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/Hall_of_Fame_Belichick_Football_99557-697d254fc549c-768x432.jpg",
    "bullets": [
      "Bill Belichick, with eight Super Bowl titles, did not achieve first-ballot induction into the Pro Football Hall of Fame 2026.",
      "93% of over 450 Boston.com readers felt Belichick deserved Hall of Fame induction, citing his extensive coaching success.",
      "Some readers cite Patriots-era scandals and Tom Brady's influence as factors against Belichick's first-ballot Hall of Fame induction."
    ]
  },
  {
    "title": "Which Patriots Super Bowl will you never forget?",
    "url": "https://www.boston.com/community/tell-us/2026/02/02/favorite-patriots-super-bowl-memories/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-02T21:29:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/f9708efe-9eb0-11e4-a89d-8b893f51b3d0-69810151c882d-768x432.jpg",
    "bullets": [
      "The New England Patriots prepare for their 12th Super Bowl appearance, recalling iconic moments like Adam Vinatieri's game-winning 2002 kick.",
      "Patriots fans remember key plays such as Malcolm Butler's interception against Seattle and the historic comeback versus the Falcons.",
      "Boston.com invites fans to share their most unforgettable Patriots Super Bowl memories, both on-field and personal traditions."
    ]
  },
  {
    "title": "This runner is raising awareness about stroke and heart disease",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/02/liz-lang-tedys-team/",
    "author": "Kelly Chan",
    "section": "Community",
    "published": "2026-02-02T21:00:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/liz-lang-tease-6981100119108-768x432.jpg",
    "bullets": [
      "Liz Lang from Jackson, NJ is running the Boston Marathon to raise awareness about stroke and heart disease.",
      "Lang was diagnosed with a heart arrhythmia in 2006 and antiphospholipid syndrome in 2025, prompting lifestyle changes.",
      "She is fundraising for Tedy's Team, supporting research and outreach on stroke and heart disease prevention."
    ]
  },
  {
    "title": "Once a patient, now a runner: She’s running for Boston Children’s Hospital",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/02/molly-kokoski-boston-childrens-hospital/",
    "author": "Kelly Chan",
    "section": "Community",
    "published": "2026-02-02T20:49:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/IMG_8745-69792a9fba2b3-768x432.jpeg",
    "bullets": [
      "Molly Kokoski, 26, is running the 130th Boston Marathon to support Boston Children's Hospital.",
      "Diagnosed with ulcerative colitis, Kokoski required an ostomy bag in 2021 and is running despite challenges.",
      "Kokoski aims to inspire others with ostomy bags by demonstrating it doesn't limit achieving goals."
    ]
  }
]