[
  {
    "title": "Magic pull away, beat Celtics despite another big Jaylen Brown game: 8 takeaways",
    "url": "https://www.boston.com/sports/boston-celtics/2025/11/07/celtics-magic-jaylen-brown-takeaways/",
    "author": "Tom Westerholm",
    "section": "Sports",
    "published": "2025-11-08T04:02:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/7MCXKLIZXPQQ6FMHON33UAQCVQ-690ebe91a7209-768x432.jpg",
    "bullets": [
      "The Boston Celtics lost 123-110 to the Orlando Magic, suffering their first defeat in the NBA Cup.",
      "Jaylen Brown led the Celtics with 32 points, shooting 15-for-28, but struggled from three-point range with 1-for-6.",
      "Orlando's Franz Wagner scored 27 points and Desmond Bane added 22 points, contributing to the Magic's 17 successful threes."
    ]
  },
  {
    "title": "Public reprimand recommended for judge accused of helping immigrant escape ICE",
    "url": "https://www.boston.com/news/local-news/2025/11/07/public-reprimand-recommended-for-judge-accused-of-helping-immigrant-escape-ice/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-08T02:54:29.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Judge Shelley Joseph faced a public reprimand recommendation despite being cleared of misconduct in a 2018 ICE evasion incident.",
      "A state hearing officer found no evidence Joseph authorized the defendant's escape but noted an appearance of impropriety.",
      "Federal charges against Joseph were dropped in 2022; she referred herself to a state misconduct investigation afterward."
    ]
  },
  {
    "title": "Alex Cora still high on Red Sox’ future a month after being eliminated by Yankees",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/alex-cora-red-sox-future/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-08T02:40:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/GI4FEZRTXITRY6KNABMHPYJWWI-690ea1593e6d5-768x432.jpg",
    "bullets": [
      "Alex Cora remains optimistic about Red Sox's future despite early playoff exit against Yankees in Wild Card Series.",
      "Contracts and trades make Boston's offseason uncertain: Trevor Story stays, Alex Bregman opts out, Giolito not offered renewal.",
      "Rookie Roman Anthony's promising performance keys potential future success, despite injuries and notable Rafael Devers' trade."
    ]
  },
  {
    "title": "Giant blade breaks off Mass. wind turbine",
    "url": "https://www.boston.com/uncategorized/local-news/2025/11/07/giant-blade-breaks-off-mass-wind-turbine/",
    "author": "Morgan Rousseau",
    "section": "Uncategorized",
    "published": "2025-11-08T01:26:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "A wind turbine blade measuring 75 to 100 feet fell into a cranberry bog in Plymouth, Massachusetts.",
      "No injuries occurred, and the turbine located at 810 Head of the Bay Road entered fail-safe mode.",
      "Police and MassDEP are investigating, ensuring the area is safe and the site is cleaned up appropriately."
    ]
  },
  {
    "title": "5 must-watch movies &#038; TV shows streaming right now",
    "url": "https://www.boston.com/culture/streaming/2025/11/07/5-must-watch-movies-tv-shows-streaming-right-now-november-7-2025/",
    "author": "Kevin Slane",
    "section": "Culture",
    "published": "2025-11-08T01:01:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/06/materialists-review-684c76aeb5c14-768x432.jpg",
    "bullets": [
      "'The Fantastic Four: First Steps' is streaming on Disney+, offering a new take on Marvel's superhero family.",
      "Guillermo del Toro's 'Frankenstein' is now available on Netflix, presenting a unique vision of Mary Shelley's novel.",
      "'Death by Lightning,' a limited series about President James A. Garfield, is streaming on Netflix."
    ]
  },
  {
    "title": "Stefon Diggs reveals what he’s trying to improve about himself after 11 years in the NFL",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/07/stefon-diggs-patriots-attitude/",
    "author": "Kaley Brown",
    "section": "Sports",
    "published": "2025-11-07T23:56:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/P5M3VBXS54IFLKKYQNH27GTVNA-690e77f421be6-768x432.jpg",
    "bullets": [
      "Stefon Diggs leads the Patriots in receiving yards and yards per game with 508 and 56.4, respectively.",
      "Diggs aims to improve his attitude, stating his perfectionism can lead to frustration despite its competitive edge.",
      "Patriots' offensive improvement attributed to contributions from coaches Josh McDaniels and Todd Downing, per Diggs."
    ]
  },
  {
    "title": "Commuter train plows through car on tracks in Acton",
    "url": "https://www.boston.com/news/local-news/2025/11/07/commuter-train-plows-through-car-on-tracks-in-acton/",
    "author": "Morgan Rousseau",
    "section": "News",
    "published": "2025-11-07T23:16:56.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/KJDIQ5UUZ5FE7MJNIODAKALTYI-690d6322ea85e-768x432.jpg",
    "bullets": [
      "An MBTA commuter train collided with an empty car at Central Street crossing in Acton Thursday night, no injuries reported.",
      "Driver exited the car before collision; vehicle was pushed 300 feet, warning systems were working properly, according to officials.",
      "Commuters faced delays on the Fitchburg line; driver will be cited for driving around closed crossing gates."
    ]
  },
  {
    "title": "What to know about possible Red Sox free agent target Munetaka Murakami after posting",
    "url": "https://www.boston.com/sports/boston-red-sox/2025/11/07/munetaka-murakami-red-sox-mlb-free-agency-rumors/",
    "author": "Conor Roche",
    "section": "Sports",
    "published": "2025-11-07T21:40:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/DVDHDUJ633XTHRJXKVRJR2N2UY-690e632d77a32-768x432.jpg",
    "bullets": [
      "The Boston Red Sox are potential suitors for Japanese star Munetaka Murakami, who has been posted by Nippon Professional Baseball.",
      "Murakami, dubbed the 'Japanese Babe Ruth' for his power hitting, broke NPB's home run record with 56 homers in 2022.",
      "He faces high strikeout rates, and his potential signing includes a posting fee; MLB teams have until December 22 to sign him."
    ]
  },
  {
    "title": "Airlines are waiving fees, offering refunds due to reduced flight schedules",
    "url": "https://www.boston.com/travel/flights/2025/11/07/airlines-are-waiving-fees-offerings-refunds-due-to-reduced-flight-schedules/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2025-11-07T21:10:31.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/01/DPYQ67JGZN7634F3EEUM2AOS3M-679b06305f72a-768x432.jpg",
    "bullets": [
      "FAA reduces flights by 10% at 40 airports, including Logan, due to government shutdown.",
      "Airlines like JetBlue, United, and Delta waive fees and offer refunds for affected passengers.",
      "Massport warns travelers of potential delays and cancellations, advises checking with airlines before traveling."
    ]
  },
  {
    "title": "After Cape Cod crash, readers say Mass. should tighten e-bike regulations",
    "url": "https://www.boston.com/community/readers-say/2025/11/07/massachusetts-should-tighten-ebike-regulations/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-07T20:50:41.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/6L3T6GPLTKEVUWZ5WJKMGRBWY4-690e57abc1ccd-768x432.jpg",
    "bullets": [
      "A Cape Cod crash involving an e-bike prompted calls for stricter regulations in Massachusetts from 78% of surveyed readers.",
      "Massachusetts defines e-bikes in two classes but has no specific regulations for faster Class 3 e-bikes.",
      "Some readers argue current e-bike regulations suffice, emphasizing infrastructure improvements for road safety over increased regulation."
    ]
  }
]