[
  {
    "title": "Readers push back on ChatGPT use in Massachusetts executive branch",
    "url": "https://www.boston.com/community/readers-say/2026/02/26/readers-oppose-massachusetts-ai/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-26T21:52:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_ryaniced4met-69a0b1cbb4ba4-768x432.jpg",
    "bullets": [
      "Governor Maura Healey announced Massachusetts will use ChatGPT for executive branch employees, sparking public criticism.",
      "65% of readers oppose the decision, citing security, privacy, and environmental concerns regarding AI implementation.",
      "Massachusetts will offer free Google AI training to residents, aiming to maintain the state's leadership in AI innovation."
    ]
  },
  {
    "title": "What a traveling nurse experienced on the hard-hit Cape after Monday&#8217;s blizzard",
    "url": "https://www.boston.com/news/local-news/2026/02/26/what-a-traveling-nurse-experienced-on-the-hard-hit-cape-after-mondays-blizzard/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-26T20:57:39.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_ryannicedaymet-69a099e0f08d0-768x432.jpg",
    "bullets": [
      "Traveling nurse Colleen Wright navigated unplowed roads and snowdrifts across Cape Cod to assist residents after Monday's historic blizzard.",
      "Nearly 160,000 Cape Cod residents lost power initially; as of Thursday, less than 50,000 remained without electricity, Eversource reports.",
      "Four shelters in Provincetown, Harwich, Mashpee, and Barnstable currently host 200 people, mostly elderly, due to ongoing power outages."
    ]
  },
  {
    "title": "City Council rejects effort to ask Wu administration for info on ICE detainer requests",
    "url": "https://www.boston.com/news/local-news/2026/02/26/city-council-rejects-effort-to-ask-wu-administration-for-info-on-ice-detainer-requests/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-26T20:29:02.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_Wiggs-_CityHall_11-697cd86b716f2-768x432.jpg",
    "bullets": [
      "Boston City Council rejected Councilor Ed Flynn's request for details on ICE detainer requests sent to the city.",
      "Flynn’s rejected proposal aimed to gather data on detainers received by Boston since 2024, and related criminal cases.",
      "The Trust Act prohibits Boston Police from holding individuals solely based on ICE detainer requests, ignoring 57 in 2025."
    ]
  },
  {
    "title": "Here’s why Boston streets seem clearer than after the last big storm",
    "url": "https://www.boston.com/news/local-news/2026/02/26/boston-snow-removal-blizzard/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-26T20:19:35.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Boston-plow-69a0a7bc6cd6c-768x432.jpg",
    "bullets": [
      "Boston extended its parking ban to improve snow removal efforts after recent blizzards, aiding in clearing streets effectively.",
      "The city removed 200 truckloads of snow by extending snow removal activities into daytime hours, addressing previous snow cleanup complaints.",
      "Mayor Michelle Wu is exploring additional penalties for property owners neglecting sidewalk snow removal, targeting key pedestrian areas."
    ]
  },
  {
    "title": "This Mass. bride and groom skied Killington fresh off their vows and in wedding attire",
    "url": "https://www.boston.com/travel/new-england-travel/2026/02/26/mass-bride-and-groom-skied-killington-in-wedding-attire/",
    "author": "Kristi Palma",
    "section": "Travel",
    "published": "2026-02-26T19:53:51.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/annemientka_-6-69a08c909a258-768x432.jpg",
    "bullets": [
      "Evan Stark and Kristyn Brophy Stark skied Killington in wedding attire after getting married at the Killington Grand Hotel.",
      "The Roxbury couple planned their February wedding around a ski run, celebrating post-vows in cold temperatures down to -4 degrees.",
      "Photographer Anne Mientka captured the couple's ski run, assisted by a bridesmaid who was a ski instructor at Killington."
    ]
  },
  {
    "title": "Report: Anfernee Simons played with wrist fracture during time with Celtics",
    "url": "https://www.boston.com/sports/boston-celtics/2026/02/26/anfernee-simons-celtics-bulls-wrist-injury-comments/",
    "author": "Khari A. Thompson",
    "section": "Sports",
    "published": "2026-02-26T19:32:57.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/CSMPFIB3FP3VR2APHTPZXS4ZHU-69a09a43c0d11-768x432.webp",
    "bullets": [
      "Anfernee Simons played 49 games for the Celtics with a fractured wrist suffered during training camp.",
      "Simons was traded to the Bulls for Nikola Vucevic and has missed their last two games due to the injury.",
      "Simons is set to miss the Bulls' third consecutive game against Portland due to the wrist injury."
    ]
  },
  {
    "title": "MBTA Commuter Rail experiences more delays due to snow cleanup and vehicle on track",
    "url": "https://www.boston.com/travel/transportation/2026/02/26/mbta-commuter-rail-experiences-more-delays-due-to-snow-cleanup-and-vehicle-on-track/",
    "author": "Samantha Genzer",
    "section": "Travel",
    "published": "2026-02-26T19:10:27.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/IMG_0968-69a08ed68b73c-768x432.jpeg",
    "bullets": [
      "MBTA Commuter Rail faces delays due to snow cleanup efforts on multiple lines including Fairmount, Haverhill, and Lowell.",
      "Keolis Commuter Services reported delays on the Worcester line due to a vehicle on the tracks, now resolved.",
      "Crews work to clear nearly three feet of snow affecting operation and infrastructure on the Commuter Rail network."
    ]
  },
  {
    "title": "All Mass. residents to get free access to Google AI training classes, Healey says",
    "url": "https://www.boston.com/news/local-news/2026/02/26/all-mass-residents-to-get-free-access-to-google-ai-training-classes-healey-says/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-26T18:38:15.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_Wiggs-_OGoogle_4-69a08cd26d2b9-768x432.jpg",
    "bullets": [
      "Massachusetts residents will gain free access to Google's online AI courses, as announced by Gov. Maura Healey.",
      "The partnership offers AI and tech courses through Google's Grow with Google program until the end of 2027.",
      "Gov. Healey aims to make Massachusetts a leader in applied AI, having invested $100 million in AI development."
    ]
  },
  {
    "title": "Charlie McAvoy apologizes for Team USA’s reaction to Trump joke about US women’s team",
    "url": "https://www.boston.com/sports/boston-bruins/2026/02/26/charlie-mcavoy-team-usa-mens-hockey-donald-trump-joke-olympics-us-womens-hockey-boston-bruins/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2026-02-26T18:35:50.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Milan_Cortina_Olympics_Ice_Hockey_84256-1-69a08d05df39a-768x432.jpg",
    "bullets": [
      "Charlie McAvoy apologized for Team USA's reaction to Donald Trump's joke about the US women's hockey team.",
      "The US women's team, captained by Hilary Knight, also won gold, but declined Trump's White House invitation.",
      "Despite the incident, McAvoy emphasized the strong bond and mutual respect between the men's and women's teams."
    ]
  },
  {
    "title": "Mayor Jake Wilson plans to tackle Somerville&#8217;s housing crisis. Will it work?",
    "url": "https://www.boston.com/news/local-news/2026/02/26/mayor-jake-wilson-plans-to-tackle-somervilles-housing-crisis-will-it-work/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-26T17:57:10.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_kreiter08062025cityview1-69a07c7508143-768x432.jpg",
    "bullets": [
      "Mayor Jake Wilson prioritizes increasing density, new zoning, and investments in affordable housing in Somerville.",
      "Somerville aims for 20% of homes to be affordable, yet housing prices have soared by at least 28% in ten years.",
      "Projects like 299 Broadway and Clarendon Hill intend to boost affordable housing, despite development slowdowns."
    ]
  }
]