[
  {
    "title": "Massport releases statement on FAA announcement, says Logan Airport will be impacted",
    "url": "https://www.boston.com/news/travel/2025/11/06/logan-airport-faa-announcement/",
    "author": "John Waller",
    "section": "News",
    "published": "2025-11-06T15:09:49.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_2024-12-27_logan_airport_standalone_abs_004-690cb8866d43e-768x432.jpg",
    "bullets": [
      "Logan Airport is among 40 airports affected by a 10% reduction in air traffic due to the government shutdown.",
      "Massport warns travelers of expected delays and cancellations, urging them to check with airlines before heading to the airport.",
      "The FAA's directive aims to maintain airspace safety, with changes set to take effect on November 7."
    ]
  },
  {
    "title": "License plate reader cameras in Brookline? Readers say it’s a bad idea.",
    "url": "https://www.boston.com/community/readers-say/2025/11/06/license-plate-cameras-brookline/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2025-11-06T15:05:22.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_turner020525METRO05brookline15-690bbec7e8c7f-768x432.jpg",
    "bullets": [
      "Brookline Select Board paused Chestnut Hill Realty's plan to install license plate reader cameras after privacy concerns.",
      "66% of Boston.com readers in a survey oppose the cameras, citing privacy issues; 32% support them for crime deterrence.",
      "Flock Safety, providing the technology, claims users control all collected data, countering privacy group's surveillance concerns."
    ]
  },
  {
    "title": "Former Celtics guard Tony Allen arrested on drug charges",
    "url": "https://www.boston.com/uncategorized/boston-celtics/2025/11/06/tony-allen-arrested/",
    "author": "The Associated Press",
    "section": "Uncategorized",
    "published": "2025-11-06T14:50:14.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/Tony_Allen_Arrested_Basketball_60101-690cb51d11675-768x432.jpg",
    "bullets": [
      "Tony Allen, former Celtics and Grizzlies player, arrested on drug possession charges in Poinsett County, Arkansas.",
      "Authorities found marijuana on Allen and cocaine in a cigarette box during a vehicle search on Interstate 555.",
      "Allen previously pled guilty to an NBA health insurance fraud scheme, receiving community service and probation."
    ]
  },
  {
    "title": "A pickup’s persistent plastic pan problems",
    "url": "https://www.boston.com/cars/how-to/2025/11/05/car-doctor-a-pickups-persistent-plastic-pan-problems/",
    "author": "John Paul",
    "section": "Cars",
    "published": "2025-11-06T04:21:06.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/Car-Doctor-690c203b2d208-768x432.jpg",
    "bullets": [
      "John Paul advises replacing the plastic oil pan with a metal one for better durability in a 2018 Ford F-150.",
      "The metal oil pan replacement for the F-150 costs $200 and takes 10 hours to replace, compared to 5 hours for plastic.",
      "Ford dealers will only replace the plastic oil pan under warranty, leaving metal replacements as a customer-paid option."
    ]
  },
  {
    "title": "Patriots get bad news with injuries ahead of Bucs matchup",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/05/new-england-patriots-injuries-rhamondre-stevenson-kayshon-boutte/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-11-06T02:58:19.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/Falcons_Patriots_Football_49692-690c0a7540143-768x432.jpg",
    "bullets": [
      "Patriots' Kayshon Boutte, Rhamondre Stevenson, Garrett Bradbury, and Christian Elliss missed practice due to injuries.",
      "Rookie TreVeyon Henderson and Terrell Jennings might fill in if Boutte and Stevenson can't play against the Bucs.",
      "Bucs' Mike Evans is absent; Chris Godwin Jr. and Bucky Irving also didn't practice due to injuries."
    ]
  },
  {
    "title": "Boston youth baseball coach pleads not guilty to drug trafficking charge",
    "url": "https://www.boston.com/news/crime/2025/11/05/boston-youth-baseball-coach-charged-with-fentanyl-trafficking-felony/",
    "author": "Darin Zullo",
    "section": "News",
    "published": "2025-11-06T02:50:02.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2025/11/bryanmejia-690c09317573a-scaled.jpeg",
    "bullets": [
      "Bryan Mejia, a coach at Boston Athletic Academy, charged with felony fentanyl trafficking for allegedly selling to an undercover officer.",
      "Court records allege Mejia was involved with more than 10 grams of fentanyl, potentially facing up to 20 years in prison.",
      "Mejia, 31, pleaded not guilty at his arraignment and was released on personal recognizance, with a court date set for December 1."
    ]
  },
  {
    "title": "Education technology company to close Boston headquarters, embrace fully remote workplace",
    "url": "https://www.boston.com/news/business/2025/11/05/education-technology-company-to-close-boston-headquarters-embrace-fully-remote-workplace/",
    "author": "Darin Zullo",
    "section": "News",
    "published": "2025-11-06T02:12:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/michaelhansen-690bff5d159d5-768x432.jpg",
    "bullets": [
      "Cengage Group is closing its Boston headquarters and moving to a fully remote workforce, closing offices in Boston, Detroit, and Cincinnati.",
      "The company will vacate its locations at 3 Center Plaza and 200 Pier 4 Blvd. in Boston's downtown and Seaport District.",
      "Cengage Group operates globally with nearly 4,000 employees, serving 90 million students across 125 countries, and is integrating AI into learning platforms."
    ]
  },
  {
    "title": "What Patriots players did during their off day that impressed Mike Vrabel",
    "url": "https://www.boston.com/sports/new-england-patriots/2025/11/05/mike-vrabel-nfl-football-new-england-patriots-off-day-workout/",
    "author": "Conor Ryan",
    "section": "Sports",
    "published": "2025-11-06T02:04:55.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_tlumackipatriots184-690bfca58934b-768x432.jpg",
    "bullets": [
      "41 New England Patriots players worked out on their off day, impressing head coach Mike Vrabel.",
      "Patriots' Stefon Diggs praised team commitment, indicating players' focus on maintaining performance mid-season.",
      "Despite 7-2 record, Vrabel and players emphasize not getting complacent and preparing for the season's latter half."
    ]
  },
  {
    "title": "Officials identify two killed in apparent murder-suicide in Beverly",
    "url": "https://www.boston.com/news/crime/2025/11/05/officials-identify-two-killed-in-apparent-murder-suicide-in-beverly/",
    "author": "Molly Farrar",
    "section": "News",
    "published": "2025-11-06T01:56:33.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2021/06/BDC_Logo_2020_256x256-60d0abc34135e.png",
    "bullets": [
      "Becky Lynn Center, 58, and John Patrick Nesbitt, 56, found dead at a Colonial Drive home in Beverly.",
      "Incident is under investigation as an apparent murder-suicide, according to Essex County District Attorney's Office.",
      "Beverly police, Massachusetts State Police, and Chief Medical Examiner's Office are investigating the deaths."
    ]
  },
  {
    "title": "South Boston man linked to Bulger sentenced to 15 years for involvement in 1984, 1993 cold case killings",
    "url": "https://www.boston.com/news/crime/2025/11/05/south-boston-man-sentenced-to-15-years-for-involvement-in-1984-1993-cold-case-killings/",
    "author": "Darin Zullo",
    "section": "News",
    "published": "2025-11-06T01:13:18.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/11/PAPXSC7LQ5JUSV6GBFLVBXGJL4-690a5da08d1d3-768x432.jpg",
    "bullets": [
      "Michael Lewis, linked to gangster Whitey Bulger, was sentenced to 15 years for 1984 and 1993 killings.",
      "Lewis pleaded guilty to manslaughter, reducing initial first-degree murder charges for deaths of Watson and Villani.",
      "The plea deal avoided life sentences due to trial risks; both murders were connected to South Boston's drug trade."
    ]
  }
]