[
  {
    "title": "Former North Shore police officer gets prison time for child porn charge",
    "url": "https://www.boston.com/news/local-news/2026/02/02/former-north-shore-police-officer-gets-prison-time-for-child-porn-charge/",
    "author": "Carson Lyle",
    "section": "News",
    "published": "2026-02-03T00:00:49.000Z",
    "image": "https://www.boston.com/wp-content/uploads/2026/02/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2019_06_04_BostonGlobe.com_Regional_Images_PlusNoConsent-698134fc15067-scaled.jpeg",
    "bullets": [
      "Former Gloucester officer Alexander Aiello sentenced to 4 years for child pornography charge; receives 5 years supervised release.",
      "Aiello pleaded guilty in October 2025 after police found over 200 child sexual abuse files on his devices.",
      "Search of Aiello's home revealed usage of Tor Browser and possession of encrypted child pornography files."
    ]
  },
  {
    "title": "‘The finest kind’: Gloucester mourns 7 lost in Lily Jean sinking as Coast Guard launches probe",
    "url": "https://www.boston.com/news/local-news/2026/02/02/gloucester-mourns-7-lost-lily-jean-fishing-boat-sinking/",
    "author": "Abby Patkin",
    "section": "News",
    "published": "2026-02-02T23:42:52.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Missing_Fishing_Boat_63204-69812fc539f25-768x432.jpg",
    "bullets": [
      "The Coast Guard confirmed all seven aboard the Gloucester-based fishing boat Lily Jean are presumed dead following its sinking.",
      "A debris field and an unoccupied life raft were found off Cape Ann; one unresponsive body was recovered by rescue teams.",
      "The Coast Guard and National Transportation Safety Board will probe the incident, with a multi-month investigation expected."
    ]
  },
  {
    "title": "Why readers think Bill Belichick belonged in the Hall of Fame this year",
    "url": "https://www.boston.com/community/readers-say/2026/02/02/bill-belichick-hall-of-fame-snub/",
    "author": "Autumn Sloboda",
    "section": "Community",
    "published": "2026-02-02T22:18:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/Hall_of_Fame_Belichick_Football_99557-697d254fc549c-768x432.jpg",
    "bullets": [
      "Bill Belichick did not receive enough votes for first-ballot induction into the 2026 Pro Football Hall of Fame.",
      "93% of Boston.com readers believe Belichick should have been inducted, citing his eight Super Bowl titles.",
      "Some readers argued scandals and reliance on Tom Brady factored into Belichick's Hall of Fame snub."
    ]
  },
  {
    "title": "Which Patriots Super Bowl will you never forget?",
    "url": "https://www.boston.com/community/tell-us/2026/02/02/favorite-patriots-super-bowl-memories/",
    "author": "Annie Jonas",
    "section": "Community",
    "published": "2026-02-02T21:29:25.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/f9708efe-9eb0-11e4-a89d-8b893f51b3d0-69810151c882d-768x432.jpg",
    "bullets": [
      "Fans invited to share most memorable Patriots Super Bowl moments with Boston.com for potential feature in a future article.",
      "Iconic Patriots moments include Vinatieri's 2002 field goal, Butler's interception, and Brady's comeback against the Falcons.",
      "Fans reminisce about personal traditions like watch parties and superstitions during Patriots Super Bowls."
    ]
  },
  {
    "title": "This runner is raising awareness about stroke and heart disease",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/02/liz-lang-tedys-team/",
    "author": "Kelly Chan",
    "section": "Community",
    "published": "2026-02-02T21:00:21.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/liz-lang-tease-6981100119108-768x432.jpg",
    "bullets": [
      "Liz Lang, 48, from Jackson, NJ, is running the 2026 Boston Marathon to raise awareness about stroke and heart disease.",
      "Lang overcame a heart arrhythmia diagnosis and now faces antiphospholipid syndrome, which increases blood clot, stroke, and heart attack risks.",
      "Fundraising for Tedy's Team, Lang aims to educate on stroke and heart disease warning signs and support research and outreach efforts."
    ]
  },
  {
    "title": "Once a patient, now a runner: She’s running for Boston Children’s Hospital",
    "url": "https://www.boston.com/community/boston-marathon/2026/02/02/molly-kokoski-boston-childrens-hospital/",
    "author": "Kelly Chan",
    "section": "Community",
    "published": "2026-02-02T20:49:04.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/01/IMG_8745-69792a9fba2b3-768x432.jpeg",
    "bullets": [
      "Molly Kokoski, 26, will run the 130th Boston Marathon to raise money for Boston Children's Hospital.",
      "Kokoski, a former patient, was treated for ulcerative colitis and uses an ostomy bag since 2021.",
      "She aims to demonstrate that an ostomy bag doesn't limit life, inspired by growing up in Massachusetts."
    ]
  },
  {
    "title": "Saks OFF 5th to close Massachusetts stores",
    "url": "https://www.boston.com/news/business/2026/02/02/saks-off-5th-to-close-massachusetts-stores/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-02T20:42:00.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Saks_Fur_Free_13241-698107d05d5a5-768x432.jpg",
    "bullets": [
      "Saks OFF 5th is closing its Assembly Row and Wrentham locations as parent company Saks Global files for bankruptcy.",
      "Saks Global will shutter most Saks OFF 5th and all Last Call stores, focusing on luxury retail and full-price operations.",
      "Saks Global secured $1.75 billion in financing to support operations during its debt restructuring process."
    ]
  },
  {
    "title": "Middleton loses $2 million state grant after failing to comply with MBTA Communities Act",
    "url": "https://www.boston.com/news/local-news/2026/02/02/middleton-loses-2-million-infrastructure-grant/",
    "author": "Annie Jonas",
    "section": "News",
    "published": "2026-02-02T19:34:42.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Image_20260202_111253-6980e08c8a629-768x432.jpeg",
    "bullets": [
      "Middleton lost a $2 million state infrastructure grant due to noncompliance with the MBTA Communities Act.",
      "The grant was meant for safety improvements at the high-crash intersection of Route 62 and Route 114.",
      "A 60-unit housing development will proceed without road upgrades, potentially worsening traffic and safety issues."
    ]
  },
  {
    "title": "Thermo Fisher to close Franklin site, impacting up to 80 workers",
    "url": "https://www.boston.com/news/business/2026/02/02/thermo-fisher-closing-franklin-site/",
    "author": "Beth Treffeisen",
    "section": "News",
    "published": "2026-02-02T19:21:01.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/Thermo_Fisher_PPD_80795-6980f8fb2fa60-768x432.jpg",
    "bullets": [
      "Thermo Fisher Scientific is closing its Franklin, MA facility by the end of 2026, affecting up to 80 workers.",
      "The company will relocate most Franklin employees to other Massachusetts locations, offering job transition support.",
      "Thermo Fisher reported a 4% revenue increase in 2025, emphasizing no larger strategic change in U.S. manufacturing commitment."
    ]
  },
  {
    "title": "To audit Legislature, DiZoglio maintains push to hire lawyers funded by GOP candidate",
    "url": "https://www.boston.com/news/local-news/2026/02/02/to-audit-legislature-dizoglio-maintains-push-to-hire-lawyers-funded-by-gop-candidate/",
    "author": "Ross Cristantiello",
    "section": "News",
    "published": "2026-02-02T18:45:27.000Z",
    "image": "https://bdc2020.o0bc.com/wp-content/uploads/2026/02/s3___bgmp-arc_arc-feeds_generic-photos_to-arc_ryandiane5met-6980ea865ba0b-768x432.jpg",
    "bullets": [
      "State Auditor Diana DiZoglio seeks Attorney General Andrea Campbell's approval to hire GOP-funded attorneys for a legislative audit.",
      "Republican candidate Mike Minogue offers financial support for outside counsel, prompting legal and ethical concerns from Campbell's office.",
      "DiZoglio aims to sue legislative leaders for audit compliance; Campbell criticizes privately funded arrangement, suggesting alternate legal appointments."
    ]
  }
]